ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <module name="CCL" id="U2225" version="1.1.0">
               <instance name="CCL">
                  <register-group name="CCL"
                                  name-in-module="CCL"
                                  address-space="base"
                                  offset="0x42003800"/>
                  <signals>
                     <signal group="IN" index="0" function="N" pad="PA04"/>
                     <signal group="IN" index="0" function="N" pad="PA16"/>
                     <signal group="IN" index="0" function="N" pad="PB22"/>
                     <signal group="IN" index="1" function="N" pad="PA05"/>
                     <signal group="IN" index="1" function="N" pad="PA17"/>
                     <signal group="IN" index="1" function="N" pad="PB00"/>
                     <signal group="IN" index="2" function="N" pad="PA06"/>
                     <signal group="IN" index="2" function="N" pad="PA18"/>
                     <signal group="IN" index="2" function="N" pad="PB01"/>
                     <signal group="IN" index="3" function="N" pad="PA08"/>
                     <signal group="IN" index="3" function="N" pad="PA30"/>
                     <signal group="IN" index="4" function="N" pad="PA09"/>
                     <signal group="IN" index="5" function="N" pad="PA10"/>
                     <signal group="IN" index="6" function="N" pad="PA22"/>
                     <signal group="IN" index="6" function="N" pad="PB06"/>
                     <signal group="IN" index="7" function="N" pad="PA23"/>
                     <signal group="IN" index="7" function="N" pad="PB07"/>
                     <signal group="IN" index="8" function="N" pad="PA24"/>
                     <signal group="IN" index="8" function="N" pad="PB08"/>
                     <signal group="IN" index="9" function="N" pad="PB14"/>
                     <signal group="IN" index="10" function="N" pad="PB15"/>
                     <signal group="IN" index="11" function="N" pad="PB10"/>
                     <signal group="IN" index="11" function="N" pad="PB16"/>
                     <signal group="OUT" index="0" function="N" pad="PA07"/>
                     <signal group="OUT" index="0" function="N" pad="PA19"/>
                     <signal group="OUT" index="0" function="N" pad="PB02"/>
                     <signal group="OUT" index="0" function="N" pad="PB23"/>
                     <signal group="OUT" index="1" function="N" pad="PA11"/>
                     <signal group="OUT" index="1" function="N" pad="PA31"/>
                     <signal group="OUT" index="1" function="N" pad="PB11"/>
                     <signal group="OUT" index="2" function="N" pad="PA25"/>
                     <signal group="OUT" index="2" function="N" pad="PB09"/>
                     <signal group="OUT" index="3" function="N" pad="PB17"/>
                  </signals>
                  <parameters>
                     <param name="GCLK_ID" value="33" caption="GCLK index for CCL"/>
                     <param name="LUT_NUM" value="4" caption="Number of LUT in a CCL"/>
                     <param name="SEQ_NUM" value="2" caption="Number of SEQ in a CCL"/>
                     <param name="INSTANCE_ID" value="78" caption="Instance index for CCL"/>
                  </parameters>
               </instance>
            </module>
            <module name="CMCC" id="U2015" version="6.0.0">
               <instance name="CMCC">
                  <register-group name="CMCC"
                                  name-in-module="CMCC"
                                  address-space="base"
                                  offset="0x41006000"/>
                  <parameters>
                     <param name="INSTANCE_ID" value="35" caption="Instance index for CMCC"/>
                  </parameters>
               </instance>
            </module>
            <module name="DAC" id="U2502" version="1.0.0">
               <instance name="DAC">
                  <register-group name="DAC"
                                  name-in-module="DAC"
                                  address-space="base"
                                  offset="0x43002400"/>
                  <signals>
                     <signal group="VOUT" index="0" function="B" pad="PA02"/>
                     <signal group="VOUT" index="1" function="B" pad="PA05"/>
                  </signals>
                  <parameters>
                     <param name="CHANNEL_SIZE" value="2" caption="Number of DACs"/>
                     <param name="DATA_SIZE" value="12" caption="Number of bits in data"/>
                     <param name="DMAC_ID_EMPTY0"
                            value="72"
                            caption="Index of DMA DAC Channel 0 Empty request"/>
                     <param name="DMAC_ID_EMPTY1"
                            value="73"
                            caption="Index of DMA DAC Channel 1 Empty request"/>
                     <param name="DMAC_ID_RESRDY0"
                            value="74"
                            caption="Index of DMA DAC Channel 0 Result Ready request"/>
                     <param name="DMAC_ID_RESRDY1"
                            value="75"
                            caption="Index of DMA DAC Channel 1 Result Ready request"/>
                     <param name="GCLK_ID" value="42" caption="Index of Generic Clock"/>
                     <param name="STEP" value="7" caption="Number of steps to reach full scale"/>
                     <param name="INSTANCE_ID" value="105" caption="Instance index for DAC"/>
                  </parameters>
               </instance>
            </module>
            <module name="DMAC" id="U2503" version="1.0.1">
               <instance name="DMAC">
                  <register-group name="DMAC"
                                  name-in-module="DMAC"
                                  address-space="base"
                                  offset="0x4100A000"/>
                  <parameters>
                     <param name="BURST"
                            value="1"
                            caption="0: no burst support; 1: burst support"/>
                     <param name="CH_BITS" value="5" caption="Number of bits to select channel"/>
                     <param name="CH_NUM" value="32" caption="Number of channels"/>
                     <param name="EVIN_NUM" value="8" caption="Number of input events"/>
                     <param name="EVOUT_NUM" value="4" caption="Number of output events"/>
                     <param name="FIFO_SIZE" value="16" caption="FIFO size for burst mode."/>
                     <param name="LVL_BITS"
                            value="2"
                            caption="Number of bits to select level priority"/>
                     <param name="LVL_NUM" value="4" caption="Enable priority level number"/>
                     <param name="QOSCTRL_D_RESETVALUE"
                            value="2"
                            caption="QOS dmac ahb interface reset value"/>
                     <param name="QOSCTRL_F_RESETVALUE"
                            value="2"
                            caption="QOS dmac fetch interface reset value"/>
                     <param name="QOSCTRL_WRB_RESETVALUE"
                            value="2"
                            caption="QOS dmac write back interface reset value"/>
                     <param name="TRIG_BITS"
                            value="7"
                            caption="Number of bits to select trigger source"/>
                     <param name="TRIG_NUM" value="85" caption="Number of peripheral triggers"/>
                     <param name="CHANNEL0_INT_SRC"
                            value="31"
                            caption="DMA Channel 0 Interrupt"/>
                     <param name="CHANNEL1_INT_SRC"
                            value="32"
                            caption="DMA Channel 1 Interrupt"/>
                     <param name="CHANNEL2_INT_SRC"
                            value="33"
                            caption="DMA Channel 2 Interrupt"/>
                     <param name="CHANNEL3_INT_SRC"
                            value="34"
                            caption="DMA Channel 3 Interrupt"/>
                     <param name="CHANNEL4_INT_SRC"
                            value="35"
                            caption="DMA Channel 4 Interrupt"/>
                     <param name="CHANNEL5_INT_SRC"
                            value="35"
                            caption="DMA Channel 5 Interrupt"/>
                     <param name="CHANNEL6_INT_SRC"
                            value="35"
                            caption="DMA Channel 6 Interrupt"/>
                     <param name="CHANNEL7_INT_SRC"
                            value="35"
                            caption="DMA Channel 7 Interrupt"/>
                     <param name="CHANNEL8_INT_SRC"
                            value="35"
                            caption="DMA Channel 8 Interrupt"/>
                     <param name="CHANNEL9_INT_SRC"
                            value="35"
                            caption="DMA Channel 9 Interrupt"/>
                     <param name="CHANNEL10_INT_SRC"
                            value="35"
                            caption="DMA Channel 10 Interrupt"/>
                     <param name="CHANNEL11_INT_SRC"
                            value="35"
                            caption="DMA Channel 11 Interrupt"/>
                     <param name="CHANNEL12_INT_SRC"
                            value="35"
                            caption="DMA Channel 12 Interrupt"/>
                     <param name="CHANNEL13_INT_SRC"
                            value="35"
                            caption="DMA Channel 13 Interrupt"/>
                     <param name="CHANNEL14_INT_SRC"
                            value="35"
                            caption="DMA Channel 14 Interrupt"/>
                     <param name="CHANNEL15_INT_SRC"
                            value="35"
                            caption="DMA Channel 15 Interrupt"/>
                     <param name="CHANNEL16_INT_SRC"
                            value="35"
                            caption="DMA Channel 16 Interrupt"/>
                     <param name="CHANNEL17_INT_SRC"
                            value="35"
                            caption="DMA Channel 17 Interrupt"/>
                     <param name="CHANNEL18_INT_SRC"
                            value="35"
                            caption="DMA Channel 18 Interrupt"/>
                     <param name="CHANNEL19_INT_SRC"
                            value="35"
                            caption="DMA Channel 19 Interrupt"/>
                     <param name="CHANNEL20_INT_SRC"
                            value="35"
                            caption="DMA Channel 20 Interrupt"/>
                     <param name="CHANNEL21_INT_SRC"
                            value="35"
                            caption="DMA Channel 21 Interrupt"/>
                     <param name="CHANNEL22_INT_SRC"
                            value="35"
                            caption="DMA Channel 22 Interrupt"/>
                     <param name="CHANNEL23_INT_SRC"
                            value="35"
                            caption="DMA Channel 23 Interrupt"/>
                     <param name="CHANNEL24_INT_SRC"
                            value="35"
                            caption="DMA Channel 24 Interrupt"/>
                     <param name="CHANNEL25_INT_SRC"
                            value="35"
                            caption="DMA Channel 25 Interrupt"/>
                     <param name="CHANNEL26_INT_SRC"
                            value="35"
                            caption="DMA Channel 26 Interrupt"/>
                     <param name="CHANNEL27_INT_SRC"
                            value="35"
                            caption="DMA Channel 27 Interrupt"/>
                     <param name="CHANNEL28_INT_SRC"
                            value="35"
                            caption="DMA Channel 28 Interrupt"/>
                     <param name="CHANNEL29_INT_SRC"
                            value="35"
                            caption="DMA Channel 29 Interrupt"/>
                     <param name="CHANNEL30_INT_SRC"
                            value="35"
                            caption="DMA Channel 30 Interrupt"/>
                     <param name="CHANNEL31_INT_SRC"
                            value="35"
                            caption="DMA Channel 31 Interrupt"/>
                     <param name="INSTANCE_ID" value="37" caption="Instance index for DMAC"/>
                  </parameters>
               </instance>
            </module>
            <module name="DSU" id="U2410" version="1.0.0">
               <instance name="DSU">
                  <register-group name="DSU"
                                  name-in-module="DSU"
                                  address-space="base"
                                  offset="0x41002000"/>
                  <parameters>
                     <param name="DMAC_ID_DCC0" value="2" caption="DMAC ID for DCC0 register"/>
                     <param name="DMAC_ID_DCC1" value="3" caption="DMAC ID for DCC1 register"/>
                     <param name="INSTANCE_ID" value="33" caption="Instance index for DSU"/>
                  </parameters>
               </instance>
            </module>
