ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <module name="PM" id="U2406" version="1.0.0">
               <instance name="PM">
                  <register-group name="PM"
                                  name-in-module="PM"
                                  address-space="base"
                                  offset="0x40000400"/>
                  <signals>
                     <signal group="RESET_N" function="default" pad="RESET_N"/>
                  </signals>
                  <parameters>
                     <param name="PD_NUM"
                            value="0"
                            caption="Number of switchable Power Domains"/>
                     <param name="INSTANCE_ID" value="1" caption="Instance index for PM"/>
                  </parameters>
               </instance>
            </module>
            <module name="PORT" id="U2210" version="2.2.0">
               <instance name="PORT">
                  <register-group name="PORT"
                                  name-in-module="PORT"
                                  address-space="base"
                                  offset="0x41008000"/>
                  <signals>
                     <signal group="P" index="0" function="default" pad="PA00"/>
                     <signal group="P" index="1" function="default" pad="PA01"/>
                     <signal group="P" index="2" function="default" pad="PA02"/>
                     <signal group="P" index="3" function="default" pad="PA03"/>
                     <signal group="P" index="4" function="default" pad="PA04"/>
                     <signal group="P" index="5" function="default" pad="PA05"/>
                     <signal group="P" index="6" function="default" pad="PA06"/>
                     <signal group="P" index="7" function="default" pad="PA07"/>
                     <signal group="P" index="8" function="default" pad="PA08"/>
                     <signal group="P" index="9" function="default" pad="PA09"/>
                     <signal group="P" index="10" function="default" pad="PA10"/>
                     <signal group="P" index="11" function="default" pad="PA11"/>
                     <signal group="P" index="12" function="default" pad="PA12"/>
                     <signal group="P" index="13" function="default" pad="PA13"/>
                     <signal group="P" index="14" function="default" pad="PA14"/>
                     <signal group="P" index="15" function="default" pad="PA15"/>
                     <signal group="P" index="16" function="default" pad="PA16"/>
                     <signal group="P" index="17" function="default" pad="PA17"/>
                     <signal group="P" index="18" function="default" pad="PA18"/>
                     <signal group="P" index="19" function="default" pad="PA19"/>
                     <signal group="P" index="20" function="default" pad="PA20"/>
                     <signal group="P" index="21" function="default" pad="PA21"/>
                     <signal group="P" index="22" function="default" pad="PA22"/>
                     <signal group="P" index="23" function="default" pad="PA23"/>
                     <signal group="P" index="24" function="default" pad="PA24"/>
                     <signal group="P" index="25" function="default" pad="PA25"/>
                     <signal group="P" index="27" function="default" pad="PA27"/>
                     <signal group="P" index="30" function="default" pad="PA30"/>
                     <signal group="P" index="31" function="default" pad="PA31"/>
                     <signal group="P" index="32" function="default" pad="PB00"/>
                     <signal group="P" index="33" function="default" pad="PB01"/>
                     <signal group="P" index="34" function="default" pad="PB02"/>
                     <signal group="P" index="35" function="default" pad="PB03"/>
                     <signal group="P" index="36" function="default" pad="PB04"/>
                     <signal group="P" index="37" function="default" pad="PB05"/>
                     <signal group="P" index="38" function="default" pad="PB06"/>
                     <signal group="P" index="39" function="default" pad="PB07"/>
                     <signal group="P" index="40" function="default" pad="PB08"/>
                     <signal group="P" index="41" function="default" pad="PB09"/>
                     <signal group="P" index="42" function="default" pad="PB10"/>
                     <signal group="P" index="43" function="default" pad="PB11"/>
                     <signal group="P" index="44" function="default" pad="PB12"/>
                     <signal group="P" index="45" function="default" pad="PB13"/>
                     <signal group="P" index="46" function="default" pad="PB14"/>
                     <signal group="P" index="47" function="default" pad="PB15"/>
                     <signal group="P" index="48" function="default" pad="PB16"/>
                     <signal group="P" index="49" function="default" pad="PB17"/>
                     <signal group="P" index="54" function="default" pad="PB22"/>
                     <signal group="P" index="55" function="default" pad="PB23"/>
                     <signal group="P" index="62" function="default" pad="PB30"/>
                     <signal group="P" index="63" function="default" pad="PB31"/>
                  </signals>
                  <parameters>
                     <param name="BITS" value="118"/>
                     <param name="DRVSTR" value="1" caption="DRVSTR supported"/>
                     <param name="EV_NUM" value="4"/>
                     <param name="GROUPS" value="2"/>
                     <param name="ODRAIN" value="0" caption="ODRAIN supported"/>
                     <param name="SLEWLIM" value="0" caption="SLEWLIM supported"/>
                     <param name="INSTANCE_ID" value="36" caption="Instance index for PORT"/>
                  </parameters>
               </instance>
            </module>
            <module name="PUKCC" id="U2009" version="2.5.0">
               <instance name="PUKCC">
                  <parameters>
                     <param name="RAM_ADDR_SIZE" value="12"/>
                     <param name="ROM_ADDR_SIZE" value="16"/>
                     <param name="INSTANCE_ID" value="76" caption="Instance index for PUKCC"/>
                  </parameters>
               </instance>
            </module>
