ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <module name="QSPI" id="U2008" version="1.6.3">
               <instance name="QSPI">
                  <register-group name="QSPI"
                                  name-in-module="QSPI"
                                  address-space="base"
                                  offset="0x42003400"/>
                  <signals>
                     <signal group="CS" function="H" pad="PB11"/>
                     <signal group="DATA" index="0" function="H" pad="PA08"/>
                     <signal group="DATA" index="1" function="H" pad="PA09"/>
                     <signal group="DATA" index="2" function="H" pad="PA10"/>
                     <signal group="DATA" index="3" function="H" pad="PA11"/>
                     <signal group="SCK" function="H" pad="PB10"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="83"/>
                     <param name="DMAC_ID_TX" value="84"/>
                     <param name="HADDR_MSB" value="23"/>
                     <param name="OCMS" value="1"/>
                     <param name="INSTANCE_ID" value="77" caption="Instance index for QSPI"/>
                  </parameters>
               </instance>
            </module>
            <module name="RAMECC" id="U2268" version="1.0.0">
               <instance name="RAMECC">
                  <register-group name="RAMECC"
                                  name-in-module="RAMECC"
                                  address-space="base"
                                  offset="0x41020000"/>
                  <parameters>
                     <param name="RAMADDR_BITS" value="13" caption="Number of RAM address bits"/>
                     <param name="RAMBANK_NUM" value="4" caption="Number of RAM banks"/>
                     <param name="INSTANCE_ID" value="48" caption="Instance index for RAMECC"/>
                  </parameters>
               </instance>
            </module>
            <module name="RSTC" id="U2239" version="4.0.0">
               <instance name="RSTC">
                  <register-group name="RSTC"
                                  name-in-module="RSTC"
                                  address-space="base"
                                  offset="0x40000C00"/>
                  <parameters>
                     <param name="BACKUP_IMPLEMENTED" value="1"/>
                     <param name="HIB_IMPLEMENTED" value="1"/>
                     <param name="NUMBER_OF_EXTWAKE"
                            value="0"
                            caption="number of external wakeup line"/>
                     <param name="NVMRST_IMPLEMENTED" value="1"/>
                     <param name="INSTANCE_ID" value="3" caption="Instance index for RSTC"/>
                  </parameters>
               </instance>
            </module>
            <module name="RTC" id="U2250" version="2.1.0">
               <instance name="RTC">
                  <register-group name="RTC"
                                  name-in-module="RTC"
                                  address-space="base"
                                  offset="0x40002400"/>
                  <signals>
                     <signal group="IN" index="0" function="RTC" pad="PB00"/>
                     <signal group="IN" index="1" function="RTC" pad="PB02"/>
                     <signal group="IN" index="2" function="RTC" pad="PA02"/>
                     <signal group="OUT" function="RTC" pad="PB01"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_TIMESTAMP"
                            value="1"
                            caption="DMA RTC timestamp trigger"/>
                     <param name="GPR_NUM"
                            value="4"
                            caption="Number of General-Purpose Registers"/>
                     <param name="NUM_OF_ALARMS" value="2" caption="Number of Alarms"/>
                     <param name="NUM_OF_BKREGS" value="8" caption="Number of Backup Registers"/>
                     <param name="NUM_OF_COMP16"
                            value="4"
                            caption="Number of 16-bit Comparators"/>
                     <param name="NUM_OF_COMP32"
                            value="2"
                            caption="Number of 32-bit Comparators"/>
                     <param name="NUM_OF_TAMPERS" value="5" caption="Number of Tamper Inputs"/>
                     <param name="PER_NUM" value="8" caption="Number of Periodic Intervals"/>
                     <param name="INSTANCE_ID" value="9" caption="Instance index for RTC"/>
                  </parameters>
               </instance>
            </module>
            <module name="SDHC" id="U2011" version="1.8.3">
               <instance name="SDHC0">
                  <register-group name="SDHC0"
                                  name-in-module="SDHC"
                                  address-space="base"
                                  offset="0x45000000"/>
                  <signals>
                     <signal group="SDCD" function="I" pad="PA06"/>
                     <signal group="SDCD" function="I" pad="PA12"/>
                     <signal group="SDCD" function="I" pad="PB12"/>
                     <signal group="SDCK" function="I" pad="PB11"/>
                     <signal group="SDCMD" function="I" pad="PA08"/>
                     <signal group="SDDAT" index="0" function="I" pad="PA09"/>
                     <signal group="SDDAT" index="1" function="I" pad="PA10"/>
                     <signal group="SDDAT" index="2" function="I" pad="PA11"/>
                     <signal group="SDDAT" index="3" function="I" pad="PB10"/>
                     <signal group="SDWP" function="I" pad="PA07"/>
                     <signal group="SDWP" function="I" pad="PA13"/>
                     <signal group="SDWP" function="I" pad="PB13"/>
                  </signals>
                  <parameters>
                     <param name="CARD_DATA_SIZE" value="4"/>
                     <param name="GCLK_ID" value="45"/>
                     <param name="GCLK_ID_SLOW" value="3"/>
                     <param name="NB_OF_DEVICES" value="1"/>
                     <param name="NB_REG_PVR" value="8"/>
                     <param name="NB_REG_RR" value="4"/>
                  </parameters>
               </instance>
            </module>
            <module name="SERCOM" id="U2201" version="5.0.0">
               <instance name="SERCOM0">
                  <register-group name="SERCOM0"
                                  name-in-module="SERCOM"
                                  address-space="base"
                                  offset="0x40003000"/>
                  <signals>
                     <signal group="PAD" index="0" function="D" pad="PA04" ioset="3"/>
                     <signal group="PAD" index="0" function="C" pad="PA08" ioset="1"/>
                     <signal group="PAD" index="1" function="D" pad="PA05" ioset="3"/>
                     <signal group="PAD" index="1" function="C" pad="PA09" ioset="1"/>
                     <signal group="PAD" index="2" function="D" pad="PA06" ioset="3"/>
                     <signal group="PAD" index="2" function="C" pad="PA10" ioset="1"/>
                     <signal group="PAD" index="3" function="D" pad="PA07" ioset="3"/>
                     <signal group="PAD" index="3" function="C" pad="PA11" ioset="1"/>
                  </signals>
                  <parameters>
                     <param name="CLK_REDUCTION"
                            value="1"
                            caption="Reduce clock options to pin 1 for SPI and USART"/>
                     <param name="DLY_COMPENSATION"
                            value="1"
                            caption="Compensates for a fast DLY50 element. Assuming 20ns"/>
                     <param name="DMA" value="1" caption="DMA support implemented?"/>
                     <param name="DMAC_ID_RX" value="4" caption="Index of DMA RX trigger"/>
                     <param name="DMAC_ID_TX" value="5" caption="Index of DMA TX trigger"/>
                     <param name="FIFO_DEPTH_POWER"
                            value="1"
                            caption="2^FIFO_DEPTH_POWER gives rx FIFO depth."/>
                     <param name="GCLK_ID_CORE" value="7"/>
                     <param name="GCLK_ID_SLOW" value="3"/>
                     <param name="INT_MSB" value="6"/>
                     <param name="PMSB" value="3"/>
                     <param name="RETENTION_SUPPORT" value="0" caption="Retention supported?"/>
                     <param name="SE_CNT" value="1" caption="SE counter included?"/>
                     <param name="SPI" value="1" caption="SPI mode implemented?"/>
                     <param name="SPI_HW_SS_CTRL"
                            value="1"
                            caption="Master _SS hardware control implemented?"/>
                     <param name="SPI_ICSPACE_EXT"
                            value="1"
                            caption="SPI inter character space implemented?"/>
                     <param name="SPI_OZMO" value="0" caption="OZMO features implemented?"/>
                     <param name="SPI_WAKE_ON_SSL"
                            value="1"
                            caption="_SS low detect implemented?"/>
                     <param name="SPI_TX_READY_INT_SRC"
                            value="46"
                            caption="SPI TX READY Interrupt"/>
                     <param name="SPI_TX_COMPLETE_INT_SRC"
                            value="47"
                            caption="SPI TX COMPLETE Interrupt"/>
                     <param name="SPI_RX_INT_SRC" value="48" caption="SPI RX Interrupt"/>
                     <param name="SPI_ERROR_INT_SRC" value="49" caption="SPI ERROR Interrupt"/>
                     <param name="TTBIT_EXTENSION"
                            value="1"
                            caption="32-bit extension implemented?"/>
                     <param name="I2CM" value="1" caption="I2C Master mode implemented?"/>
                     <param name="I2CS" value="1" caption="I2C Slave mode implemented?"/>
                     <param name="I2CS_AUTO_ACK"
                            value="1"
                            caption="I2C slave automatic acknowledge implemented?"/>
                     <param name="I2CS_GROUP_CMD"
                            value="1"
                            caption="I2C slave group command implemented?"/>
                     <param name="I2CS_SDASETUP_CNT_SIZE"
                            value="8"
                            caption="I2CS sda setup count size"/>
                     <param name="I2CS_SDASETUP_SIZE" value="4" caption="I2CS sda setup size"/>
                     <param name="I2CS_SUDAT"
                            value="1"
                            caption="I2C slave SDA setup implemented?"/>
                     <param name="I2C_FASTMP"
                            value="1"
                            caption="I2C fast mode plus implemented?"/>
                     <param name="I2C_HSMODE" value="1" caption="USART mode implemented?"/>
                     <param name="I2C_SCLSM_MODE"
                            value="1"
                            caption="I2C SCL clock stretch mode implemented?"/>
                     <param name="I2C_SMB_TIMEOUTS"
                            value="1"
                            caption="I2C SMBus timeouts implemented?"/>
                     <param name="I2C_TENBIT_ADR" value="1" caption="I2C ten bit enabled?"/>
                     <param name="I2C_0_INT_SRC" value="46" caption="I2C 0 Interrupt"/>
                     <param name="I2C_1_INT_SRC" value="47" caption="I2C 1 Interrupt"/>
                     <param name="I2C_2_INT_SRC" value="48" caption="I2C 2 Interrupt"/>
                     <param name="I2C_3_INT_SRC" value="49" caption="I2C 3 Interrupt"/>
                     <param name="USART" value="1" caption="USART mode implemented?"/>
                     <param name="USART_AUTOBAUD"
                            value="1"
                            caption="USART autobaud implemented?"/>
                     <param name="USART_COLDET"
                            value="1"
                            caption="USART collision detection implemented?"/>
                     <param name="USART_FLOW_CTRL"
                            value="1"
                            caption="USART flow control implemented?"/>
                     <param name="USART_FRAC_BAUD"
                            value="1"
                            caption="USART fractional BAUD implemented?"/>
                     <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
                     <param name="USART_ISO7816"
                            value="1"
                            caption="USART ISO7816 mode implemented?"/>
                     <param name="USART_LIN_MASTER"
                            value="1"
                            caption="USART LIN Master mode implemented?"/>
                     <param name="USART_RS485"
                            value="1"
                            caption="USART RS485 mode implemented?"/>
                     <param name="USART_SAMPA_EXT"
                            value="1"
                            caption="USART sample adjust implemented?"/>
                     <param name="USART_SAMPR_EXT"
                            value="1"
                            caption="USART oversampling adjustment implemented?"/>
                     <param name="USART_TX_READY_INT_SRC"
                            value="46"
                            caption="USART TX READY Interrupt"/>
                     <param name="USART_TX_COMPLETE_INT_SRC"
                            value="47"
                            caption="USART TX COMPLETE Interrupt"/>
                     <param name="USART_RX_INT_SRC" value="48" caption="USART RX Interrupt"/>
                     <param name="USART_ERROR_INT_SRC"
                            value="49"
                            caption="USART ERROR Interrupt"/>
                     <param name="INSTANCE_ID" value="12" caption="Instance index for SERCOM0"/>
                  </parameters>
               </instance>
               <instance name="SERCOM1">
                  <register-group name="SERCOM1"
                                  name-in-module="SERCOM"
                                  address-space="base"
                                  offset="0x40003400"/>
                  <signals>
                     <signal group="PAD" index="0" function="D" pad="PA00" ioset="4"/>
                     <signal group="PAD" index="0" function="C" pad="PA16" ioset="1"/>
                     <signal group="PAD" index="1" function="D" pad="PA01" ioset="4"/>
                     <signal group="PAD" index="1" function="C" pad="PA17" ioset="1"/>
                     <signal group="PAD" index="2" function="D" pad="PA30" ioset="4"/>
                     <signal group="PAD" index="2" function="C" pad="PA18" ioset="1"/>
                     <signal group="PAD" index="2" function="C" pad="PB22" ioset="3"/>
                     <signal group="PAD" index="3" function="D" pad="PA31" ioset="4"/>
                     <signal group="PAD" index="3" function="C" pad="PA19" ioset="1"/>
                     <signal group="PAD" index="3" function="C" pad="PB23" ioset="3"/>
                  </signals>
                  <parameters>
                     <param name="CLK_REDUCTION"
                            value="1"
                            caption="Reduce clock options to pin 1 for SPI and USART"/>
                     <param name="DLY_COMPENSATION"
                            value="1"
                            caption="Compensates for a fast DLY50 element. Assuming 20ns"/>
                     <param name="DMA" value="1" caption="DMA support implemented?"/>
                     <param name="DMAC_ID_RX" value="6" caption="Index of DMA RX trigger"/>
                     <param name="DMAC_ID_TX" value="7" caption="Index of DMA TX trigger"/>
                     <param name="FIFO_DEPTH_POWER"
                            value="1"
                            caption="2^FIFO_DEPTH_POWER gives rx FIFO depth."/>
                     <param name="GCLK_ID_CORE" value="8"/>
                     <param name="GCLK_ID_SLOW" value="3"/>
                     <param name="INT_MSB" value="6"/>
                     <param name="PMSB" value="3"/>
                     <param name="RETENTION_SUPPORT" value="0" caption="Retention supported?"/>
                     <param name="SE_CNT" value="1" caption="SE counter included?"/>
                     <param name="SPI" value="1" caption="SPI mode implemented?"/>
                     <param name="SPI_HW_SS_CTRL"
                            value="1"
                            caption="Master _SS hardware control implemented?"/>
                     <param name="SPI_ICSPACE_EXT"
                            value="1"
                            caption="SPI inter character space implemented?"/>
                     <param name="SPI_OZMO" value="0" caption="OZMO features implemented?"/>
                     <param name="SPI_WAKE_ON_SSL"
                            value="1"
                            caption="_SS low detect implemented?"/>
                     <param name="SPI_TX_READY_INT_SRC"
                            value="50"
                            caption="SPI TX READY Interrupt"/>
                     <param name="SPI_TX_COMPLETE_INT_SRC"
                            value="51"
                            caption="SPI TX COMPLETE Interrupt"/>
                     <param name="SPI_RX_INT_SRC" value="52" caption="SPI RX Interrupt"/>
                     <param name="SPI_ERROR_INT_SRC" value="53" caption="SPI ERROR Interrupt"/>
                     <param name="TTBIT_EXTENSION"
                            value="1"
                            caption="32-bit extension implemented?"/>
                     <param name="I2CM" value="1" caption="I2C Master mode implemented?"/>
                     <param name="I2CS" value="1" caption="I2C Slave mode implemented?"/>
                     <param name="I2CS_AUTO_ACK"
                            value="1"
                            caption="I2C slave automatic acknowledge implemented?"/>
                     <param name="I2CS_GROUP_CMD"
                            value="1"
                            caption="I2C slave group command implemented?"/>
                     <param name="I2CS_SDASETUP_CNT_SIZE"
                            value="8"
                            caption="I2CS sda setup count size"/>
                     <param name="I2CS_SDASETUP_SIZE" value="4" caption="I2CS sda setup size"/>
                     <param name="I2CS_SUDAT"
                            value="1"
                            caption="I2C slave SDA setup implemented?"/>
                     <param name="I2C_FASTMP"
                            value="1"
                            caption="I2C fast mode plus implemented?"/>
                     <param name="I2C_HSMODE" value="1" caption="USART mode implemented?"/>
                     <param name="I2C_SCLSM_MODE"
                            value="1"
                            caption="I2C SCL clock stretch mode implemented?"/>
                     <param name="I2C_SMB_TIMEOUTS"
                            value="1"
                            caption="I2C SMBus timeouts implemented?"/>
                     <param name="I2C_TENBIT_ADR" value="1" caption="I2C ten bit enabled?"/>
                     <param name="I2C_0_INT_SRC" value="50" caption="I2C 0 Interrupt"/>
                     <param name="I2C_1_INT_SRC" value="51" caption="I2C 1 Interrupt"/>
                     <param name="I2C_2_INT_SRC" value="52" caption="I2C 2 Interrupt"/>
                     <param name="I2C_3_INT_SRC" value="53" caption="I2C 3 Interrupt"/>
                     <param name="USART" value="1" caption="USART mode implemented?"/>
                     <param name="USART_AUTOBAUD"
                            value="1"
                            caption="USART autobaud implemented?"/>
                     <param name="USART_COLDET"
                            value="1"
                            caption="USART collision detection implemented?"/>
                     <param name="USART_FLOW_CTRL"
                            value="1"
                            caption="USART flow control implemented?"/>
                     <param name="USART_FRAC_BAUD"
                            value="1"
                            caption="USART fractional BAUD implemented?"/>
                     <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
                     <param name="USART_ISO7816"
                            value="1"
                            caption="USART ISO7816 mode implemented?"/>
                     <param name="USART_LIN_MASTER"
                            value="1"
                            caption="USART LIN Master mode implemented?"/>
                     <param name="USART_RS485"
                            value="1"
                            caption="USART RS485 mode implemented?"/>
                     <param name="USART_SAMPA_EXT"
                            value="1"
                            caption="USART sample adjust implemented?"/>
                     <param name="USART_SAMPR_EXT"
                            value="1"
                            caption="USART oversampling adjustment implemented?"/>
                     <param name="USART_TX_READY_INT_SRC"
                            value="50"
                            caption="USART TX READY Interrupt"/>
                     <param name="USART_TX_COMPLETE_INT_SRC"
                            value="51"
                            caption="USART TX COMPLETE Interrupt"/>
                     <param name="USART_RX_INT_SRC" value="52" caption="USART RX Interrupt"/>
                     <param name="USART_ERROR_INT_SRC"
                            value="53"
                            caption="USART ERROR Interrupt"/>
                     <param name="INSTANCE_ID" value="13" caption="Instance index for SERCOM1"/>
                  </parameters>
               </instance>
