ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <module name="WDT" id="U2251" version="1.1.0">
               <instance name="WDT">
                  <register-group name="WDT"
                                  name-in-module="WDT"
                                  address-space="base"
                                  offset="0x40002000"/>
                  <parameters>
                     <param name="INSTANCE_ID" value="8" caption="Instance index for WDT"/>
                  </parameters>
               </instance>
            </module>
            <module name="CoreDebug" version="1.0.0">
               <instance name="CoreDebug">
                  <register-group name="CoreDebug"
                                  name-in-module="CoreDebug"
                                  address-space="base"
                                  offset="0xE000EDF0"/>
               </instance>
            </module>
            <module name="DWT" version="1.0.0">
               <instance name="DWT">
                  <register-group name="DWT"
                                  name-in-module="DWT"
                                  address-space="base"
                                  offset="0xE0001000"/>
               </instance>
            </module>
            <module name="ETM" version="1.0.0">
               <instance name="ETM">
                  <register-group name="ETM"
                                  name-in-module="ETM"
                                  address-space="base"
                                  offset="0xE0041000"/>
               </instance>
            </module>
            <module name="FPU" version="1.0.0">
               <instance name="FPU">
                  <register-group name="FPU"
                                  name-in-module="FPU"
                                  address-space="base"
                                  offset="0xE000EF30"/>
               </instance>
            </module>
            <module name="ITM" version="1.0.0">
               <instance name="ITM">
                  <register-group name="ITM"
                                  name-in-module="ITM"
                                  address-space="base"
                                  offset="0xE0000000"/>
               </instance>
            </module>
            <module name="MPU" version="1.0.0">
               <instance name="MPU">
                  <register-group name="MPU"
                                  name-in-module="MPU"
                                  address-space="base"
                                  offset="0xE000ED90"/>
               </instance>
            </module>
            <module name="NVIC" version="1.0.0">
               <instance name="NVIC">
                  <register-group name="NVIC"
                                  name-in-module="NVIC"
                                  address-space="base"
                                  offset="0xE000E100"/>
                  <parameters>
                     <param name="NUM_IRQ" value="137" caption="Number of interrupt requests"/>
                     <param name="__NVIC_PRIO_BITS"
                            value="3"
                            caption="Number of NVIC interrupt priority bits"/>
                  </parameters>
               </instance>
            </module>
            <module name="SysTick" version="1.0.0">
               <instance name="SysTick">
                  <register-group name="SysTick"
                                  name-in-module="SysTick"
                                  address-space="base"
                                  offset="0xE000E010"/>
               </instance>
            </module>
            <module name="SystemControl" version="1.0.0">
               <instance name="SystemControl">
                  <register-group name="SystemControl"
                                  name-in-module="SystemControl"
                                  address-space="base"
                                  offset="0xE000E000"/>
               </instance>
            </module>
            <module name="TPIU" version="1.0.0">
               <instance name="TPIU">
                  <register-group name="TPIU"
                                  name-in-module="TPIU"
                                  address-space="base"
                                  offset="0xE0040000"/>
               </instance>
            </module>
         </peripherals>
         <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
            <interrupt name="Reset"
                       index="-15"
                       caption="Reset Vector, invoked on Power up and warm reset"
                       header:alternate-caption="Reset Vector"/>
            <interrupt name="NonMaskableInt"
                       index="-14"
                       caption="Non maskable Interrupt, cannot be stopped or preempted"
                       header:alternate-caption="Non-maskable Interrupt"/>
            <interrupt name="HardFault"
                       index="-13"
                       caption="Hard Fault, all classes of Fault"
                       header:alternate-caption="Hard Fault"/>
            <interrupt name="MemoryManagement"
                       index="-12"
                       caption="Memory Management, MPU mismatch, including Access Violation and No Match"
                       header:alternate-caption="Memory Management Fault"/>
            <interrupt name="BusFault"
                       index="-11"
                       caption="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault"
                       header:alternate-caption="Bus Fault"/>
            <interrupt name="UsageFault"
                       index="-10"
                       caption="Usage Fault, i.e. Undef Instruction, Illegal State Transition"
                       header:alternate-caption="Usage Fault"/>
            <interrupt name="SVCall"
                       index="-5"
                       caption="System Service Call via SVC instruction"
                       header:alternate-caption="SuperVisor Call"/>
            <interrupt name="DebugMonitor"
                       index="-4"
                       caption="Debug Monitor"
                       header:alternate-caption="Debug Monitor"/>
            <interrupt name="PendSV"
                       index="-2"
                       caption="Pendable request for system service"
                       header:alternate-caption="Pendable SerVice"/>
            <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
            <interrupt name="PM"
                       index="0"
                       module-instance="PM"
                       caption="Power Manager"/>
            <interrupt name="MCLK"
                       index="1"
                       module-instance="MCLK"
                       caption="Main Clock"/>
            <interrupt name="OSCCTRL_XOSC0"
                       index="2"
                       module-instance="OSCCTRL"
                       caption="External Oscillator 0"/>
            <interrupt name="OSCCTRL_XOSC1"
                       index="3"
                       module-instance="OSCCTRL"
                       caption="External Oscillator 1"/>
            <interrupt name="OSCCTRL_DFLL"
                       index="4"
                       module-instance="OSCCTRL"
                       caption="Digital Frequency Locked Loop"/>
            <interrupt name="OSCCTRL_DPLL0"
                       index="5"
                       module-instance="OSCCTRL"
                       caption="Digital Phase Locked Loop 0"/>
            <interrupt name="OSCCTRL_DPLL1"
                       index="6"
                       module-instance="OSCCTRL"
                       caption="Digital Phase Locked Loop 1"/>
            <interrupt name="OSC32KCTRL"
                       index="7"
                       module-instance="OSC32KCTRL"
                       caption="32Khz Oscillator Controller"/>
            <interrupt name="SUPC_OTHER"
                       index="8"
                       module-instance="SUPC"
                       caption="Suppyly controller"/>
            <interrupt name="SUPC_BODDET"
                       index="9"
                       module-instance="SUPC"
                       caption="Brown Out Detection"/>
            <interrupt name="WDT"
                       index="10"
                       module-instance="WDT"
                       caption="Watch Dog Timer"/>
            <interrupt name="RTC"
                       index="11"
                       module-instance="RTC"
                       caption="Real Time Counter"/>
            <interrupt name="EIC_EXTINT_0"
                       index="12"
                       module-instance="EIC"
                       caption="EIC Channel 0"/>
            <interrupt name="EIC_EXTINT_1"
                       index="13"
                       module-instance="EIC"
                       caption="EIC Channel 1"/>
            <interrupt name="EIC_EXTINT_2"
                       index="14"
                       module-instance="EIC"
                       caption="EIC Channel 2"/>
            <interrupt name="EIC_EXTINT_3"
                       index="15"
                       module-instance="EIC"
                       caption="EIC Channel 3"/>
            <interrupt name="EIC_EXTINT_4"
                       index="16"
                       module-instance="EIC"
                       caption="EIC Channel 4"/>
            <interrupt name="EIC_EXTINT_5"
                       index="17"
                       module-instance="EIC"
                       caption="EIC Channel 5"/>
            <interrupt name="EIC_EXTINT_6"
                       index="18"
                       module-instance="EIC"
                       caption="EIC Channel 6"/>
            <interrupt name="EIC_EXTINT_7"
                       index="19"
                       module-instance="EIC"
                       caption="EIC Channel 7"/>
            <interrupt name="EIC_EXTINT_8"
                       index="20"
                       module-instance="EIC"
                       caption="EIC Channel 8"/>
            <interrupt name="EIC_EXTINT_9"
                       index="21"
                       module-instance="EIC"
                       caption="EIC Channel 9"/>
            <interrupt name="EIC_EXTINT_10"
                       index="22"
                       module-instance="EIC"
                       caption="EIC Channel 10"/>
            <interrupt name="EIC_EXTINT_11"
                       index="23"
                       module-instance="EIC"
                       caption="EIC Channel 11"/>
            <interrupt name="EIC_EXTINT_12"
                       index="24"
                       module-instance="EIC"
                       caption="EIC Channel 12"/>
            <interrupt name="EIC_EXTINT_13"
                       index="25"
                       module-instance="EIC"
                       caption="EIC Channel 13"/>
            <interrupt name="EIC_EXTINT_14"
                       index="26"
                       module-instance="EIC"
                       caption="EIC Channel 14"/>
            <interrupt name="EIC_EXTINT_15"
                       index="27"
                       module-instance="EIC"
                       caption="EIC Channel 15"/>
            <interrupt name="FREQM"
                       index="28"
                       module-instance="FREQM"
                       caption="Frequency Meter"/>
            <interrupt name="NVMCTRL_0"
                       index="29"
                       module-instance="NVMCTRL"
                       caption="Non-Volatile Memory Controller"/>
            <interrupt name="NVMCTRL_1"
                       index="30"
                       module-instance="NVMCTRL"
                       caption="NVMCTRL SmartEEPROM Interrupts"/>
            <interrupt name="DMAC_0"
                       index="31"
                       module-instance="DMAC"
                       caption="DMA Channel 0"/>
            <interrupt name="DMAC_1"
                       index="32"
                       module-instance="DMAC"
                       caption="DMA Channel 1"/>
            <interrupt name="DMAC_2"
                       index="33"
                       module-instance="DMAC"
                       caption="DMA Channel 2"/>
            <interrupt name="DMAC_3"
                       index="34"
                       module-instance="DMAC"
                       caption="DMA Channel 3"/>
            <interrupt name="DMAC_OTHER"
                       index="35"
                       module-instance="DMAC"
                       caption="DMA Channel 4..X"/>
            <interrupt name="EVSYS_0"
                       index="36"
                       module-instance="EVSYS"
                       caption="Event System Channel 0"/>
            <interrupt name="EVSYS_1"
                       index="37"
                       module-instance="EVSYS"
                       caption="Event System Channel 1"/>
            <interrupt name="EVSYS_2"
                       index="38"
                       module-instance="EVSYS"
                       caption="Event System Channel 2"/>
            <interrupt name="EVSYS_3"
                       index="39"
                       module-instance="EVSYS"
                       caption="Event System Channel 3"/>
            <interrupt name="EVSYS_OTHER"
                       index="40"
                       module-instance="EVSYS"
                       caption="Event System Channel 4..X"/>
            <interrupt name="PAC"
                       index="41"
                       module-instance="PAC"
                       caption="Peripheral Access Controller"/>
            <interrupt name="RAMECC"
                       index="45"
                       module-instance="RAMECC"
                       caption="RAM Error Correction Code"/>
            <interrupt name="SERCOM0_0"
                       index="46"
                       module-instance="SERCOM0"
                       caption="Serial Communication Interface 0"/>
            <interrupt name="SERCOM0_1"
                       index="47"
                       module-instance="SERCOM0"
                       caption="Serial Communication Interface 0"/>
            <interrupt name="SERCOM0_2"
                       index="48"
                       module-instance="SERCOM0"
                       caption="Serial Communication Interface 0"/>
            <interrupt name="SERCOM0_OTHER"
                       index="49"
                       module-instance="SERCOM0"
                       caption="Serial Communication Interface 0"/>
            <interrupt name="SERCOM1_0"
                       index="50"
                       module-instance="SERCOM1"
                       caption="Serial Communication Interface 1"/>
            <interrupt name="SERCOM1_1"
                       index="51"
                       module-instance="SERCOM1"
                       caption="Serial Communication Interface 1"/>
            <interrupt name="SERCOM1_2"
                       index="52"
                       module-instance="SERCOM1"
                       caption="Serial Communication Interface 1"/>
            <interrupt name="SERCOM1_OTHER"
                       index="53"
                       module-instance="SERCOM1"
                       caption="Serial Communication Interface 1"/>
            <interrupt name="SERCOM2_0"
                       index="54"
                       module-instance="SERCOM2"
                       caption="Serial Communication Interface 2"/>
            <interrupt name="SERCOM2_1"
                       index="55"
                       module-instance="SERCOM2"
                       caption="Serial Communication Interface 2"/>
            <interrupt name="SERCOM2_2"
                       index="56"
                       module-instance="SERCOM2"
                       caption="Serial Communication Interface 2"/>
            <interrupt name="SERCOM2_OTHER"
                       index="57"
                       module-instance="SERCOM2"
                       caption="Serial Communication Interface 2"/>
            <interrupt name="SERCOM3_0"
                       index="58"
                       module-instance="SERCOM3"
                       caption="Serial Communication Interface 3"/>
            <interrupt name="SERCOM3_1"
                       index="59"
                       module-instance="SERCOM3"
                       caption="Serial Communication Interface 3"/>
            <interrupt name="SERCOM3_2"
                       index="60"
                       module-instance="SERCOM3"
                       caption="Serial Communication Interface 3"/>
            <interrupt name="SERCOM3_OTHER"
                       index="61"
                       module-instance="SERCOM3"
                       caption="Serial Communication Interface 3"/>
            <interrupt name="SERCOM4_0"
                       index="62"
                       module-instance="SERCOM4"
                       caption="Serial Communication Interface 4"/>
            <interrupt name="SERCOM4_1"
                       index="63"
                       module-instance="SERCOM4"
                       caption="Serial Communication Interface 4"/>
            <interrupt name="SERCOM4_2"
                       index="64"
                       module-instance="SERCOM4"
                       caption="Serial Communication Interface 4"/>
            <interrupt name="SERCOM4_OTHER"
                       index="65"
                       module-instance="SERCOM4"
                       caption="Serial Communication Interface 4"/>
            <interrupt name="SERCOM5_0"
                       index="66"
                       module-instance="SERCOM5"
                       caption="Serial Communication Interface 5"/>
            <interrupt name="SERCOM5_1"
                       index="67"
                       module-instance="SERCOM5"
                       caption="Serial Communication Interface 5"/>
            <interrupt name="SERCOM5_2"
                       index="68"
                       module-instance="SERCOM5"
                       caption="Serial Communication Interface 5"/>
            <interrupt name="SERCOM5_OTHER"
                       index="69"
                       module-instance="SERCOM5"
                       caption="Serial Communication Interface 5"/>
            <interrupt name="USB_OTHER"
                       index="80"
                       module-instance="USB"
                       caption="Universal Serial Bus"/>
            <interrupt name="USB_SOF_HSOF"
                       index="81"
                       module-instance="USB"
                       caption="USB Start of Frame"/>
            <interrupt name="USB_TRCPT0"
                       index="82"
                       module-instance="USB"
                       caption="USB Transfer Complete 0"/>
            <interrupt name="USB_TRCPT1"
                       index="83"
                       module-instance="USB"
                       caption="USB Transfer Complete 1"/>
            <interrupt name="TCC0_OTHER"
                       index="85"
                       module-instance="TCC0"
                       caption="Timer Counter Control 0"/>
            <interrupt name="TCC0_MC0"
                       index="86"
                       module-instance="TCC0"
                       caption="TCC Match/Compare 0"/>
            <interrupt name="TCC0_MC1"
                       index="87"
                       module-instance="TCC0"
                       caption="TCC Match/Compare 1"/>
            <interrupt name="TCC0_MC2"
                       index="88"
                       module-instance="TCC0"
                       caption="TCC Match/Compare 2"/>
            <interrupt name="TCC0_MC3"
                       index="89"
                       module-instance="TCC0"
                       caption="TCC Match/Compare 3"/>
            <interrupt name="TCC0_MC4"
                       index="90"
                       module-instance="TCC0"
                       caption="TCC Match/Compare 4"/>
            <interrupt name="TCC0_MC5"
                       index="91"
                       module-instance="TCC0"
                       caption="TCC Match/Compare 5"/>
            <interrupt name="TCC1_OTHER"
                       index="92"
                       module-instance="TCC1"
                       caption="Timer Counter Control 1"/>
            <interrupt name="TCC1_MC0"
                       index="93"
                       module-instance="TCC1"
                       caption="TCC Match/Compare 0"/>
            <interrupt name="TCC1_MC1"
                       index="94"
                       module-instance="TCC1"
                       caption="TCC Match/Compare 1"/>
            <interrupt name="TCC1_MC2"
                       index="95"
                       module-instance="TCC1"
                       caption="TCC Match/Compare 2"/>
            <interrupt name="TCC1_MC3"
                       index="96"
                       module-instance="TCC1"
                       caption="TCC Match/Compare 3"/>
            <interrupt name="TCC2_OTHER"
                       index="97"
                       module-instance="TCC2"
                       caption="Timer Counter Control 2"/>
            <interrupt name="TCC2_MC0"
                       index="98"
                       module-instance="TCC2"
                       caption="TCC Match/Compare 0"/>
            <interrupt name="TCC2_MC1"
                       index="99"
                       module-instance="TCC2"
                       caption="TCC Match/Compare 1"/>
            <interrupt name="TCC2_MC2"
                       index="100"
                       module-instance="TCC2"
                       caption="TCC Match/Compare 2"/>
            <interrupt name="TCC3_OTHER"
                       index="101"
                       module-instance="TCC3"
                       caption="Timer Counter Control 3"/>
            <interrupt name="TCC3_MC0"
                       index="102"
                       module-instance="TCC3"
                       caption="TCC Match/Compare 0"/>
            <interrupt name="TCC3_MC1"
                       index="103"
                       module-instance="TCC3"
                       caption="TCC Match/Compare 1"/>
            <interrupt name="TCC4_OTHER"
                       index="104"
                       module-instance="TCC4"
                       caption="Timer Counter Control 4"/>
            <interrupt name="TCC4_MC0"
                       index="105"
                       module-instance="TCC4"
                       caption="TCC Match/Compare 0"/>
            <interrupt name="TCC4_MC1"
                       index="106"
                       module-instance="TCC4"
                       caption="TCC Match/Compare 1"/>
            <interrupt name="TC0"
                       index="107"
                       module-instance="TC0"
                       caption="Timer Counter 0"/>
            <interrupt name="TC1"
                       index="108"
                       module-instance="TC1"
                       caption="Timer Counter 1"/>
            <interrupt name="TC2"
                       index="109"
                       module-instance="TC2"
                       caption="Timer Counter 2"/>
            <interrupt name="TC3"
                       index="110"
                       module-instance="TC3"
                       caption="Timer Counter 3"/>
            <interrupt name="TC4"
