ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
                       index="111"
                       module-instance="TC4"
                       caption="Timer Counter 4"/>
            <interrupt name="TC5"
                       index="112"
                       module-instance="TC5"
                       caption="Timer Counter 5"/>
            <interrupt name="PDEC_OTHER"
                       index="115"
                       module-instance="PDEC"
                       caption="Position Decoder"/>
            <interrupt name="PDEC_MC0"
                       index="116"
                       module-instance="PDEC"
                       caption="PDEC Match/Compare 0"/>
            <interrupt name="PDEC_MC1"
                       index="117"
                       module-instance="PDEC"
                       caption="PDEC Match Compare 1"/>
            <interrupt name="ADC0_OTHER"
                       index="118"
                       module-instance="ADC0"
                       caption="Analog To Digital Converter 0"/>
            <interrupt name="ADC0_RESRDY"
                       index="119"
                       module-instance="ADC0"
                       caption="ADC0 Result Ready"/>
            <interrupt name="ADC1_OTHER"
                       index="120"
                       module-instance="ADC1"
                       caption="Analog To Digital Converter 1"/>
            <interrupt name="ADC1_RESRDY"
                       index="121"
                       module-instance="ADC1"
                       caption="ADC1 Result Ready"/>
            <interrupt name="AC"
                       index="122"
                       module-instance="AC"
                       caption="Analog Comparator"/>
            <interrupt name="DAC_OTHER"
                       index="123"
                       module-instance="DAC"
                       caption="Digital to Analog Converter"/>
            <interrupt name="DAC_EMPTY_0"
                       index="124"
                       module-instance="DAC"
                       caption="DAC Buffer 0 Empty"/>
            <interrupt name="DAC_EMPTY_1"
                       index="125"
                       module-instance="DAC"
                       caption="DAC Buffer 1 Empty"/>
            <interrupt name="DAC_RESRDY_0"
                       index="126"
                       module-instance="DAC"
                       caption="DAC Filter 0 Result Ready"/>
            <interrupt name="DAC_RESRDY_1"
                       index="127"
                       module-instance="DAC"
                       caption="DAC Filter 1 Result Ready"/>
            <interrupt name="I2S"
                       index="128"
                       module-instance="I2S"
                       caption="Inter-IC Sound Interface"/>
            <interrupt name="PCC"
                       index="129"
                       module-instance="PCC"
                       caption="Parallel Capture Controller"/>
            <interrupt name="AES"
                       index="130"
                       module-instance="AES"
                       caption="Advanced Encryption Standard"/>
            <interrupt name="TRNG"
                       index="131"
                       module-instance="TRNG"
                       caption="True Random Generator"/>
            <interrupt name="ICM"
                       index="132"
                       module-instance="ICM"
                       caption="Integrity Check Monitor"/>
            <interrupt name="PUKCC"
                       index="133"
                       module-instance="PUKCC"
                       caption="Public-Key Cryptography Controller"/>
            <interrupt name="QSPI"
                       index="134"
                       module-instance="QSPI"
                       caption="Quad SPI interface"/>
            <interrupt name="SDHC0"
                       index="135"
                       module-instance="SDHC0"
                       caption="SD/MMC Host Controller 0"/>
         </interrupts>
         <events>
            <generators>
               <generator name="OSCCTRL_XOSC_FAIL_0" index="1" module-instance="OSCCTRL"/>
               <generator name="OSCCTRL_XOSC_FAIL_1" index="2" module-instance="OSCCTRL"/>
               <generator name="OSC32KCTRL_XOSC32K_FAIL"
                          index="3"
                          module-instance="OSC32KCTRL"/>
               <generator name="RTC_PER_0" index="4" module-instance="RTC"/>
               <generator name="RTC_PER_1" index="5" module-instance="RTC"/>
               <generator name="RTC_PER_2" index="6" module-instance="RTC"/>
               <generator name="RTC_PER_3" index="7" module-instance="RTC"/>
               <generator name="RTC_PER_4" index="8" module-instance="RTC"/>
               <generator name="RTC_PER_5" index="9" module-instance="RTC"/>
               <generator name="RTC_PER_6" index="10" module-instance="RTC"/>
               <generator name="RTC_PER_7" index="11" module-instance="RTC"/>
               <generator name="RTC_CMP_0" index="12" module-instance="RTC"/>
               <generator name="RTC_CMP_1" index="13" module-instance="RTC"/>
               <generator name="RTC_CMP_2" index="14" module-instance="RTC"/>
               <generator name="RTC_CMP_3" index="15" module-instance="RTC"/>
               <generator name="RTC_TAMPER" index="16" module-instance="RTC"/>
               <generator name="RTC_OVF" index="17" module-instance="RTC"/>
               <generator name="EIC_EXTINT_0" index="18" module-instance="EIC"/>
               <generator name="EIC_EXTINT_1" index="19" module-instance="EIC"/>
               <generator name="EIC_EXTINT_2" index="20" module-instance="EIC"/>
               <generator name="EIC_EXTINT_3" index="21" module-instance="EIC"/>
               <generator name="EIC_EXTINT_4" index="22" module-instance="EIC"/>
               <generator name="EIC_EXTINT_5" index="23" module-instance="EIC"/>
               <generator name="EIC_EXTINT_6" index="24" module-instance="EIC"/>
               <generator name="EIC_EXTINT_7" index="25" module-instance="EIC"/>
               <generator name="EIC_EXTINT_8" index="26" module-instance="EIC"/>
               <generator name="EIC_EXTINT_9" index="27" module-instance="EIC"/>
               <generator name="EIC_EXTINT_10" index="28" module-instance="EIC"/>
               <generator name="EIC_EXTINT_11" index="29" module-instance="EIC"/>
               <generator name="EIC_EXTINT_12" index="30" module-instance="EIC"/>
               <generator name="EIC_EXTINT_13" index="31" module-instance="EIC"/>
               <generator name="EIC_EXTINT_14" index="32" module-instance="EIC"/>
               <generator name="EIC_EXTINT_15" index="33" module-instance="EIC"/>
               <generator name="DMAC_CH_0" index="34" module-instance="DMAC"/>
               <generator name="DMAC_CH_1" index="35" module-instance="DMAC"/>
               <generator name="DMAC_CH_2" index="36" module-instance="DMAC"/>
               <generator name="DMAC_CH_3" index="37" module-instance="DMAC"/>
               <generator name="PAC_ACCERR" index="38" module-instance="PAC"/>
               <generator name="TCC0_OVF" index="41" module-instance="TCC0"/>
               <generator name="TCC0_TRG" index="42" module-instance="TCC0"/>
               <generator name="TCC0_CNT" index="43" module-instance="TCC0"/>
               <generator name="TCC0_MC_0" index="44" module-instance="TCC0"/>
               <generator name="TCC0_MC_1" index="45" module-instance="TCC0"/>
               <generator name="TCC0_MC_2" index="46" module-instance="TCC0"/>
               <generator name="TCC0_MC_3" index="47" module-instance="TCC0"/>
               <generator name="TCC0_MC_4" index="48" module-instance="TCC0"/>
               <generator name="TCC0_MC_5" index="49" module-instance="TCC0"/>
               <generator name="TCC1_OVF" index="50" module-instance="TCC1"/>
               <generator name="TCC1_TRG" index="51" module-instance="TCC1"/>
               <generator name="TCC1_CNT" index="52" module-instance="TCC1"/>
               <generator name="TCC1_MC_0" index="53" module-instance="TCC1"/>
               <generator name="TCC1_MC_1" index="54" module-instance="TCC1"/>
               <generator name="TCC1_MC_2" index="55" module-instance="TCC1"/>
               <generator name="TCC1_MC_3" index="56" module-instance="TCC1"/>
               <generator name="TCC2_OVF" index="57" module-instance="TCC2"/>
               <generator name="TCC2_TRG" index="58" module-instance="TCC2"/>
               <generator name="TCC2_CNT" index="59" module-instance="TCC2"/>
               <generator name="TCC2_MC_0" index="60" module-instance="TCC2"/>
               <generator name="TCC2_MC_1" index="61" module-instance="TCC2"/>
               <generator name="TCC2_MC_2" index="62" module-instance="TCC2"/>
               <generator name="TCC3_OVF" index="63" module-instance="TCC3"/>
               <generator name="TCC3_TRG" index="64" module-instance="TCC3"/>
               <generator name="TCC3_CNT" index="65" module-instance="TCC3"/>
               <generator name="TCC3_MC_0" index="66" module-instance="TCC3"/>
               <generator name="TCC3_MC_1" index="67" module-instance="TCC3"/>
               <generator name="TCC4_OVF" index="68" module-instance="TCC4"/>
               <generator name="TCC4_TRG" index="69" module-instance="TCC4"/>
               <generator name="TCC4_CNT" index="70" module-instance="TCC4"/>
               <generator name="TCC4_MC_0" index="71" module-instance="TCC4"/>
               <generator name="TCC4_MC_1" index="72" module-instance="TCC4"/>
               <generator name="TC0_OVF" index="73" module-instance="TC0"/>
               <generator name="TC0_MC_0" index="74" module-instance="TC0"/>
               <generator name="TC0_MC_1" index="75" module-instance="TC0"/>
               <generator name="TC1_OVF" index="76" module-instance="TC1"/>
               <generator name="TC1_MC_0" index="77" module-instance="TC1"/>
               <generator name="TC1_MC_1" index="78" module-instance="TC1"/>
               <generator name="TC2_OVF" index="79" module-instance="TC2"/>
               <generator name="TC2_MC_0" index="80" module-instance="TC2"/>
               <generator name="TC2_MC_1" index="81" module-instance="TC2"/>
               <generator name="TC3_OVF" index="82" module-instance="TC3"/>
               <generator name="TC3_MC_0" index="83" module-instance="TC3"/>
               <generator name="TC3_MC_1" index="84" module-instance="TC3"/>
               <generator name="TC4_OVF" index="85" module-instance="TC4"/>
               <generator name="TC4_MC_0" index="86" module-instance="TC4"/>
               <generator name="TC4_MC_1" index="87" module-instance="TC4"/>
               <generator name="TC5_OVF" index="88" module-instance="TC5"/>
               <generator name="TC5_MC_0" index="89" module-instance="TC5"/>
               <generator name="TC5_MC_1" index="90" module-instance="TC5"/>
               <generator name="PDEC_OVF" index="97" module-instance="PDEC"/>
               <generator name="PDEC_ERR" index="98" module-instance="PDEC"/>
               <generator name="PDEC_DIR" index="99" module-instance="PDEC"/>
               <generator name="PDEC_VLC" index="100" module-instance="PDEC"/>
               <generator name="PDEC_MC_0" index="101" module-instance="PDEC"/>
               <generator name="PDEC_MC_1" index="102" module-instance="PDEC"/>
               <generator name="ADC0_RESRDY" index="103" module-instance="ADC0"/>
               <generator name="ADC0_WINMON" index="104" module-instance="ADC0"/>
               <generator name="ADC1_RESRDY" index="105" module-instance="ADC1"/>
               <generator name="ADC1_WINMON" index="106" module-instance="ADC1"/>
               <generator name="AC_COMP_0" index="107" module-instance="AC"/>
               <generator name="AC_COMP_1" index="108" module-instance="AC"/>
               <generator name="AC_WIN_0" index="109" module-instance="AC"/>
               <generator name="DAC_EMPTY_0" index="110" module-instance="DAC"/>
               <generator name="DAC_EMPTY_1" index="111" module-instance="DAC"/>
               <generator name="DAC_RESRDY_0" index="112" module-instance="DAC"/>
               <generator name="DAC_RESRDY_1" index="113" module-instance="DAC"/>
               <generator name="TRNG_READY" index="115" module-instance="TRNG"/>
               <generator name="CCL_LUTOUT_0" index="116" module-instance="CCL"/>
               <generator name="CCL_LUTOUT_1" index="117" module-instance="CCL"/>
               <generator name="CCL_LUTOUT_2" index="118" module-instance="CCL"/>
               <generator name="CCL_LUTOUT_3" index="119" module-instance="CCL"/>
            </generators>
            <users>
               <user name="RTC_TAMPER" index="0" module-instance="RTC"/>
               <user name="PORT_EV_0" index="1" module-instance="PORT"/>
               <user name="PORT_EV_1" index="2" module-instance="PORT"/>
               <user name="PORT_EV_2" index="3" module-instance="PORT"/>
               <user name="PORT_EV_3" index="4" module-instance="PORT"/>
               <user name="DMAC_CH_0" index="5" module-instance="DMAC"/>
               <user name="DMAC_CH_1" index="6" module-instance="DMAC"/>
               <user name="DMAC_CH_2" index="7" module-instance="DMAC"/>
               <user name="DMAC_CH_3" index="8" module-instance="DMAC"/>
               <user name="DMAC_CH_4" index="9" module-instance="DMAC"/>
               <user name="DMAC_CH_5" index="10" module-instance="DMAC"/>
               <user name="DMAC_CH_6" index="11" module-instance="DMAC"/>
               <user name="DMAC_CH_7" index="12" module-instance="DMAC"/>
               <user name="CM4_TRACE_START" index="14" module-instance="CM4"/>
               <user name="CM4_TRACE_STOP" index="15" module-instance="CM4"/>
               <user name="CM4_TRACE_TRIG" index="16" module-instance="CM4"/>
               <user name="TCC0_EV_0" index="17" module-instance="TCC0"/>
               <user name="TCC0_EV_1" index="18" module-instance="TCC0"/>
               <user name="TCC0_MC_0" index="19" module-instance="TCC0"/>
               <user name="TCC0_MC_1" index="20" module-instance="TCC0"/>
               <user name="TCC0_MC_2" index="21" module-instance="TCC0"/>
               <user name="TCC0_MC_3" index="22" module-instance="TCC0"/>
               <user name="TCC0_MC_4" index="23" module-instance="TCC0"/>
               <user name="TCC0_MC_5" index="24" module-instance="TCC0"/>
               <user name="TCC1_EV_0" index="25" module-instance="TCC1"/>
               <user name="TCC1_EV_1" index="26" module-instance="TCC1"/>
               <user name="TCC1_MC_0" index="27" module-instance="TCC1"/>
               <user name="TCC1_MC_1" index="28" module-instance="TCC1"/>
               <user name="TCC1_MC_2" index="29" module-instance="TCC1"/>
               <user name="TCC1_MC_3" index="30" module-instance="TCC1"/>
               <user name="TCC2_EV_0" index="31" module-instance="TCC2"/>
               <user name="TCC2_EV_1" index="32" module-instance="TCC2"/>
               <user name="TCC2_MC_0" index="33" module-instance="TCC2"/>
               <user name="TCC2_MC_1" index="34" module-instance="TCC2"/>
               <user name="TCC2_MC_2" index="35" module-instance="TCC2"/>
               <user name="TCC3_EV_0" index="36" module-instance="TCC3"/>
               <user name="TCC3_EV_1" index="37" module-instance="TCC3"/>
               <user name="TCC3_MC_0" index="38" module-instance="TCC3"/>
               <user name="TCC3_MC_1" index="39" module-instance="TCC3"/>
               <user name="TCC4_EV_0" index="40" module-instance="TCC4"/>
               <user name="TCC4_EV_1" index="41" module-instance="TCC4"/>
               <user name="TCC4_MC_0" index="42" module-instance="TCC4"/>
               <user name="TCC4_MC_1" index="43" module-instance="TCC4"/>
               <user name="TC0_EVU" index="44" module-instance="TC0"/>
               <user name="TC1_EVU" index="45" module-instance="TC1"/>
               <user name="TC2_EVU" index="46" module-instance="TC2"/>
               <user name="TC3_EVU" index="47" module-instance="TC3"/>
               <user name="TC4_EVU" index="48" module-instance="TC4"/>
               <user name="TC5_EVU" index="49" module-instance="TC5"/>
               <user name="PDEC_EVU_0" index="52" module-instance="PDEC"/>
               <user name="PDEC_EVU_1" index="53" module-instance="PDEC"/>
               <user name="PDEC_EVU_2" index="54" module-instance="PDEC"/>
               <user name="ADC0_START" index="55" module-instance="ADC0"/>
               <user name="ADC0_SYNC" index="56" module-instance="ADC0"/>
               <user name="ADC1_START" index="57" module-instance="ADC1"/>
               <user name="ADC1_SYNC" index="58" module-instance="ADC1"/>
               <user name="AC_SOC_0" index="59" module-instance="AC"/>
               <user name="AC_SOC_1" index="60" module-instance="AC"/>
               <user name="DAC_START_0" index="61" module-instance="DAC"/>
               <user name="DAC_START_1" index="62" module-instance="DAC"/>
               <user name="CCL_LUTIN_0" index="63" module-instance="CCL"/>
               <user name="CCL_LUTIN_1" index="64" module-instance="CCL"/>
               <user name="CCL_LUTIN_2" index="65" module-instance="CCL"/>
               <user name="CCL_LUTIN_3" index="66" module-instance="CCL"/>
            </users>
         </events>
         <interfaces>
            <interface name="SWD" type="swd"/>
         </interfaces>
         <property-groups>
            <property-group name="SIGNATURES">
               <property name="DSU_DID" value="0x60060305"/>
            </property-group>
         </property-groups>
      </device>
   </devices>
   <modules>
      <module name="AC"
              id="U2501"
              version="1.0.0"
              caption="Analog Comparators">
         <register-group name="AC" caption="Analog Comparators">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
            </register>
            <register name="CTRLB"
                      offset="0x1"
                      rw="W"
                      size="1"
                      initval="0x00"
                      caption="Control B">
               <bitfield name="START0" caption="Comparator 0 Start Comparison" mask="0x1"/>
               <bitfield name="START1" caption="Comparator 1 Start Comparison" mask="0x2"/>
            </register>
            <register name="EVCTRL"
                      offset="0x2"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Event Control">
               <bitfield name="COMPEO0"
                         caption="Comparator 0 Event Output Enable"
                         mask="0x1"/>
               <bitfield name="COMPEO1"
                         caption="Comparator 1 Event Output Enable"
                         mask="0x2"/>
               <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x10"/>
               <bitfield name="COMPEI0"
                         caption="Comparator 0 Event Input Enable"
                         mask="0x100"/>
               <bitfield name="COMPEI1"
                         caption="Comparator 1 Event Input Enable"
                         mask="0x200"/>
               <bitfield name="INVEI0"
                         caption="Comparator 0 Input Event Invert Enable"
                         mask="0x1000"/>
               <bitfield name="INVEI1"
                         caption="Comparator 1 Input Event Invert Enable"
                         mask="0x2000"/>
            </register>
