ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="CALIB"
                      offset="0x24"
                      rw="RW"
                      size="2"
                      initval="0x0101"
                      caption="Calibration">
               <bitfield name="BIAS0" caption="COMP0/1 Bias Scaling" mask="0x3"/>
            </register>
         </register-group>
         <value-group name="AC_STATUSA__WSTATE0">
            <value name="ABOVE" caption="Signal is above window" value="0"/>
            <value name="INSIDE" caption="Signal is inside window" value="1"/>
            <value name="BELOW" caption="Signal is below window" value="2"/>
         </value-group>
         <value-group name="AC_WINCTRL__WINTSEL0">
            <value name="ABOVE" caption="Interrupt on signal above window" value="0"/>
            <value name="INSIDE" caption="Interrupt on signal inside window" value="1"/>
            <value name="BELOW" caption="Interrupt on signal below window" value="2"/>
            <value name="OUTSIDE"
                   caption="Interrupt on signal outside window"
                   value="3"/>
         </value-group>
         <value-group name="AC_COMPCTRL__FLEN">
            <value name="OFF" caption="No filtering" value="0"/>
            <value name="MAJ3" caption="3-bit majority function (2 of 3)" value="1"/>
            <value name="MAJ5" caption="5-bit majority function (3 of 5)" value="2"/>
         </value-group>
         <value-group name="AC_COMPCTRL__HYST">
            <value name="HYST25" caption="25mV" value="0"/>
            <value name="HYST50" caption="50mV" value="1"/>
            <value name="HYST75" caption="75mV" value="2"/>
            <value name="HYST100" caption="100mV" value="3"/>
         </value-group>
         <value-group name="AC_COMPCTRL__INTSEL">
            <value name="TOGGLE"
                   caption="Interrupt on comparator output toggle"
                   value="0"/>
            <value name="RISING"
                   caption="Interrupt on comparator output rising"
                   value="1"/>
            <value name="FALLING"
                   caption="Interrupt on comparator output falling"
                   value="2"/>
            <value name="EOC"
                   caption="Interrupt on end of comparison (single-shot mode only)"
                   value="3"/>
         </value-group>
         <value-group name="AC_COMPCTRL__MUXNEG">
            <value name="PIN0" caption="I/O pin 0" value="0"/>
            <value name="PIN1" caption="I/O pin 1" value="1"/>
            <value name="PIN2" caption="I/O pin 2" value="2"/>
            <value name="PIN3" caption="I/O pin 3" value="3"/>
            <value name="GND" caption="Ground" value="4"/>
            <value name="VSCALE" caption="VDD scaler" value="5"/>
            <value name="BANDGAP" caption="Internal bandgap voltage" value="6"/>
            <value name="DAC" caption="DAC output" value="7"/>
         </value-group>
         <value-group name="AC_COMPCTRL__MUXPOS">
            <value name="PIN0" caption="I/O pin 0" value="0"/>
            <value name="PIN1" caption="I/O pin 1" value="1"/>
            <value name="PIN2" caption="I/O pin 2" value="2"/>
            <value name="PIN3" caption="I/O pin 3" value="3"/>
            <value name="VSCALE" caption="VDD Scaler" value="4"/>
         </value-group>
         <value-group name="AC_COMPCTRL__OUT">
            <value name="OFF"
                   caption="The output of COMPn is not routed to the COMPn I/O port"
                   value="0"/>
            <value name="ASYNC"
                   caption="The asynchronous output of COMPn is routed to the COMPn I/O port"
                   value="1"/>
            <value name="SYNC"
                   caption="The synchronous output (including filtering) of COMPn is routed to the COMPn I/O port"
                   value="2"/>
         </value-group>
         <value-group name="AC_COMPCTRL__SPEED">
            <value name="HIGH" caption="High speed" value="3"/>
         </value-group>
      </module>
      <module name="ADC"
              id="U2500"
              version="1.0.0"
              caption="Analog Digital Converter">
         <register-group name="ADC" caption="Analog Digital Converter">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="DUALSEL"
                         caption="Dual Mode Trigger Selection"
                         mask="0x18"
                         values="ADC_CTRLA__DUALSEL"/>
               <bitfield name="SLAVEEN" caption="Slave Enable" mask="0x20"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
               <bitfield name="PRESCALER"
                         caption="Prescaler Configuration"
                         mask="0x700"
                         values="ADC_CTRLA__PRESCALER"/>
               <bitfield name="R2R" caption="Rail to Rail Operation Enable" mask="0x8000"/>
            </register>
            <register name="EVCTRL"
                      offset="0x2"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Event Control">
               <bitfield name="FLUSHEI" caption="Flush Event Input Enable" mask="0x1"/>
               <bitfield name="STARTEI"
                         caption="Start Conversion Event Input Enable"
                         mask="0x2"/>
               <bitfield name="FLUSHINV" caption="Flush Event Invert Enable" mask="0x4"/>
               <bitfield name="STARTINV"
                         caption="Start Conversion Event Invert Enable"
                         mask="0x8"/>
               <bitfield name="RESRDYEO" caption="Result Ready Event Out" mask="0x10"/>
               <bitfield name="WINMONEO" caption="Window Monitor Event Out" mask="0x20"/>
            </register>
            <register name="DBGCTRL"
                      offset="0x3"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Debug Control">
               <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
            </register>
            <register name="INPUTCTRL"
                      offset="0x4"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="Input Control">
               <bitfield name="MUXPOS"
                         caption="Positive Mux Input Selection"
                         mask="0x1F"
                         values="ADC_INPUTCTRL__MUXPOS"/>
               <bitfield name="DIFFMODE" caption="Differential Mode" mask="0x80"/>
               <bitfield name="MUXNEG"
                         caption="Negative Mux Input Selection"
                         mask="0x1F00"
                         values="ADC_INPUTCTRL__MUXNEG"/>
               <bitfield name="DSEQSTOP" caption="Stop DMA Sequencing" mask="0x8000"/>
            </register>
            <register name="CTRLB"
                      offset="0x6"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="Control B">
               <bitfield name="LEFTADJ" caption="Left-Adjusted Result" mask="0x1"/>
               <bitfield name="FREERUN" caption="Free Running Mode" mask="0x2"/>
               <bitfield name="CORREN" caption="Digital Correction Logic Enable" mask="0x4"/>
               <bitfield name="RESSEL"
                         caption="Conversion Result Resolution"
                         mask="0x18"
                         values="ADC_CTRLB__RESSEL"/>
               <bitfield name="WINMODE"
                         caption="Window Monitor Mode"
                         mask="0x700"
                         values="ADC_CTRLB__WINMODE"/>
               <bitfield name="WINSS" caption="Window Single Sample" mask="0x800"/>
            </register>
