ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="REFCTRL"
                      offset="0x8"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Reference Control">
               <bitfield name="REFSEL"
                         caption="Reference Selection"
                         mask="0xF"
                         values="ADC_REFCTRL__REFSEL"/>
               <bitfield name="REFCOMP"
                         caption="Reference Buffer Offset Compensation Enable"
                         mask="0x80"/>
            </register>
            <register name="AVGCTRL"
                      offset="0xA"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Average Control">
               <bitfield name="SAMPLENUM"
                         caption="Number of Samples to be Collected"
                         mask="0xF"
                         values="ADC_AVGCTRL__SAMPLENUM"/>
               <bitfield name="ADJRES"
                         caption="Adjusting Result / Division Coefficient"
                         mask="0x70"/>
            </register>
            <register name="SAMPCTRL"
                      offset="0xB"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Sample Time Control">
               <bitfield name="SAMPLEN" caption="Sampling Time Length" mask="0x3F"/>
               <bitfield name="OFFCOMP"
                         caption="Comparator Offset Compensation Enable"
                         mask="0x80"/>
            </register>
            <register name="WINLT"
                      offset="0xC"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="Window Monitor Lower Threshold">
               <bitfield name="WINLT" caption="Window Lower Threshold" mask="0xFFFF"/>
            </register>
            <register name="WINUT"
                      offset="0xE"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="Window Monitor Upper Threshold">
               <bitfield name="WINUT" caption="Window Upper Threshold" mask="0xFFFF"/>
            </register>
            <register name="GAINCORR"
                      offset="0x10"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="Gain Correction">
               <bitfield name="GAINCORR" caption="Gain Correction Value" mask="0xFFF"/>
            </register>
            <register name="OFFSETCORR"
                      offset="0x12"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="Offset Correction">
               <bitfield name="OFFSETCORR" caption="Offset Correction Value" mask="0xFFF"/>
            </register>
            <register name="SWTRIG"
                      offset="0x14"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Software Trigger">
               <bitfield name="FLUSH" caption="ADC Conversion Flush" mask="0x1"/>
               <bitfield name="START" caption="Start ADC Conversion" mask="0x2"/>
            </register>
            <register name="INTENCLR"
                      offset="0x2C"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="RESRDY" caption="Result Ready Interrupt Disable" mask="0x1"/>
               <bitfield name="OVERRUN" caption="Overrun Interrupt Disable" mask="0x2"/>
               <bitfield name="WINMON" caption="Window Monitor Interrupt Disable" mask="0x4"/>
            </register>
            <register name="INTENSET"
                      offset="0x2D"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="RESRDY" caption="Result Ready Interrupt Enable" mask="0x1"/>
               <bitfield name="OVERRUN" caption="Overrun Interrupt Enable" mask="0x2"/>
               <bitfield name="WINMON" caption="Window Monitor Interrupt Enable" mask="0x4"/>
            </register>
            <register name="INTFLAG"
                      offset="0x2E"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="RESRDY" caption="Result Ready Interrupt Flag" mask="0x1"/>
               <bitfield name="OVERRUN" caption="Overrun Interrupt Flag" mask="0x2"/>
               <bitfield name="WINMON" caption="Window Monitor Interrupt Flag" mask="0x4"/>
            </register>
            <register name="STATUS"
                      offset="0x2F"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Status">
               <bitfield name="ADCBUSY" caption="ADC Busy Status" mask="0x1"/>
               <bitfield name="WCC" caption="Window Comparator Counter" mask="0xFC"/>
            </register>
            <register name="SYNCBUSY"
                      offset="0x30"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Synchronization Busy">
               <bitfield name="SWRST" caption="SWRST Synchronization Busy" mask="0x1"/>
               <bitfield name="ENABLE" caption="ENABLE Synchronization Busy" mask="0x2"/>
               <bitfield name="INPUTCTRL"
                         caption="Input Control Synchronization Busy"
                         mask="0x4"/>
               <bitfield name="CTRLB" caption="Control B Synchronization Busy" mask="0x8"/>
               <bitfield name="REFCTRL"
                         caption="Reference Control Synchronization Busy"
                         mask="0x10"/>
               <bitfield name="AVGCTRL"
                         caption="Average Control Synchronization Busy"
                         mask="0x20"/>
               <bitfield name="SAMPCTRL"
                         caption="Sampling Time Control Synchronization Busy"
                         mask="0x40"/>
               <bitfield name="WINLT"
                         caption="Window Monitor Lower Threshold Synchronization Busy"
                         mask="0x80"/>
               <bitfield name="WINUT"
                         caption="Window Monitor Upper Threshold Synchronization Busy"
                         mask="0x100"/>
               <bitfield name="GAINCORR"
                         caption="Gain Correction Synchronization Busy"
                         mask="0x200"/>
               <bitfield name="OFFSETCORR"
                         caption="Offset Correction Synchronization Busy"
                         mask="0x400"/>
               <bitfield name="SWTRIG"
                         caption="Software Trigger Synchronization Busy"
                         mask="0x800"/>
            </register>
            <register name="DSEQDATA"
                      offset="0x34"
                      rw="W"
                      size="4"
                      initval="0x00000000"
                      caption="DMA Sequencial Data">
               <bitfield name="DATA" caption="DMA Sequential Data" mask="0xFFFFFFFF"/>
            </register>
