ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="DSEQCTRL"
                      offset="0x38"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="DMA Sequential Control">
               <bitfield name="INPUTCTRL" caption="Input Control" mask="0x1"/>
               <bitfield name="CTRLB" caption="Control B" mask="0x2"/>
               <bitfield name="REFCTRL" caption="Reference Control" mask="0x4"/>
               <bitfield name="AVGCTRL" caption="Average Control" mask="0x8"/>
               <bitfield name="SAMPCTRL" caption="Sampling Time Control" mask="0x10"/>
               <bitfield name="WINLT" caption="Window Monitor Lower Threshold" mask="0x20"/>
               <bitfield name="WINUT" caption="Window Monitor Upper Threshold" mask="0x40"/>
               <bitfield name="GAINCORR" caption="Gain Correction" mask="0x80"/>
               <bitfield name="OFFSETCORR" caption="Offset Correction" mask="0x100"/>
               <bitfield name="AUTOSTART"
                         caption="ADC Auto-Start Conversion"
                         mask="0x80000000"/>
            </register>
            <register name="DSEQSTAT"
                      offset="0x3C"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="DMA Sequencial Status">
               <bitfield name="INPUTCTRL" caption="Input Control" mask="0x1"/>
               <bitfield name="CTRLB" caption="Control B" mask="0x2"/>
               <bitfield name="REFCTRL" caption="Reference Control" mask="0x4"/>
               <bitfield name="AVGCTRL" caption="Average Control" mask="0x8"/>
               <bitfield name="SAMPCTRL" caption="Sampling Time Control" mask="0x10"/>
               <bitfield name="WINLT" caption="Window Monitor Lower Threshold" mask="0x20"/>
               <bitfield name="WINUT" caption="Window Monitor Upper Threshold" mask="0x40"/>
               <bitfield name="GAINCORR" caption="Gain Correction" mask="0x80"/>
               <bitfield name="OFFSETCORR" caption="Offset Correction" mask="0x100"/>
               <bitfield name="BUSY" caption="DMA Sequencing Busy" mask="0x80000000"/>
            </register>
            <register name="RESULT"
                      offset="0x40"
                      rw="R"
                      size="2"
                      initval="0x0000"
                      caption="Result Conversion Value">
               <bitfield name="RESULT" caption="Result Conversion Value" mask="0xFFFF"/>
            </register>
            <register name="RESS"
                      offset="0x44"
                      rw="R"
                      size="2"
                      initval="0x0000"
                      caption="Last Sample Result">
               <bitfield name="RESS" caption="Last ADC conversion result" mask="0xFFFF"/>
            </register>
            <register name="CALIB"
                      offset="0x48"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Calibration">
               <bitfield name="BIASCOMP" caption="Bias Comparator Scaling" mask="0x7"/>
               <bitfield name="BIASR2R" caption="Bias R2R Ampli scaling" mask="0x70"/>
               <bitfield name="BIASREFBUF"
                         caption="Bias  Reference Buffer Scaling"
                         mask="0x700"/>
            </register>
         </register-group>
         <value-group name="ADC_CTRLA__DUALSEL">
            <value name="BOTH"
                   caption="Start event or software trigger will start a conversion on both ADCs"
                   value="0"/>
            <value name="INTERLEAVE"
                   caption="START event or software trigger will alternatingly start a conversion on ADC0 and ADC1"
                   value="1"/>
         </value-group>
         <value-group name="ADC_CTRLA__PRESCALER">
            <value name="DIV2" caption="Peripheral clock divided by 2" value="0"/>
            <value name="DIV4" caption="Peripheral clock divided by 4" value="1"/>
            <value name="DIV8" caption="Peripheral clock divided by 8" value="2"/>
            <value name="DIV16" caption="Peripheral clock divided by 16" value="3"/>
            <value name="DIV32" caption="Peripheral clock divided by 32" value="4"/>
            <value name="DIV64" caption="Peripheral clock divided by 64" value="5"/>
            <value name="DIV128" caption="Peripheral clock divided by 128" value="6"/>
            <value name="DIV256" caption="Peripheral clock divided by 256" value="7"/>
         </value-group>
         <value-group name="ADC_INPUTCTRL__MUXNEG">
            <value name="AIN0" caption="ADC AIN0 Pin" value="0x0"/>
            <value name="AIN1" caption="ADC AIN1 Pin" value="0x1"/>
            <value name="AIN2" caption="ADC AIN2 Pin" value="0x2"/>
            <value name="AIN3" caption="ADC AIN3 Pin" value="0x3"/>
            <value name="AIN4" caption="ADC AIN4 Pin" value="0x4"/>
            <value name="AIN5" caption="ADC AIN5 Pin" value="0x5"/>
            <value name="AIN6" caption="ADC AIN6 Pin" value="0x6"/>
            <value name="AIN7" caption="ADC AIN7 Pin" value="0x7"/>
            <value name="GND" caption="Internal Ground" value="0x18"/>
         </value-group>
         <value-group name="ADC_INPUTCTRL__MUXPOS">
            <value name="AIN0" caption="ADC AIN0 Pin" value="0x0"/>
            <value name="AIN1" caption="ADC AIN1 Pin" value="0x1"/>
            <value name="AIN2" caption="ADC AIN2 Pin" value="0x2"/>
            <value name="AIN3" caption="ADC AIN3 Pin" value="0x3"/>
            <value name="AIN4" caption="ADC AIN4 Pin" value="0x4"/>
            <value name="AIN5" caption="ADC AIN5 Pin" value="0x5"/>
            <value name="AIN6" caption="ADC AIN6 Pin" value="0x6"/>
            <value name="AIN7" caption="ADC AIN7 Pin" value="0x7"/>
            <value name="AIN8" caption="ADC AIN8 Pin" value="0x8"/>
            <value name="AIN9" caption="ADC AIN9 Pin" value="0x9"/>
            <value name="AIN10" caption="ADC AIN10 Pin" value="0xA"/>
            <value name="AIN11" caption="ADC AIN11 Pin" value="0xB"/>
            <value name="AIN12" caption="ADC AIN12 Pin" value="0xC"/>
            <value name="AIN13" caption="ADC AIN13 Pin" value="0xD"/>
            <value name="AIN14" caption="ADC AIN14 Pin" value="0xE"/>
            <value name="AIN15" caption="ADC AIN15 Pin" value="0xF"/>
            <value name="SCALEDCOREVCC" caption="1/4 Scaled Core Supply" value="0x18"/>
            <value name="SCALEDVBAT" caption="1/4 Scaled VBAT Supply" value="0x19"/>
            <value name="SCALEDIOVCC" caption="1/4 Scaled I/O Supply" value="0x1A"/>
            <value name="BANDGAP" caption="Bandgap Voltage" value="0x1B"/>
            <value name="PTAT" caption="Temperature Sensor TSENSP" value="0x1C"/>
            <value name="CTAT" caption="Temperature Sensor TSENSC" value="0x1D"/>
            <value name="DAC" caption="DAC Output" value="0x1E"/>
            <value name="PTC" caption="PTC output (only on ADC0)" value="0x1F"/>
         </value-group>
