ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="ADC_CTRLB__RESSEL">
            <value name="12BIT" caption="12-bit result" value="0x0"/>
            <value name="16BIT" caption="For averaging mode output" value="0x1"/>
            <value name="10BIT" caption="10-bit result" value="0x2"/>
            <value name="8BIT" caption="8-bit result" value="0x3"/>
         </value-group>
         <value-group name="ADC_CTRLB__WINMODE">
            <value name="DISABLE" caption="No window mode (default)" value="0"/>
            <value name="MODE1" caption="RESULT &gt; WINLT" value="1"/>
            <value name="MODE2" caption="RESULT &lt; WINUT" value="2"/>
            <value name="MODE3" caption="WINLT &lt; RESULT &lt; WINUT" value="3"/>
            <value name="MODE4" caption="!(WINLT &lt; RESULT &lt; WINUT)" value="4"/>
         </value-group>
         <value-group name="ADC_REFCTRL__REFSEL">
            <value name="INTREF" caption="Internal Bandgap Reference" value="0x0"/>
            <value name="INTVCC0" caption="1/2 VDDANA" value="0x2"/>
            <value name="INTVCC1" caption="VDDANA" value="0x3"/>
            <value name="AREFA" caption="External Reference A" value="0x4"/>
            <value name="AREFB" caption="External Reference B" value="0x5"/>
            <value name="AREFC"
                   caption="External Reference C (only on ADC1)"
                   value="0x6"/>
         </value-group>
         <value-group name="ADC_AVGCTRL__SAMPLENUM">
            <value name="1" caption="1 sample" value="0x0"/>
            <value name="2" caption="2 samples" value="0x1"/>
            <value name="4" caption="4 samples" value="0x2"/>
            <value name="8" caption="8 samples" value="0x3"/>
            <value name="16" caption="16 samples" value="0x4"/>
            <value name="32" caption="32 samples" value="0x5"/>
            <value name="64" caption="64 samples" value="0x6"/>
            <value name="128" caption="128 samples" value="0x7"/>
            <value name="256" caption="256 samples" value="0x8"/>
            <value name="512" caption="512 samples" value="0x9"/>
            <value name="1024" caption="1024 samples" value="0xA"/>
         </value-group>
      </module>
      <module name="AES"
              id="U2238"
              version="2.2.0"
              caption="Advanced Encryption Standard">
         <register-group name="AES" caption="Advanced Encryption Standard">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="AESMODE"
                         caption="AES Modes of operation"
                         mask="0x1C"
                         values="AES_CTRLA__AESMODE"/>
               <bitfield name="CFBS"
                         caption="Cipher Feedback Block Size"
                         mask="0xE0"
                         values="AES_CTRLA__CFBS"/>
               <bitfield name="KEYSIZE"
                         caption="Encryption Key Size"
                         mask="0x300"
                         values="AES_CTRLA__KEYSIZE"/>
               <bitfield name="CIPHER"
                         caption="Cipher Mode"
                         mask="0x400"
                         values="AES_CTRLA__CIPHER"/>
               <bitfield name="STARTMODE"
                         caption="Start Mode Select"
                         mask="0x800"
                         values="AES_CTRLA__STARTMODE"/>
               <bitfield name="LOD"
                         caption="Last Output Data Mode"
                         mask="0x1000"
                         values="AES_CTRLA__LOD"/>
               <bitfield name="KEYGEN"
                         caption="Last Key Generation"
                         mask="0x2000"
                         values="AES_CTRLA__KEYGEN"/>
               <bitfield name="XORKEY"
                         caption="XOR Key Operation"
                         mask="0x4000"
                         values="AES_CTRLA__XORKEY"/>
               <bitfield name="CTYPE" caption="Counter Measure Type" mask="0xF0000"/>
            </register>
            <register name="CTRLB"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Control B">
               <bitfield name="START" caption="Start Encryption/Decryption" mask="0x1"/>
               <bitfield name="NEWMSG" caption="New message" mask="0x2"/>
               <bitfield name="EOM" caption="End of message" mask="0x4"/>
               <bitfield name="GFMUL" caption="GF Multiplication" mask="0x8"/>
            </register>
            <register name="INTENCLR"
                      offset="0x5"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="ENCCMP"
                         caption="Encryption Complete Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="GFMCMP"
                         caption="GF Multiplication Complete Interrupt Enable"
                         mask="0x2"/>
            </register>
            <register name="INTENSET"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="ENCCMP"
                         caption="Encryption Complete Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="GFMCMP"
                         caption="GF Multiplication Complete Interrupt Enable"
                         mask="0x2"/>
            </register>
            <register name="INTFLAG"
                      offset="0x7"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Status">
               <bitfield name="ENCCMP" caption="Encryption Complete" mask="0x1"/>
               <bitfield name="GFMCMP" caption="GF Multiplication Complete" mask="0x2"/>
            </register>
            <register name="DATABUFPTR"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Data buffer pointer">
               <bitfield name="INDATAPTR" caption="Input Data Pointer" mask="0x3"/>
            </register>
            <register name="DBGCTRL"
                      offset="0x9"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Debug control">
               <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
            </register>
            <register name="KEYWORD"
                      offset="0xC"
                      rw="W"
                      size="4"
                      count="8"
                      initval="0x00000000"
                      caption="Keyword n">
               <bitfield name="KEYWORD" caption="Key Word Value" mask="0xFFFFFFFF"/>
            </register>
            <register name="INDATA"
                      offset="0x38"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Indata">
               <bitfield name="INDATA" caption="Data Value" mask="0xFFFFFFFF"/>
            </register>
