ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="INTVECTV"
                      offset="0x3C"
                      rw="W"
                      size="4"
                      count="4"
                      initval="0x00000000"
                      caption="Initialisation Vector n">
               <bitfield name="INTVECTV"
                         caption="Initialization Vector Value"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="HASHKEY"
                      offset="0x5C"
                      rw="RW"
                      size="4"
                      count="4"
                      initval="0x00000000"
                      caption="Hash key n">
               <bitfield name="HASHKEY" caption="Hash Key Value" mask="0xFFFFFFFF"/>
            </register>
            <register name="GHASH"
                      offset="0x6C"
                      rw="RW"
                      size="4"
                      count="4"
                      initval="0x00000000"
                      caption="Galois Hash n">
               <bitfield name="GHASH" caption="Galois Hash Value" mask="0xFFFFFFFF"/>
            </register>
            <register name="CIPLEN"
                      offset="0x80"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Cipher Length">
               <bitfield name="CIPLEN" caption="Cipher Length" mask="0xFFFFFFFF"/>
            </register>
            <register name="RANDSEED"
                      offset="0x84"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Random Seed">
               <bitfield name="RANDSEED" caption="Random Seed" mask="0xFFFFFFFF"/>
            </register>
         </register-group>
         <value-group name="AES_CTRLA__AESMODE">
            <value name="ECB" caption="Electronic code book mode" value="0x0"/>
            <value name="CBC" caption="Cipher block chaining mode" value="0x1"/>
            <value name="OFB" caption="Output feedback mode" value="0x2"/>
            <value name="CFB" caption="Cipher feedback mode" value="0x3"/>
            <value name="COUNTER" caption="Counter mode" value="0x4"/>
            <value name="CCM" caption="CCM mode" value="0x5"/>
            <value name="GCM" caption="Galois counter mode" value="0x6"/>
         </value-group>
         <value-group name="AES_CTRLA__CFBS">
            <value name="128BIT"
                   caption="128-bit Input data block for Encryption/Decryption in Cipher Feedback mode"
                   value="0x0"/>
            <value name="64BIT"
                   caption="64-bit Input data block for Encryption/Decryption in Cipher Feedback mode"
                   value="0x1"/>
            <value name="32BIT"
                   caption="32-bit Input data block for Encryption/Decryption in Cipher Feedback mode"
                   value="0x2"/>
            <value name="16BIT"
                   caption="16-bit Input data block for Encryption/Decryption in Cipher Feedback mode"
                   value="0x3"/>
            <value name="8BIT"
                   caption="8-bit Input data block for Encryption/Decryption in Cipher Feedback mode"
                   value="0x4"/>
         </value-group>
         <value-group name="AES_CTRLA__CIPHER">
            <value name="DEC" caption="Decryption" value="0x0"/>
            <value name="ENC" caption="Encryption" value="0x1"/>
         </value-group>
         <value-group name="AES_CTRLA__KEYGEN">
            <value name="NONE" caption="No effect" value="0x0"/>
            <value name="LAST"
                   caption="Start Computation of the last NK words of the expanded key"
                   value="0x1"/>
         </value-group>
         <value-group name="AES_CTRLA__KEYSIZE">
            <value name="128BIT"
                   caption="128-bit Key for Encryption / Decryption"
                   value="0x0"/>
            <value name="192BIT"
                   caption="192-bit Key for Encryption / Decryption"
                   value="0x1"/>
            <value name="256BIT"
                   caption="256-bit Key for Encryption / Decryption"
                   value="0x2"/>
         </value-group>
         <value-group name="AES_CTRLA__LOD">
            <value name="NONE" caption="No effect" value="0x0"/>
            <value name="LAST"
                   caption="Start encryption in Last Output Data mode"
                   value="0x1"/>
         </value-group>
         <value-group name="AES_CTRLA__STARTMODE">
            <value name="MANUAL"
                   caption="Start Encryption / Decryption in Manual mode"
                   value="0x0"/>
            <value name="AUTO"
                   caption="Start Encryption / Decryption in Auto mode"
                   value="0x1"/>
         </value-group>
         <value-group name="AES_CTRLA__XORKEY">
            <value name="NONE" caption="No effect" value="0x0"/>
            <value name="XOR"
                   caption="The user keyword gets XORed with the previous keyword register content."
                   value="0x1"/>
         </value-group>
      </module>
      <module name="CCL"
              id="U2225"
              version="1.1.0"
              caption="Configurable Custom Logic">
         <register-group name="CCL" caption="Configurable Custom Logic">
            <register name="CTRL"
                      offset="0x0"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Control">
               <bitfield name="SWRST"
                         caption="Software Reset"
                         mask="0x1"
                         values="CCL_CTRL__SWRST"/>
               <bitfield name="ENABLE"
                         caption="Enable"
                         mask="0x2"
                         values="CCL_CTRL__ENABLE"/>
               <bitfield name="RUNSTDBY"
                         caption="Run in Standby"
                         mask="0x40"
                         values="CCL_CTRL__RUNSTDBY"/>
            </register>
            <register name="SEQCTRL"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      count="2"
                      initval="0x00"
                      caption="SEQ Control x">
               <bitfield name="SEQSEL"
                         caption="Sequential Selection"
                         mask="0xF"
                         values="CCL_SEQCTRL__SEQSEL"/>
            </register>
            <register name="LUTCTRL"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      count="4"
                      initval="0x00000000"
                      caption="LUT Control x">
               <bitfield name="ENABLE"
                         caption="LUT Enable"
                         mask="0x2"
                         values="CCL_LUTCTRL__ENABLE"/>
               <bitfield name="FILTSEL"
                         caption="Filter Selection"
                         mask="0x30"
                         values="CCL_LUTCTRL__FILTSEL"/>
               <bitfield name="EDGESEL"
                         caption="Edge Selection"
                         mask="0x80"
                         values="CCL_LUTCTRL__EDGESEL"/>
               <bitfield name="INSEL0"
                         caption="Input Selection 0"
                         mask="0xF00"
                         values="CCL_LUTCTRL__INSEL"/>
               <bitfield name="INSEL1"
                         caption="Input Selection 1"
                         mask="0xF000"
                         values="CCL_LUTCTRL__INSEL"/>
               <bitfield name="INSEL2"
                         caption="Input Selection 2"
                         mask="0xF0000"
                         values="CCL_LUTCTRL__INSEL"/>
               <bitfield name="INVEI"
                         caption="Inverted Event Input Enable"
                         mask="0x100000"
                         values="CCL_LUTCTRL__INVEI"/>
               <bitfield name="LUTEI"
                         caption="LUT Event Input Enable"
                         mask="0x200000"
                         values="CCL_LUTCTRL__LUTEI"/>
               <bitfield name="LUTEO"
                         caption="LUT Event Output Enable"
                         mask="0x400000"
                         values="CCL_LUTCTRL__LUTEO"/>
               <bitfield name="TRUTH" caption="Truth Value" mask="0xFF000000"/>
            </register>
         </register-group>
         <value-group name="CCL_CTRL__SWRST">
            <value name="DISABLE" caption="The peripheral is not reset" value="0"/>
            <value name="ENABLE" caption="The peripheral is reset" value="1"/>
         </value-group>
         <value-group name="CCL_CTRL__ENABLE">
            <value name="DISABLE" caption="The peripheral is disabled" value="0"/>
            <value name="ENABLE" caption="The peripheral is enabled" value="1"/>
         </value-group>
         <value-group name="CCL_CTRL__RUNSTDBY">
            <value name="DISABLE"
                   caption="Generic clock is not required in standby sleep mode"
                   value="0"/>
            <value name="ENABLE"
                   caption="Generic clock is  required in standby sleep mode"
                   value="1"/>
         </value-group>
         <value-group name="CCL_SEQCTRL__SEQSEL">
            <value name="DISABLE" caption="Sequential logic is disabled" value="0"/>
            <value name="DFF" caption="D flip flop" value="1"/>
            <value name="JK" caption="JK flip flop" value="2"/>
            <value name="LATCH" caption="D latch" value="3"/>
            <value name="RS" caption="RS latch" value="4"/>
         </value-group>
         <value-group name="CCL_LUTCTRL__ENABLE">
            <value name="DISABLE" caption="LUT block is disabled" value="0"/>
            <value name="ENABLE" caption="LUT block is enabled" value="1"/>
         </value-group>
