ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="CCL_LUTCTRL__FILTSEL">
            <value name="DISABLE" caption="Filter disabled" value="0"/>
            <value name="SYNCH" caption="Synchronizer enabled" value="1"/>
            <value name="FILTER" caption="Filter enabled" value="2"/>
         </value-group>
         <value-group name="CCL_LUTCTRL__EDGESEL">
            <value name="DISABLE" caption="Edge detector is disabled" value="0"/>
            <value name="ENABLE" caption="Edge detector is enabled" value="1"/>
         </value-group>
         <value-group name="CCL_LUTCTRL__INSEL">
            <value name="MASK" caption="Masked input" value="0"/>
            <value name="FEEDBACK" caption="Feedback input source" value="1"/>
            <value name="LINK" caption="Linked LUT input source" value="2"/>
            <value name="EVENT" caption="Event input source" value="3"/>
            <value name="IO" caption="I/O pin input source" value="4"/>
            <value name="AC" caption="AC input source" value="5"/>
            <value name="TC" caption="TC input source" value="6"/>
            <value name="ALTTC" caption="Alternate TC input source" value="7"/>
            <value name="TCC" caption="TCC input source" value="8"/>
            <value name="SERCOM" caption="SERCOM input source" value="9"/>
         </value-group>
         <value-group name="CCL_LUTCTRL__INVEI">
            <value name="DISABLE" caption="Incoming event is not inverted" value="0"/>
            <value name="ENABLE" caption="Incoming event is inverted" value="1"/>
         </value-group>
         <value-group name="CCL_LUTCTRL__LUTEI">
            <value name="DISABLE" caption="LUT incoming event is disabled" value="0"/>
            <value name="ENABLE" caption="LUT incoming event is enabled" value="1"/>
         </value-group>
         <value-group name="CCL_LUTCTRL__LUTEO">
            <value name="DISABLE" caption="LUT event output is disabled" value="0"/>
            <value name="ENABLE" caption="LUT event output is enabled" value="1"/>
         </value-group>
      </module>
      <module name="CMCC"
              id="U2015"
              version="6.0.0"
              caption="Cortex M Cache Controller">
         <register-group name="CMCC" caption="Cortex M Cache Controller">
            <register name="TYPE"
                      offset="0x0"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x000012D2"
                      caption="Cache Type Register">
               <bitfield name="GCLK" caption="dynamic Clock Gating supported" mask="0x2"/>
               <bitfield name="RRP" caption="Round Robin Policy supported" mask="0x10"/>
               <bitfield name="WAYNUM"
                         caption="Number of Way"
                         mask="0x60"
                         values="CMCC_TYPE__WAYNUM"/>
               <bitfield name="LCKDOWN" caption="Lock Down supported" mask="0x80"/>
               <bitfield name="CSIZE"
                         caption="Cache Size"
                         mask="0x700"
                         values="CMCC_TYPE__CSIZE"/>
               <bitfield name="CLSIZE"
                         caption="Cache Line Size"
                         mask="0x3800"
                         values="CMCC_TYPE__CLSIZE"/>
            </register>
            <register name="CFG"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000020"
                      caption="Cache Configuration Register">
               <bitfield name="ICDIS" caption="Instruction Cache Disable" mask="0x2"/>
               <bitfield name="DCDIS" caption="Data Cache Disable" mask="0x4"/>
               <bitfield name="CSIZESW"
                         caption="Cache size configured by software"
                         mask="0x70"
                         values="CMCC_CFG__CSIZESW"/>
            </register>
            <register name="CTRL"
                      offset="0x8"
                      rw="W"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Cache Control Register">
               <bitfield name="CEN" caption="Cache Controller Enable" mask="0x1"/>
            </register>
            <register name="SR"
                      offset="0xC"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Cache Status Register">
               <bitfield name="CSTS" caption="Cache Controller Status" mask="0x1"/>
            </register>
            <register name="LCKWAY"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Cache Lock per Way Register">
               <bitfield name="LCKWAY" caption="Lockdown way Register" mask="0xF"/>
            </register>
            <register name="MAINT0"
                      offset="0x20"
                      rw="W"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Cache Maintenance Register 0">
               <bitfield name="INVALL" caption="Cache Controller invalidate All" mask="0x1"/>
            </register>
            <register name="MAINT1"
                      offset="0x24"
                      rw="W"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Cache Maintenance Register 1">
               <bitfield name="INDEX" caption="Invalidate Index" mask="0xFF0"/>
               <bitfield name="WAY"
                         caption="Invalidate Way"
                         mask="0xF0000000"
                         values="CMCC_MAINT1__WAY"/>
            </register>
