ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="MCFG"
                      offset="0x28"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Cache Monitor Configuration Register">
               <bitfield name="MODE"
                         caption="Cache Controller Monitor Counter Mode"
                         mask="0x3"
                         values="CMCC_MCFG__MODE"/>
            </register>
            <register name="MEN"
                      offset="0x2C"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Cache Monitor Enable Register">
               <bitfield name="MENABLE" caption="Cache Controller Monitor Enable" mask="0x1"/>
            </register>
            <register name="MCTRL"
                      offset="0x30"
                      rw="W"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Cache Monitor Control Register">
               <bitfield name="SWRST" caption="Cache Controller Software Reset" mask="0x1"/>
            </register>
            <register name="MSR"
                      offset="0x34"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Cache Monitor Status Register">
               <bitfield name="EVENT_CNT" caption="Monitor Event Counter" mask="0xFFFFFFFF"/>
            </register>
         </register-group>
         <value-group name="CMCC_TYPE__CLSIZE">
            <value name="CLSIZE_16B" caption="Cache Line Size is 16 bytes" value="2"/>
         </value-group>
         <value-group name="CMCC_TYPE__CSIZE">
            <value name="CSIZE_1KB" caption="Cache Size is 1 KB" value="0"/>
            <value name="CSIZE_2KB" caption="Cache Size is 2 KB" value="1"/>
            <value name="CSIZE_4KB" caption="Cache Size is 4 KB" value="2"/>
         </value-group>
         <value-group name="CMCC_TYPE__WAYNUM">
            <value name="ARCH4WAY" caption="4-WAY set associative" value="2"/>
         </value-group>
         <value-group name="CMCC_CFG__CSIZESW">
            <value name="CONF_CSIZE_1KB"
                   caption="The Cache Size is configured to 1KB"
                   value="0"/>
            <value name="CONF_CSIZE_2KB"
                   caption="The Cache Size is configured to 2KB"
                   value="1"/>
            <value name="CONF_CSIZE_4KB"
                   caption="The Cache Size is configured to 4KB"
                   value="2"/>
         </value-group>
         <value-group name="CMCC_MAINT1__WAY">
            <value name="WAY0"
                   caption="Way 0 is selection for index invalidation"
                   value="0"/>
            <value name="WAY1"
                   caption="Way 1 is selection for index invalidation"
                   value="1"/>
            <value name="WAY2"
                   caption="Way 2 is selection for index invalidation"
                   value="2"/>
            <value name="WAY3"
                   caption="Way 3 is selection for index invalidation"
                   value="3"/>
         </value-group>
         <value-group name="CMCC_MCFG__MODE">
            <value name="CYCLE_COUNT" caption="Cycle counter" value="0"/>
            <value name="IHIT_COUNT" caption="Instruction hit counter" value="1"/>
            <value name="DHIT_COUNT" caption="Data hit counter" value="2"/>
         </value-group>
      </module>
      <module name="DAC"
              id="U2502"
              version="1.0.0"
              caption="Digital-to-Analog Converter">
         <register-group name="DAC" caption="Digital-to-Analog Converter">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable DAC Controller" mask="0x2"/>
            </register>
            <register name="CTRLB"
                      offset="0x1"
                      rw="RW"
                      size="1"
                      initval="0x02"
                      caption="Control B">
               <bitfield name="DIFF" caption="Differential mode enable" mask="0x1"/>
               <bitfield name="REFSEL"
                         caption="Reference Selection for DAC0/1"
                         mask="0x6"
                         values="DAC_CTRLB__REFSEL"/>
            </register>
            <register name="EVCTRL"
                      offset="0x2"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Event Control">
               <bitfield name="STARTEI0"
                         caption="Start Conversion Event Input DAC 0"
                         mask="0x1"/>
               <bitfield name="STARTEI1"
                         caption="Start Conversion Event Input DAC 1"
                         mask="0x2"/>
               <bitfield name="EMPTYEO0"
                         caption="Data Buffer Empty Event Output DAC 0"
                         mask="0x4"/>
               <bitfield name="EMPTYEO1"
                         caption="Data Buffer Empty Event Output DAC 1"
                         mask="0x8"/>
               <bitfield name="INVEI0"
                         caption="Enable Invertion of DAC 0 input event"
                         mask="0x10"/>
               <bitfield name="INVEI1"
                         caption="Enable Invertion of DAC 1 input event"
                         mask="0x20"/>
               <bitfield name="RESRDYEO0" caption="Result Ready Event Output 0" mask="0x40"/>
               <bitfield name="RESRDYEO1" caption="Result Ready Event Output 1" mask="0x80"/>
            </register>
