ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="INTENCLR"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="UNDERRUN0" caption="Underrun 0 Interrupt Enable" mask="0x1"/>
               <bitfield name="UNDERRUN1" caption="Underrun 1 Interrupt Enable" mask="0x2"/>
               <bitfield name="EMPTY0"
                         caption="Data Buffer 0 Empty Interrupt Enable"
                         mask="0x4"/>
               <bitfield name="EMPTY1"
                         caption="Data Buffer 1 Empty Interrupt Enable"
                         mask="0x8"/>
               <bitfield name="RESRDY0"
                         caption="Result 0 Ready Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="RESRDY1"
                         caption="Result 1 Ready Interrupt Enable"
                         mask="0x20"/>
               <bitfield name="OVERRUN0" caption="Overrun 0 Interrupt Enable" mask="0x40"/>
               <bitfield name="OVERRUN1" caption="Overrun 1 Interrupt Enable" mask="0x80"/>
            </register>
            <register name="INTENSET"
                      offset="0x5"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="UNDERRUN0" caption="Underrun 0 Interrupt Enable" mask="0x1"/>
               <bitfield name="UNDERRUN1" caption="Underrun 1 Interrupt Enable" mask="0x2"/>
               <bitfield name="EMPTY0"
                         caption="Data Buffer 0 Empty Interrupt Enable"
                         mask="0x4"/>
               <bitfield name="EMPTY1"
                         caption="Data Buffer 1 Empty Interrupt Enable"
                         mask="0x8"/>
               <bitfield name="RESRDY0"
                         caption="Result 0 Ready Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="RESRDY1"
                         caption="Result 1 Ready Interrupt Enable"
                         mask="0x20"/>
               <bitfield name="OVERRUN0" caption="Overrun 0 Interrupt Enable" mask="0x40"/>
               <bitfield name="OVERRUN1" caption="Overrun 1 Interrupt Enable" mask="0x80"/>
            </register>
            <register name="INTFLAG"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="UNDERRUN0" caption="Result 0 Underrun" mask="0x1"/>
               <bitfield name="UNDERRUN1" caption="Result 1 Underrun" mask="0x2"/>
               <bitfield name="EMPTY0" caption="Data Buffer 0 Empty" mask="0x4"/>
               <bitfield name="EMPTY1" caption="Data Buffer 1 Empty" mask="0x8"/>
               <bitfield name="RESRDY0" caption="Result 0 Ready" mask="0x10"/>
               <bitfield name="RESRDY1" caption="Result 1 Ready" mask="0x20"/>
               <bitfield name="OVERRUN0" caption="Result 0 Overrun" mask="0x40"/>
               <bitfield name="OVERRUN1" caption="Result 1 Overrun" mask="0x80"/>
            </register>
            <register name="STATUS"
                      offset="0x7"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Status">
               <bitfield name="READY0" caption="DAC 0 Startup Ready" mask="0x1"/>
               <bitfield name="READY1" caption="DAC 1 Startup Ready" mask="0x2"/>
               <bitfield name="EOC0" caption="DAC 0 End of Conversion" mask="0x4"/>
               <bitfield name="EOC1" caption="DAC 1 End of Conversion" mask="0x8"/>
            </register>
            <register name="SYNCBUSY"
                      offset="0x8"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Synchronization Busy">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="DAC Enable Status" mask="0x2"/>
               <bitfield name="DATA0" caption="Data DAC 0" mask="0x4"/>
               <bitfield name="DATA1" caption="Data DAC 1" mask="0x8"/>
               <bitfield name="DATABUF0" caption="Data Buffer DAC 0" mask="0x10"/>
               <bitfield name="DATABUF1" caption="Data Buffer DAC 1" mask="0x20"/>
            </register>
            <register name="DACCTRL"
                      offset="0xC"
                      rw="RW"
                      size="2"
                      count="2"
                      initval="0x0000"
                      caption="DAC n Control">
               <bitfield name="LEFTADJ" caption="Left Adjusted Data" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable DAC0" mask="0x2"/>
               <bitfield name="CCTRL"
                         caption="Current Control"
                         mask="0xC"
                         values="DAC_DACCTRL__CCTRL"/>
               <bitfield name="FEXT" caption="Standalone Filter" mask="0x20"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="DITHER" caption="Dithering Mode" mask="0x80"/>
               <bitfield name="REFRESH"
                         caption="Refresh period"
                         mask="0xF00"
                         values="DAC_DACCTRL__REFRESH"/>
               <bitfield name="OSR"
                         caption="Sampling Rate"
                         mask="0xE000"
                         values="DAC_DACCTRL__OSR"/>
            </register>
            <register name="DATA"
                      offset="0x10"
                      rw="W"
                      access="WSYNC"
                      size="2"
                      count="2"
                      initval="0x0000"
                      caption="DAC n Data">
               <bitfield name="DATA" caption="DAC0 Data" mask="0xFFFF"/>
            </register>
            <register name="DATABUF"
                      offset="0x14"
                      rw="W"
                      access="WSYNC"
                      size="2"
                      count="2"
                      initval="0x0000"
                      caption="DAC n Data Buffer">
               <bitfield name="DATABUF" caption="DAC0 Data Buffer" mask="0xFFFF"/>
            </register>
            <register name="DBGCTRL"
                      offset="0x18"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Debug Control">
               <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
            </register>
            <register name="RESULT"
                      offset="0x1C"
                      rw="R"
                      size="2"
                      count="2"
                      initval="0x0000"
                      caption="Filter Result">
               <bitfield name="RESULT" caption="Filter Result" mask="0xFFFF"/>
            </register>
         </register-group>
         <value-group name="DAC_CTRLB__REFSEL">
            <value name="VREFPU" caption="External reference unbuffered" value="0"/>
            <value name="VDDANA" caption="Analog supply" value="1"/>
            <value name="VREFPB" caption="External reference buffered" value="2"/>
            <value name="INTREF" caption="Internal bandgap reference" value="3"/>
         </value-group>
         <value-group name="DAC_DACCTRL__CCTRL">
            <value name="CC100K" caption="100kSPS" value="0x0"/>
            <value name="CC1M" caption="500kSPS" value="0x1"/>
            <value name="CC12M" caption="1MSPS" value="0x2"/>
         </value-group>
