ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="ACTIVE"
                      offset="0x30"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Active Channel and Levels">
               <bitfield name="LVLEX0"
                         caption="Level 0 Channel Trigger Request Executing"
                         mask="0x1"/>
               <bitfield name="LVLEX1"
                         caption="Level 1 Channel Trigger Request Executing"
                         mask="0x2"/>
               <bitfield name="LVLEX2"
                         caption="Level 2 Channel Trigger Request Executing"
                         mask="0x4"/>
               <bitfield name="LVLEX3"
                         caption="Level 3 Channel Trigger Request Executing"
                         mask="0x8"/>
               <bitfield name="ID" caption="Active Channel ID" mask="0x1F00"/>
               <bitfield name="ABUSY" caption="Active Channel Busy" mask="0x8000"/>
               <bitfield name="BTCNT"
                         caption="Active Channel Block Transfer Count"
                         mask="0xFFFF0000"/>
            </register>
            <register name="BASEADDR"
                      offset="0x34"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Descriptor Memory Section Base Address">
               <bitfield name="BASEADDR"
                         caption="Descriptor Memory Base Address"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="WRBADDR"
                      offset="0x38"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Write-Back Memory Section Base Address">
               <bitfield name="WRBADDR"
                         caption="Write-Back Memory Base Address"
                         mask="0xFFFFFFFF"/>
            </register>
            <register-group name="CHANNEL"
                            name-in-module="CHANNEL"
                            offset="0x40"
                            size="0x10"
                            count="32"/>
         </register-group>
         <register-group name="DMAC_DESCRIPTOR"
                         caption="Direct Memory Access Controller"
                         section="hsram"
                         aligned="8">
            <register name="BTCTRL"
                      offset="0x0"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Block Transfer Control">
               <bitfield name="VALID" caption="Descriptor Valid" mask="0x1"/>
               <bitfield name="EVOSEL"
                         caption="Block Event Output Selection"
                         mask="0x6"
                         values="DMAC_BTCTRL__EVOSEL"/>
               <bitfield name="BLOCKACT"
                         caption="Block Action"
                         mask="0x18"
                         values="DMAC_BTCTRL__BLOCKACT"/>
               <bitfield name="BEATSIZE"
                         caption="Beat Size"
                         mask="0x300"
                         values="DMAC_BTCTRL__BEATSIZE"/>
               <bitfield name="SRCINC"
                         caption="Source Address Increment Enable"
                         mask="0x400"/>
               <bitfield name="DSTINC"
                         caption="Destination Address Increment Enable"
                         mask="0x800"/>
               <bitfield name="STEPSEL"
                         caption="Step Selection"
                         mask="0x1000"
                         values="DMAC_BTCTRL__STEPSEL"/>
               <bitfield name="STEPSIZE"
                         caption="Address Increment Step Size"
                         mask="0xE000"
                         values="DMAC_BTCTRL__STEPSIZE"/>
            </register>
            <register name="BTCNT"
                      offset="0x2"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Block Transfer Count">
               <bitfield name="BTCNT" caption="Block Transfer Count" mask="0xFFFF"/>
            </register>
            <register name="SRCADDR"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Block Transfer Source Address">
               <bitfield name="SRCADDR" caption="Transfer Source Address" mask="0xFFFFFFFF"/>
            </register>
            <register name="DSTADDR"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      caption="Block Transfer Destination Address">
               <mode name="CRC" caption="Memory CRC Generation or CRC Monitor"/>
               <mode name="DEFAULT" caption="Source to Destination Transfer Mode"/>
               <bitfield modes="CRC"
                         name="CHKINIT"
                         caption="CRC Checksum Initial Value"
                         mask="0xFFFFFFFF"/>
               <bitfield modes="DEFAULT"
                         name="DSTADDR"
                         caption="Transfer Destination Address"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="DESCADDR"
                      offset="0xC"
                      rw="RW"
                      size="4"
                      caption="Next Descriptor Address">
               <bitfield name="DESCADDR" caption="Next Descriptor Address" mask="0xFFFFFFFF"/>
            </register>
         </register-group>
         <value-group name="DMAC_BTCTRL__BEATSIZE">
            <value name="BYTE" caption="8-bit bus transfer" value="0x0"/>
            <value name="HWORD" caption="16-bit bus transfer" value="0x1"/>
            <value name="WORD" caption="32-bit bus transfer" value="0x2"/>
         </value-group>
         <value-group name="DMAC_BTCTRL__BLOCKACT">
            <value name="NOACT"
                   caption="Channel will be disabled if it is the last block transfer in the transaction"
                   value="0x0"/>
            <value name="INT"
                   caption="Channel will be disabled if it is the last block transfer in the transaction and block interrupt"
                   value="0x1"/>
            <value name="SUSPEND"
                   caption="Channel suspend operation is completed"
                   value="0x2"/>
            <value name="BOTH"
                   caption="Both channel suspend operation and block interrupt"
                   value="0x3"/>
         </value-group>
