ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="DMAC_BTCTRL__EVOSEL">
            <value name="DISABLE" caption="Event generation disabled" value="0x0"/>
            <value name="BLOCK" caption="Block event strobe" value="0x1"/>
            <value name="BURST" caption="Burst event strobe" value="0x3"/>
         </value-group>
         <value-group name="DMAC_BTCTRL__STEPSEL">
            <value name="DST"
                   caption="Step size settings apply to the destination address"
                   value="0x0"/>
            <value name="SRC"
                   caption="Step size settings apply to the source address"
                   value="0x1"/>
         </value-group>
         <value-group name="DMAC_BTCTRL__STEPSIZE">
            <value name="X1"
                   caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 1"
                   value="0x0"/>
            <value name="X2"
                   caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 2"
                   value="0x1"/>
            <value name="X4"
                   caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 4"
                   value="0x2"/>
            <value name="X8"
                   caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 8"
                   value="0x3"/>
            <value name="X16"
                   caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 16"
                   value="0x4"/>
            <value name="X32"
                   caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 32"
                   value="0x5"/>
            <value name="X64"
                   caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 64"
                   value="0x6"/>
            <value name="X128"
                   caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 128"
                   value="0x7"/>
         </value-group>
         <value-group name="DMAC_CRCCTRL__CRCBEATSIZE">
            <value name="BYTE" caption="8-bit bus transfer" value="0x0"/>
            <value name="HWORD" caption="16-bit bus transfer" value="0x1"/>
            <value name="WORD" caption="32-bit bus transfer" value="0x2"/>
         </value-group>
         <value-group name="DMAC_CRCCTRL__CRCMODE">
            <value name="DEFAULT" caption="Default operating mode" value="0"/>
            <value name="CRCMON" caption="Memory CRC monitor operating mode" value="2"/>
            <value name="CRCGEN"
                   caption="Memory CRC generation operating mode"
                   value="3"/>
         </value-group>
         <value-group name="DMAC_CRCCTRL__CRCPOLY">
            <value name="CRC16" caption="CRC-16 (CRC-CCITT)" value="0x0"/>
            <value name="CRC32" caption="CRC32 (IEEE 802.3)" value="0x1"/>
         </value-group>
         <value-group name="DMAC_CRCCTRL__CRCSRC">
            <value name="DISABLE" caption="CRC Disabled" value="0x00"/>
            <value name="IO" caption="I/O interface" value="0x01"/>
            <value name="CHN0" caption="DMA Channel 0" value="0x20"/>
            <value name="CHN1" caption="DMA Channel 1" value="0x21"/>
            <value name="CHN2" caption="DMA Channel 2" value="0x22"/>
            <value name="CHN3" caption="DMA Channel 3" value="0x23"/>
            <value name="CHN4" caption="DMA Channel 4" value="0x24"/>
            <value name="CHN5" caption="DMA Channel 5" value="0x25"/>
            <value name="CHN6" caption="DMA Channel 6" value="0x26"/>
            <value name="CHN7" caption="DMA Channel 7" value="0x27"/>
            <value name="CHN8" caption="DMA Channel 8" value="0x28"/>
            <value name="CHN9" caption="DMA Channel 9" value="0x29"/>
            <value name="CHN10" caption="DMA Channel 10" value="0x2A"/>
            <value name="CHN11" caption="DMA Channel 11" value="0x2B"/>
            <value name="CHN12" caption="DMA Channel 12" value="0x2C"/>
            <value name="CHN13" caption="DMA Channel 13" value="0x2D"/>
            <value name="CHN14" caption="DMA Channel 14" value="0x2E"/>
            <value name="CHN15" caption="DMA Channel 15" value="0x2F"/>
            <value name="CHN16" caption="DMA Channel 16" value="0x30"/>
            <value name="CHN17" caption="DMA Channel 17" value="0x31"/>
            <value name="CHN18" caption="DMA Channel 18" value="0x32"/>
            <value name="CHN19" caption="DMA Channel 19" value="0x33"/>
            <value name="CHN20" caption="DMA Channel 20" value="0x34"/>
            <value name="CHN21" caption="DMA Channel 21" value="0x35"/>
            <value name="CHN22" caption="DMA Channel 22" value="0x36"/>
            <value name="CHN23" caption="DMA Channel 23" value="0x37"/>
            <value name="CHN24" caption="DMA Channel 24" value="0x38"/>
            <value name="CHN25" caption="DMA Channel 25" value="0x39"/>
            <value name="CHN26" caption="DMA Channel 26" value="0x3A"/>
            <value name="CHN27" caption="DMA Channel 27" value="0x3B"/>
            <value name="CHN28" caption="DMA Channel 28" value="0x3C"/>
            <value name="CHN29" caption="DMA Channel 29" value="0x3D"/>
            <value name="CHN30" caption="DMA Channel 30" value="0x3E"/>
            <value name="CHN31" caption="DMA Channel 31" value="0x3F"/>
         </value-group>
         <value-group name="DMAC_PRICTRL0__QOS0">
            <value name="REGULAR" caption="Regular delivery" value="0"/>
            <value name="SHORTAGE" caption="Bandwidth shortage" value="1"/>
            <value name="SENSITIVE" caption="Latency sensitive" value="2"/>
            <value name="CRITICAL" caption="Latency critical" value="3"/>
         </value-group>
         <value-group name="DMAC_PRICTRL0__QOS1">
            <value name="REGULAR" caption="Regular delivery" value="0"/>
            <value name="SHORTAGE" caption="Bandwidth shortage" value="1"/>
            <value name="SENSITIVE" caption="Latency sensitive" value="2"/>
            <value name="CRITICAL" caption="Latency critical" value="3"/>
         </value-group>
         <value-group name="DMAC_PRICTRL0__QOS2">
            <value name="REGULAR" caption="Regular delivery" value="0"/>
            <value name="SHORTAGE" caption="Bandwidth shortage" value="1"/>
            <value name="SENSITIVE" caption="Latency sensitive" value="2"/>
            <value name="CRITICAL" caption="Latency critical" value="3"/>
         </value-group>
         <value-group name="DMAC_PRICTRL0__QOS3">
            <value name="REGULAR" caption="Regular delivery" value="0"/>
            <value name="SHORTAGE" caption="Bandwidth shortage" value="1"/>
            <value name="SENSITIVE" caption="Latency sensitive" value="2"/>
            <value name="CRITICAL" caption="Latency critical" value="3"/>
         </value-group>
         <value-group name="DMAC_CHCTRLA__BURSTLEN">
            <value name="SINGLE" caption="Single-beat burst length" value="0"/>
            <value name="2BEAT" caption="2-beats burst length" value="1"/>
            <value name="3BEAT" caption="3-beats burst length" value="2"/>
            <value name="4BEAT" caption="4-beats burst length" value="3"/>
            <value name="5BEAT" caption="5-beats burst length" value="4"/>
            <value name="6BEAT" caption="6-beats burst length" value="5"/>
            <value name="7BEAT" caption="7-beats burst length" value="6"/>
            <value name="8BEAT" caption="8-beats burst length" value="7"/>
            <value name="9BEAT" caption="9-beats burst length" value="8"/>
            <value name="10BEAT" caption="10-beats burst length" value="9"/>
            <value name="11BEAT" caption="11-beats burst length" value="10"/>
            <value name="12BEAT" caption="12-beats burst length" value="11"/>
            <value name="13BEAT" caption="13-beats burst length" value="12"/>
            <value name="14BEAT" caption="14-beats burst length" value="13"/>
            <value name="15BEAT" caption="15-beats burst length" value="14"/>
            <value name="16BEAT" caption="16-beats burst length" value="15"/>
         </value-group>
