ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="CID2"
                      offset="0x1FF8"
                      rw="R"
                      size="4"
                      initval="0x00000005"
                      caption="Component Identification 2">
               <bitfield name="PREAMBLEB2" caption="Preamble Byte 2" mask="0xFF"/>
            </register>
            <register name="CID3"
                      offset="0x1FFC"
                      rw="R"
                      size="4"
                      initval="0x000000B1"
                      caption="Component Identification 3">
               <bitfield name="PREAMBLEB3" caption="Preamble Byte 3" mask="0xFF"/>
            </register>
         </register-group>
         <value-group name="DSU_DID__FAMILY">
            <value name="SAMD5X" caption="General purpose microcontroller" value="0"/>
            <value name="SAME5X" caption="PicoPower" value="3"/>
         </value-group>
         <value-group name="DSU_DID__PROCESSOR">
            <value name="CM4F" caption="Cortex-M4 with FPU" value="0x6"/>
         </value-group>
         <value-group name="DSU_DID__SERIES">
            <value name="SAME51" caption="SAM E51" value="0x1"/>
            <value name="SAME53" caption="SAM E53" value="0x3"/>
            <value name="SAME54" caption="SAM E54" value="0x4"/>
            <value name="SAMD51" caption="SAM D51" value="0x6"/>
         </value-group>
         <value-group name="DSU_CFG__DCCDMALEVEL">
            <value name="EMPTY" caption="Trigger rises when DCC is empty" value="0"/>
            <value name="FULL" caption="Trigger rises when DCC is full" value="1"/>
         </value-group>
      </module>
      <module name="EIC"
              id="U2254"
              version="3.0.0"
              caption="External Interrupt Controller">
         <register-group name="EIC" caption="External Interrupt Controller">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="CKSEL"
                         caption="Clock Selection"
                         mask="0x10"
                         values="EIC_CTRLA__CKSEL"/>
            </register>
            <register name="NMICTRL"
                      offset="0x1"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Non-Maskable Interrupt Control">
               <bitfield name="NMISENSE"
                         caption="Non-Maskable Interrupt Sense Configuration"
                         mask="0x7"
                         values="EIC_NMICTRL__NMISENSE"/>
               <bitfield name="NMIFILTEN"
                         caption="Non-Maskable Interrupt Filter Enable"
                         mask="0x8"/>
               <bitfield name="NMIASYNCH"
                         caption="Asynchronous Edge Detection Mode"
                         mask="0x10"
                         values="EIC_NMICTRL__NMIASYNCH"/>
            </register>
            <register name="NMIFLAG"
                      offset="0x2"
                      rw="RW"
                      size="2"
                      atomic-op="clear:NMIFLAG"
                      initval="0x0000"
                      caption="Non-Maskable Interrupt Flag Status and Clear">
               <bitfield name="NMI" caption="Non-Maskable Interrupt" mask="0x1"/>
            </register>
            <register name="SYNCBUSY"
                      offset="0x4"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Busy Status"
                         mask="0x1"/>
               <bitfield name="ENABLE"
                         caption="Enable Synchronization Busy Status"
                         mask="0x2"/>
            </register>
            <register name="EVCTRL"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Event Control">
               <bitfield name="EXTINTEO"
                         caption="External Interrupt Event Output Enable"
                         mask="0xFFFF"/>
            </register>
            <register name="INTENCLR"
                      offset="0xC"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTENCLR"
                      initval="0x00000000"
                      caption="Interrupt Enable Clear">
               <bitfield name="EXTINT" caption="External Interrupt Enable" mask="0xFFFF"/>
            </register>
            <register name="INTENSET"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      atomic-op="set:INTENSET"
                      initval="0x00000000"
                      caption="Interrupt Enable Set">
               <bitfield name="EXTINT" caption="External Interrupt Enable" mask="0xFFFF"/>
            </register>
            <register name="INTFLAG"
                      offset="0x14"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTFLAG"
                      initval="0x00000000"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="EXTINT" caption="External Interrupt" mask="0xFFFF"/>
            </register>
            <register name="ASYNCH"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="External Interrupt Asynchronous Mode">
               <bitfield name="ASYNCH"
                         caption="Asynchronous Edge Detection Mode"
                         mask="0xFFFF"
                         values="EIC_ASYNCH__ASYNCH"/>
            </register>
