ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="EIC_DPRESCALER__TICKON">
            <value name="CLK_GCLK_EIC" caption="Clocked by GCLK" value="0"/>
            <value name="CLK_LFREQ" caption="Clocked by Low Frequency Clock" value="1"/>
         </value-group>
         <value-group name="EIC_NMICTRL__NMISENSE">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising-edge detection" value="1"/>
            <value name="FALL" caption="Falling-edge detection" value="2"/>
            <value name="BOTH" caption="Both-edges detection" value="3"/>
            <value name="HIGH" caption="High-level detection" value="4"/>
            <value name="LOW" caption="Low-level detection" value="5"/>
         </value-group>
         <value-group name="EIC_NMICTRL__NMIASYNCH">
            <value name="SYNC"
                   caption="Edge detection is clock synchronously operated"
                   value="0"/>
            <value name="ASYNC"
                   caption="Edge detection is clock asynchronously operated"
                   value="1"/>
         </value-group>
         <value-group name="EIC_ASYNCH__ASYNCH">
            <value name="SYNC"
                   caption="Edge detection is clock synchronously operated"
                   value="0"/>
            <value name="ASYNC"
                   caption="Edge detection is clock asynchronously operated"
                   value="1"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE0">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE1">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE2">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE3">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE4">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE5">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE6">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
         <value-group name="EIC_CONFIG__SENSE7">
            <value name="NONE" caption="No detection" value="0"/>
            <value name="RISE" caption="Rising edge detection" value="1"/>
            <value name="FALL" caption="Falling edge detection" value="2"/>
            <value name="BOTH" caption="Both edges detection" value="3"/>
            <value name="HIGH" caption="High level detection" value="4"/>
            <value name="LOW" caption="Low level detection" value="5"/>
         </value-group>
      </module>
      <module name="EVSYS"
              id="U2504"
              version="1.0.0"
              caption="Event System Interface">
         <register-group name="CHANNEL" size="0x8">
            <register name="CHANNEL"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00008000"
                      caption="Channel n Control">
               <bitfield name="EVGEN" caption="Event Generator Selection" mask="0x7F"/>
               <bitfield name="PATH"
                         caption="Path Selection"
                         mask="0x300"
                         values="EVSYS_CHANNEL__PATH"/>
               <bitfield name="EDGSEL"
                         caption="Edge Detection Selection"
                         mask="0xC00"
                         values="EVSYS_CHANNEL__EDGSEL"/>
               <bitfield name="RUNSTDBY" caption="Run in standby" mask="0x4000"/>
               <bitfield name="ONDEMAND" caption="Generic Clock On Demand" mask="0x8000"/>
            </register>
            <register name="CHINTENCLR"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      atomic-op="clear:CHINTENCLR"
                      initval="0x00"
                      caption="Channel n Interrupt Enable Clear">
               <bitfield name="OVR" caption="Channel Overrun Interrupt Disable" mask="0x1"/>
               <bitfield name="EVD"
                         caption="Channel Event Detected Interrupt Disable"
                         mask="0x2"/>
            </register>
