ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="CHINTENSET"
                      offset="0x5"
                      rw="RW"
                      size="1"
                      atomic-op="set:CHINTENSET"
                      initval="0x00"
                      caption="Channel n Interrupt Enable Set">
               <bitfield name="OVR" caption="Channel Overrun Interrupt Enable" mask="0x1"/>
               <bitfield name="EVD"
                         caption="Channel Event Detected Interrupt Enable"
                         mask="0x2"/>
            </register>
            <register name="CHINTFLAG"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      atomic-op="clear:CHINTFLAG"
                      initval="0x00"
                      caption="Channel n Interrupt Flag Status and Clear">
               <bitfield name="OVR" caption="Channel Overrun" mask="0x1"/>
               <bitfield name="EVD" caption="Channel Event Detected" mask="0x2"/>
            </register>
            <register name="CHSTATUS"
                      offset="0x7"
                      rw="R"
                      size="1"
                      initval="0x01"
                      caption="Channel n Status">
               <bitfield name="RDYUSR" caption="Ready User" mask="0x1"/>
               <bitfield name="BUSYCH" caption="Busy Channel" mask="0x2"/>
            </register>
         </register-group>
         <register-group name="EVSYS" caption="Event System Interface">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Control">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
            </register>
            <register name="SWEVT"
                      offset="0x4"
                      rw="W"
                      size="4"
                      initval="0x00000000"
                      caption="Software Event">
               <bitfield name="CHANNEL0" caption="Channel 0 Software Selection" mask="0x1"/>
               <bitfield name="CHANNEL1" caption="Channel 1 Software Selection" mask="0x2"/>
               <bitfield name="CHANNEL2" caption="Channel 2 Software Selection" mask="0x4"/>
               <bitfield name="CHANNEL3" caption="Channel 3 Software Selection" mask="0x8"/>
               <bitfield name="CHANNEL4" caption="Channel 4 Software Selection" mask="0x10"/>
               <bitfield name="CHANNEL5" caption="Channel 5 Software Selection" mask="0x20"/>
               <bitfield name="CHANNEL6" caption="Channel 6 Software Selection" mask="0x40"/>
               <bitfield name="CHANNEL7" caption="Channel 7 Software Selection" mask="0x80"/>
               <bitfield name="CHANNEL8" caption="Channel 8 Software Selection" mask="0x100"/>
               <bitfield name="CHANNEL9" caption="Channel 9 Software Selection" mask="0x200"/>
               <bitfield name="CHANNEL10"
                         caption="Channel 10 Software Selection"
                         mask="0x400"/>
               <bitfield name="CHANNEL11"
                         caption="Channel 11 Software Selection"
                         mask="0x800"/>
               <bitfield name="CHANNEL12"
                         caption="Channel 12 Software Selection"
                         mask="0x1000"/>
               <bitfield name="CHANNEL13"
                         caption="Channel 13 Software Selection"
                         mask="0x2000"/>
               <bitfield name="CHANNEL14"
                         caption="Channel 14 Software Selection"
                         mask="0x4000"/>
               <bitfield name="CHANNEL15"
                         caption="Channel 15 Software Selection"
                         mask="0x8000"/>
               <bitfield name="CHANNEL16"
                         caption="Channel 16 Software Selection"
                         mask="0x10000"/>
               <bitfield name="CHANNEL17"
                         caption="Channel 17 Software Selection"
                         mask="0x20000"/>
               <bitfield name="CHANNEL18"
                         caption="Channel 18 Software Selection"
                         mask="0x40000"/>
               <bitfield name="CHANNEL19"
                         caption="Channel 19 Software Selection"
                         mask="0x80000"/>
               <bitfield name="CHANNEL20"
                         caption="Channel 20 Software Selection"
                         mask="0x100000"/>
               <bitfield name="CHANNEL21"
                         caption="Channel 21 Software Selection"
                         mask="0x200000"/>
               <bitfield name="CHANNEL22"
                         caption="Channel 22 Software Selection"
                         mask="0x400000"/>
               <bitfield name="CHANNEL23"
                         caption="Channel 23 Software Selection"
                         mask="0x800000"/>
               <bitfield name="CHANNEL24"
                         caption="Channel 24 Software Selection"
                         mask="0x1000000"/>
               <bitfield name="CHANNEL25"
                         caption="Channel 25 Software Selection"
                         mask="0x2000000"/>
               <bitfield name="CHANNEL26"
                         caption="Channel 26 Software Selection"
                         mask="0x4000000"/>
               <bitfield name="CHANNEL27"
                         caption="Channel 27 Software Selection"
                         mask="0x8000000"/>
               <bitfield name="CHANNEL28"
                         caption="Channel 28 Software Selection"
                         mask="0x10000000"/>
               <bitfield name="CHANNEL29"
                         caption="Channel 29 Software Selection"
                         mask="0x20000000"/>
               <bitfield name="CHANNEL30"
                         caption="Channel 30 Software Selection"
                         mask="0x40000000"/>
               <bitfield name="CHANNEL31"
                         caption="Channel 31 Software Selection"
                         mask="0x80000000"/>
            </register>
