ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="INTENCLR"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear Register">
               <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
            </register>
            <register name="INTENSET"
                      offset="0x9"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set Register">
               <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
            </register>
            <register name="INTFLAG"
                      offset="0xA"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Register">
               <bitfield name="DONE" caption="Measurement Done" mask="0x1"/>
            </register>
            <register name="STATUS"
                      offset="0xB"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Status Register">
               <bitfield name="BUSY" caption="FREQM Status" mask="0x1"/>
               <bitfield name="OVF" caption="Sticky Count Value Overflow" mask="0x2"/>
            </register>
            <register name="SYNCBUSY"
                      offset="0xC"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Synchronization Busy Register">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
            </register>
            <register name="VALUE"
                      offset="0x10"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Count Value Register">
               <bitfield name="VALUE" caption="Measurement Value" mask="0xFFFFFF"/>
            </register>
         </register-group>
      </module>
      <module name="GCLK"
              id="U2122"
              version="1.2.0"
              caption="Generic Clock Generator">
         <register-group name="GCLK" caption="Generic Clock Generator">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Control">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
            </register>
            <register name="SYNCBUSY"
                      offset="0x4"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchroniation Busy bit"
                         mask="0x1"/>
               <bitfield name="GENCTRL"
                         caption="Generic Clock Generator Control n Synchronization Busy bits"
                         mask="0x3FFC"
                         values="GCLK_SYNCBUSY__GENCTRL"/>
            </register>
            <register name="GENCTRL"
                      offset="0x20"
                      rw="RW"
                      size="4"
                      count="12"
                      initval="0x00000000"
                      caption="Generic Clock Generator Control">
               <bitfield name="SRC"
                         caption="Source Select"
                         mask="0xF"
                         values="GCLK_GENCTRL__SRC"/>
               <bitfield name="GENEN" caption="Generic Clock Generator Enable" mask="0x100"/>
               <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x200"/>
               <bitfield name="OOV" caption="Output Off Value" mask="0x400"/>
               <bitfield name="OE" caption="Output Enable" mask="0x800"/>
               <bitfield name="DIVSEL"
                         caption="Divide Selection"
                         mask="0x1000"
                         values="GCLK_GENCTRL__DIVSEL"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x2000"/>
               <bitfield name="DIV" caption="Division Factor" mask="0xFFFF0000"/>
            </register>
            <register name="PCHCTRL"
                      offset="0x80"
                      rw="RW"
                      size="4"
                      count="48"
                      initval="0x00000000"
                      caption="Peripheral Clock Control">
               <bitfield name="GEN"
                         caption="Generic Clock Generator"
                         mask="0xF"
                         values="GCLK_PCHCTRL__GEN"/>
               <bitfield name="CHEN" caption="Channel Enable" mask="0x40"/>
               <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
            </register>
         </register-group>
         <value-group name="GCLK_SYNCBUSY__GENCTRL">
            <value name="GCLK0" caption="Generic clock generator 0" value="0x0001"/>
            <value name="GCLK1" caption="Generic clock generator 1" value="0x0002"/>
            <value name="GCLK2" caption="Generic clock generator 2" value="0x0004"/>
            <value name="GCLK3" caption="Generic clock generator 3" value="0x0008"/>
            <value name="GCLK4" caption="Generic clock generator 4" value="0x0010"/>
            <value name="GCLK5" caption="Generic clock generator 5" value="0x0020"/>
            <value name="GCLK6" caption="Generic clock generator 6" value="0x0040"/>
            <value name="GCLK7" caption="Generic clock generator 7" value="0x0080"/>
            <value name="GCLK8" caption="Generic clock generator 8" value="0x0100"/>
            <value name="GCLK9" caption="Generic clock generator 9" value="0x0200"/>
            <value name="GCLK10" caption="Generic clock generator 10" value="0x0400"/>
            <value name="GCLK11" caption="Generic clock generator 11" value="0x0800"/>
         </value-group>
         <value-group name="GCLK_GENCTRL__SRC">
            <value name="XOSC0" caption="XOSC0 oscillator output" value="0"/>
            <value name="XOSC1" caption="XOSC1 oscillator output" value="1"/>
            <value name="GCLKIN" caption="Generator input pad" value="2"/>
            <value name="GCLKGEN1"
                   caption="Generic clock generator 1 output"
                   value="3"/>
            <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="4"/>
            <value name="XOSC32K" caption="XOSC32K oscillator output" value="5"/>
            <value name="DFLL" caption="DFLL output" value="6"/>
            <value name="DPLL0" caption="DPLL0 output" value="7"/>
            <value name="DPLL1" caption="DPLL1 output" value="8"/>
         </value-group>
         <value-group name="GCLK_GENCTRL__DIVSEL">
            <value name="DIV1"
                   caption="Divide input directly by divider factor"
                   value="0x0"/>
            <value name="DIV2"
                   caption="Divide input by 2^(divider factor+ 1)"
                   value="0x1"/>
         </value-group>
         <value-group name="GCLK_PCHCTRL__GEN">
            <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
            <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
            <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
            <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
            <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
            <value name="GCLK5" caption="Generic clock generator 5" value="0x5"/>
            <value name="GCLK6" caption="Generic clock generator 6" value="0x6"/>
            <value name="GCLK7" caption="Generic clock generator 7" value="0x7"/>
            <value name="GCLK8" caption="Generic clock generator 8" value="0x8"/>
            <value name="GCLK9" caption="Generic clock generator 9" value="0x9"/>
            <value name="GCLK10" caption="Generic clock generator 10" value="0xA"/>
            <value name="GCLK11" caption="Generic clock generator 11" value="0xB"/>
         </value-group>
      </module>
