ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
      <module name="HMATRIXB" id="I7638" version="2.1.4" caption="HSB Matrix">
         <register-group name="PRS" size="0x8">
            <register name="PRAS"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Priority A for Slave">
        </register>
            <register name="PRBS"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Priority B for Slave">
        </register>
         </register-group>
         <register-group name="HMATRIXB" caption="HSB Matrix">
            <register-group name="PRS"
                            name-in-module="PRS"
                            offset="0x080"
                            size="0x8"
                            count="16"/>
         </register-group>
      </module>
      <module name="ICM"
              id="U2010"
              version="1.2.0"
              caption="Integrity Check Monitor">
         <register-group name="ICM" caption="Integrity Check Monitor">
            <register name="CFG"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Configuration">
               <bitfield name="WBDIS" caption="Write Back Disable" mask="0x1"/>
               <bitfield name="EOMDIS" caption="End of Monitoring Disable" mask="0x2"/>
               <bitfield name="SLBDIS" caption="Secondary List Branching Disable" mask="0x4"/>
               <bitfield name="BBC" caption="Bus Burden Control" mask="0xF0"/>
               <bitfield name="ASCD"
                         caption="Automatic Switch To Compare Digest"
                         mask="0x100"/>
               <bitfield name="DUALBUFF" caption="Dual Input Buffer" mask="0x200"/>
               <bitfield name="UIHASH" caption="User Initial Hash Value" mask="0x1000"/>
               <bitfield name="UALGO"
                         caption="User SHA Algorithm"
                         mask="0xE000"
                         values="ICM_CFG__UALGO"/>
            </register>
            <register name="CTRL"
                      offset="0x4"
                      rw="W"
                      size="4"
                      access-size="4"
                      caption="Control">
               <bitfield name="ENABLE" caption="ICM Enable" mask="0x1"/>
               <bitfield name="DISABLE" caption="ICM Disable Register" mask="0x2"/>
               <bitfield name="SWRST" caption="Software Reset" mask="0x4"/>
               <bitfield name="REHASH" caption="Recompute Internal Hash" mask="0xF0"/>
               <bitfield name="RMDIS" caption="Region Monitoring Disable" mask="0xF00"/>
               <bitfield name="RMEN" caption="Region Monitoring Enable" mask="0xF000"/>
            </register>
            <register name="SR"
                      offset="0x8"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Status">
               <bitfield name="ENABLE" caption="ICM Controller Enable Register" mask="0x1"/>
               <bitfield name="RAWRMDIS"
                         caption="RAW Region Monitoring Disabled Status"
                         mask="0xF00"/>
               <bitfield name="RMDIS"
                         caption="Region Monitoring Disabled Status"
                         mask="0xF000"/>
            </register>
            <register name="IER"
                      offset="0x10"
                      rw="W"
                      size="4"
                      access-size="4"
                      atomic-op="set:IMR"
                      caption="Interrupt Enable">
               <bitfield name="RHC"
                         caption="Region Hash Completed Interrupt Enable"
                         mask="0xF"/>
               <bitfield name="RDM"
                         caption="Region Digest Mismatch Interrupt Enable"
                         mask="0xF0"/>
               <bitfield name="RBE" caption="Region Bus Error Interrupt Enable" mask="0xF00"/>
               <bitfield name="RWC"
                         caption="Region Wrap Condition detected Interrupt Enable"
                         mask="0xF000"/>
               <bitfield name="REC"
                         caption="Region End bit Condition Detected Interrupt Enable"
                         mask="0xF0000"/>
               <bitfield name="RSU"
                         caption="Region Status Updated Interrupt Disable"
                         mask="0xF00000"/>
               <bitfield name="URAD"
                         caption="Undefined Register Access Detection Interrupt Enable"
                         mask="0x1000000"/>
            </register>
            <register name="IDR"
                      offset="0x14"
                      rw="W"
                      size="4"
                      access-size="4"
                      atomic-op="clear:IMR"
                      initval="0x00000000"
                      caption="Interrupt Disable">
               <bitfield name="RHC"
                         caption="Region Hash Completed Interrupt Disable"
                         mask="0xF"/>
               <bitfield name="RDM"
                         caption="Region Digest Mismatch Interrupt Disable"
                         mask="0xF0"/>
               <bitfield name="RBE"
                         caption="Region Bus Error Interrupt Disable"
                         mask="0xF00"/>
               <bitfield name="RWC"
                         caption="Region Wrap Condition Detected Interrupt Disable"
                         mask="0xF000"/>
               <bitfield name="REC"
                         caption="Region End bit Condition detected Interrupt Disable"
                         mask="0xF0000"/>
               <bitfield name="RSU"
                         caption="Region Status Updated Interrupt Disable"
                         mask="0xF00000"/>
               <bitfield name="URAD"
                         caption="Undefined Register Access Detection Interrupt Disable"
                         mask="0x1000000"/>
            </register>
            <register name="IMR"
                      offset="0x18"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Interrupt Mask">
               <bitfield name="RHC"
                         caption="Region Hash Completed Interrupt Mask"
                         mask="0xF"/>
               <bitfield name="RDM"
                         caption="Region Digest Mismatch Interrupt Mask"
                         mask="0xF0"/>
               <bitfield name="RBE" caption="Region Bus Error Interrupt Mask" mask="0xF00"/>
               <bitfield name="RWC"
                         caption="Region Wrap Condition Detected Interrupt Mask"
                         mask="0xF000"/>
               <bitfield name="REC"
                         caption="Region End bit Condition Detected Interrupt Mask"
                         mask="0xF0000"/>
               <bitfield name="RSU"
                         caption="Region Status Updated Interrupt Mask"
                         mask="0xF00000"/>
               <bitfield name="URAD"
                         caption="Undefined Register Access Detection Interrupt Mask"
                         mask="0x1000000"/>
            </register>
            <register name="ISR"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Interrupt Status">
               <bitfield name="RHC" caption="Region Hash Completed" mask="0xF"/>
               <bitfield name="RDM" caption="Region Digest Mismatch" mask="0xF0"/>
               <bitfield name="RBE" caption="Region Bus Error" mask="0xF00"/>
               <bitfield name="RWC" caption="Region Wrap Condition Detected" mask="0xF000"/>
               <bitfield name="REC"
                         caption="Region End bit Condition Detected"
                         mask="0xF0000"/>
               <bitfield name="RSU" caption="Region Status Updated Detected" mask="0xF00000"/>
               <bitfield name="URAD"
                         caption="Undefined Register Access Detection Status"
                         mask="0x1000000"/>
            </register>
            <register name="UASR"
                      offset="0x20"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Undefined Access Status">
               <bitfield name="URAT"
                         caption="Undefined Register Access Trace"
                         mask="0x7"
                         values="ICM_UASR__URAT"/>
            </register>
            <register name="DSCR"
                      offset="0x30"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Region Descriptor Area Start Address">
               <bitfield name="DASA"
                         caption="Descriptor Area Start Address"
                         mask="0xFFFFFFC0"/>
            </register>
            <register name="HASH"
                      offset="0x34"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Region Hash Area Start Address">
               <bitfield name="HASA" caption="Hash Area Start Address" mask="0xFFFFFF80"/>
            </register>
            <register name="UIHVAL"
                      offset="0x38"
                      rw="W"
                      size="4"
                      access-size="4"
                      count="8"
                      initval="0x00000000"
                      caption="User Initial Hash Value n">
               <bitfield name="VAL" caption="Initial Hash Value" mask="0xFFFFFFFF"/>
            </register>
         </register-group>
         <register-group name="ICM_DESCRIPTOR" caption="Integrity Check Monitor">
            <register name="RADDR"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Region Start Address">
        </register>
            <register name="RCFG"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Region Configuration">
               <bitfield name="CDWBN"
                         caption="Compare Digest Write Back"
                         mask="0x1"
                         values="ICM_RCFG__CDWBN"/>
               <bitfield name="WRAP"
                         caption="Region Wrap"
                         mask="0x2"
                         values="ICM_RCFG__WRAP"/>
               <bitfield name="EOM"
                         caption="End of Monitoring"
                         mask="0x4"
                         values="ICM_RCFG__EOM"/>
               <bitfield name="RHIEN"
                         caption="Region Hash Interrupt Enable"
                         mask="0x10"
                         values="ICM_RCFG__RHIEN"/>
               <bitfield name="DMIEN"
                         caption="Region Digest Mismatch Interrupt Enable"
                         mask="0x20"
                         values="ICM_RCFG__DMIEN"/>
               <bitfield name="BEIEN"
                         caption="Region Bus Error Interrupt Enable"
                         mask="0x40"
                         values="ICM_RCFG__BEIEN"/>
               <bitfield name="WCIEN"
                         caption="Region Wrap Condition Detected Interrupt Enable"
                         mask="0x80"
                         values="ICM_RCFG__WCIEN"/>
               <bitfield name="ECIEN"
                         caption="Region End bit Condition detected Interrupt Enable"
                         mask="0x100"
                         values="ICM_RCFG__ECIEN"/>
               <bitfield name="SUIEN"
                         caption="Region Status Updated Interrupt Enable"
                         mask="0x200"
                         values="ICM_RCFG__SUIEN"/>
               <bitfield name="PROCDLY"
                         caption="SHA Processing Delay"
                         mask="0x400"
                         values="ICM_RCFG__PROCDLY"/>
               <bitfield name="ALGO" caption="SHA Algorithm" mask="0x7000"/>
               <bitfield name="MRPROT"
                         caption="Memory Region AHB Protection"
                         mask="0x3F000000"/>
            </register>
            <register name="RCTRL"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Region Control">
               <bitfield name="TRSIZE" caption="Transfer Size" mask="0xFFFF"/>
            </register>
            <register name="RNEXT"
                      offset="0xC"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Region Next Address">
        </register>
         </register-group>
         <value-group name="ICM_CFG__UALGO">
            <value name="SHA1" caption="SHA1 Algorithm" value="0x0"/>
            <value name="SHA256" caption="SHA256 Algorithm" value="0x1"/>
            <value name="SHA224" caption="SHA224 Algorithm" value="0x4"/>
         </value-group>
