ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="SYNCBUSY"
                      offset="0x18"
                      rw="R"
                      size="2"
                      initval="0x0000"
                      caption="Synchronization Status">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Status"
                         mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable Synchronization Status" mask="0x2"/>
               <bitfield name="CKEN0"
                         caption="Clock Unit 0 Enable Synchronization Status"
                         mask="0x4"/>
               <bitfield name="CKEN1"
                         caption="Clock Unit 1 Enable Synchronization Status"
                         mask="0x8"/>
               <bitfield name="TXEN"
                         caption="Tx Serializer Enable Synchronization Status"
                         mask="0x10"/>
               <bitfield name="RXEN"
                         caption="Rx Serializer Enable Synchronization Status"
                         mask="0x20"/>
               <bitfield name="TXDATA" caption="Tx Data Synchronization Status" mask="0x100"/>
               <bitfield name="RXDATA" caption="Rx Data Synchronization Status" mask="0x200"/>
            </register>
            <register name="TXCTRL"
                      offset="0x20"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Tx Serializer Control">
               <bitfield name="TXDEFAULT"
                         caption="Line Default Line when Slot Disabled"
                         mask="0xC"
                         values="I2S_TXCTRL__TXDEFAULT"/>
               <bitfield name="TXSAME"
                         caption="Transmit Data when Underrun"
                         mask="0x10"
                         values="I2S_TXCTRL__TXSAME"/>
               <bitfield name="SLOTADJ"
                         caption="Data Slot Formatting Adjust"
                         mask="0x80"
                         values="I2S_TXCTRL__SLOTADJ"/>
               <bitfield name="DATASIZE"
                         caption="Data Word Size"
                         mask="0x700"
                         values="I2S_TXCTRL__DATASIZE"/>
               <bitfield name="WORDADJ"
                         caption="Data Word Formatting Adjust"
                         mask="0x1000"
                         values="I2S_TXCTRL__WORDADJ"/>
               <bitfield name="EXTEND"
                         caption="Data Formatting Bit Extension"
                         mask="0x6000"
                         values="I2S_TXCTRL__EXTEND"/>
               <bitfield name="BITREV"
                         caption="Data Formatting Bit Reverse"
                         mask="0x8000"
                         values="I2S_TXCTRL__BITREV"/>
               <bitfield name="SLOTDIS0"
                         caption="Slot 0 Disabled for this Serializer"
                         mask="0x10000"/>
               <bitfield name="SLOTDIS1"
                         caption="Slot 1 Disabled for this Serializer"
                         mask="0x20000"/>
               <bitfield name="SLOTDIS2"
                         caption="Slot 2 Disabled for this Serializer"
                         mask="0x40000"/>
               <bitfield name="SLOTDIS3"
                         caption="Slot 3 Disabled for this Serializer"
                         mask="0x80000"/>
               <bitfield name="SLOTDIS4"
                         caption="Slot 4 Disabled for this Serializer"
                         mask="0x100000"/>
               <bitfield name="SLOTDIS5"
                         caption="Slot 5 Disabled for this Serializer"
                         mask="0x200000"/>
               <bitfield name="SLOTDIS6"
                         caption="Slot 6 Disabled for this Serializer"
                         mask="0x400000"/>
               <bitfield name="SLOTDIS7"
                         caption="Slot 7 Disabled for this Serializer"
                         mask="0x800000"/>
               <bitfield name="MONO"
                         caption="Mono Mode"
                         mask="0x1000000"
                         values="I2S_TXCTRL__MONO"/>
               <bitfield name="DMA"
                         caption="Single or Multiple DMA Channels"
                         mask="0x2000000"
                         values="I2S_TXCTRL__DMA"/>
            </register>
            <register name="RXCTRL"
                      offset="0x24"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Rx Serializer Control">
               <bitfield name="SERMODE"
                         caption="Serializer Mode"
                         mask="0x3"
                         values="I2S_RXCTRL__SERMODE"/>
               <bitfield name="CLKSEL"
                         caption="Clock Unit Selection"
                         mask="0x20"
                         values="I2S_RXCTRL__CLKSEL"/>
               <bitfield name="SLOTADJ"
                         caption="Data Slot Formatting Adjust"
                         mask="0x80"
                         values="I2S_RXCTRL__SLOTADJ"/>
               <bitfield name="DATASIZE"
                         caption="Data Word Size"
                         mask="0x700"
                         values="I2S_RXCTRL__DATASIZE"/>
               <bitfield name="WORDADJ"
                         caption="Data Word Formatting Adjust"
                         mask="0x1000"
                         values="I2S_RXCTRL__WORDADJ"/>
               <bitfield name="EXTEND"
                         caption="Data Formatting Bit Extension"
                         mask="0x6000"
                         values="I2S_RXCTRL__EXTEND"/>
               <bitfield name="BITREV"
                         caption="Data Formatting Bit Reverse"
                         mask="0x8000"
                         values="I2S_RXCTRL__BITREV"/>
               <bitfield name="SLOTDIS0"
                         caption="Slot 0 Disabled for this Serializer"
                         mask="0x10000"/>
               <bitfield name="SLOTDIS1"
                         caption="Slot 1 Disabled for this Serializer"
                         mask="0x20000"/>
               <bitfield name="SLOTDIS2"
                         caption="Slot 2 Disabled for this Serializer"
                         mask="0x40000"/>
               <bitfield name="SLOTDIS3"
                         caption="Slot 3 Disabled for this Serializer"
                         mask="0x80000"/>
               <bitfield name="SLOTDIS4"
                         caption="Slot 4 Disabled for this Serializer"
                         mask="0x100000"/>
               <bitfield name="SLOTDIS5"
                         caption="Slot 5 Disabled for this Serializer"
                         mask="0x200000"/>
               <bitfield name="SLOTDIS6"
                         caption="Slot 6 Disabled for this Serializer"
                         mask="0x400000"/>
               <bitfield name="SLOTDIS7"
                         caption="Slot 7 Disabled for this Serializer"
                         mask="0x800000"/>
               <bitfield name="MONO"
                         caption="Mono Mode"
                         mask="0x1000000"
                         values="I2S_RXCTRL__MONO"/>
               <bitfield name="DMA"
                         caption="Single or Multiple DMA Channels"
                         mask="0x2000000"
                         values="I2S_RXCTRL__DMA"/>
               <bitfield name="RXLOOP" caption="Loop-back Test Mode" mask="0x4000000"/>
            </register>
            <register name="TXDATA"
                      offset="0x30"
                      rw="W"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="Tx Data">
               <bitfield name="DATA" caption="Sample Data" mask="0xFFFFFFFF"/>
            </register>
