ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="RXDATA"
                      offset="0x34"
                      rw="R"
                      access="RSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="Rx Data">
               <bitfield name="DATA" caption="Sample Data" mask="0xFFFFFFFF"/>
            </register>
         </register-group>
         <value-group name="I2S_CLKCTRL__BITDELAY">
            <value name="LJ" caption="Left Justified (0 Bit Delay)" value="0x0"/>
            <value name="I2S" caption="I2S (1 Bit Delay)" value="0x1"/>
         </value-group>
         <value-group name="I2S_CLKCTRL__FSSEL">
            <value name="SCKDIV"
                   caption="Divided Serial Clock n is used as Frame Sync n source"
                   value="0x0"/>
            <value name="FSPIN"
                   caption="FSn input pin is used as Frame Sync n source"
                   value="0x1"/>
         </value-group>
         <value-group name="I2S_CLKCTRL__FSWIDTH">
            <value name="SLOT"
                   caption="Frame Sync Pulse is 1 Slot wide (default for I2S protocol)"
                   value="0x0"/>
            <value name="HALF"
                   caption="Frame Sync Pulse is half a Frame wide"
                   value="0x1"/>
            <value name="BIT" caption="Frame Sync Pulse is 1 Bit wide" value="0x2"/>
            <value name="BURST"
                   caption="Clock Unit n operates in Burst mode, with a 1-bit wide Frame Sync pulse per Data sample, only when Data transfer is requested"
                   value="0x3"/>
         </value-group>
         <value-group name="I2S_CLKCTRL__MCKSEL">
            <value name="GCLK"
                   caption="GCLK_I2S_n is used as Master Clock n source"
                   value="0x0"/>
            <value name="MCKPIN"
                   caption="MCKn input pin is used as Master Clock n source"
                   value="0x1"/>
         </value-group>
         <value-group name="I2S_CLKCTRL__SCKSEL">
            <value name="MCKDIV"
                   caption="Divided Master Clock n is used as Serial Clock n source"
                   value="0x0"/>
            <value name="SCKPIN"
                   caption="SCKn input pin is used as Serial Clock n source"
                   value="0x1"/>
         </value-group>
         <value-group name="I2S_CLKCTRL__SLOTSIZE">
            <value name="8" caption="8-bit Slot for Clock Unit n" value="0x0"/>
            <value name="16" caption="16-bit Slot for Clock Unit n" value="0x1"/>
            <value name="24" caption="24-bit Slot for Clock Unit n" value="0x2"/>
            <value name="32" caption="32-bit Slot for Clock Unit n" value="0x3"/>
         </value-group>
         <value-group name="I2S_TXCTRL__BITREV">
            <value name="MSBIT"
                   caption="Transfer Data Most Significant Bit (MSB) first (default for I2S protocol)"
                   value="0x0"/>
            <value name="LSBIT"
                   caption="Transfer Data Least Significant Bit (LSB) first"
                   value="0x1"/>
         </value-group>
         <value-group name="I2S_TXCTRL__DATASIZE">
            <value name="32" caption="32 bits" value="0x0"/>
            <value name="24" caption="24 bits" value="0x1"/>
            <value name="20" caption="20 bits" value="0x2"/>
            <value name="18" caption="18 bits" value="0x3"/>
            <value name="16" caption="16 bits" value="0x4"/>
            <value name="16C" caption="16 bits compact stereo" value="0x5"/>
            <value name="8" caption="8 bits" value="0x6"/>
            <value name="8C" caption="8 bits compact stereo" value="0x7"/>
         </value-group>
         <value-group name="I2S_TXCTRL__DMA">
            <value name="SINGLE" caption="Single DMA channel" value="0x0"/>
            <value name="MULTIPLE"
                   caption="One DMA channel per data channel"
                   value="0x1"/>
         </value-group>
         <value-group name="I2S_TXCTRL__EXTEND">
            <value name="ZERO" caption="Extend with zeroes" value="0x0"/>
            <value name="ONE" caption="Extend with ones" value="0x1"/>
            <value name="MSBIT" caption="Extend with Most Significant Bit" value="0x2"/>
            <value name="LSBIT"
                   caption="Extend with Least Significant Bit"
                   value="0x3"/>
         </value-group>
         <value-group name="I2S_TXCTRL__MONO">
            <value name="STEREO" caption="Normal mode" value="0x0"/>
            <value name="MONO"
                   caption="Left channel data is duplicated to right channel"
                   value="0x1"/>
         </value-group>
         <value-group name="I2S_TXCTRL__SLOTADJ">
            <value name="RIGHT" caption="Data is right adjusted in slot" value="0x0"/>
            <value name="LEFT" caption="Data is left adjusted in slot" value="0x1"/>
         </value-group>
         <value-group name="I2S_TXCTRL__TXDEFAULT">
            <value name="ZERO" caption="Output Default Value is 0" value="0x0"/>
            <value name="ONE" caption="Output Default Value is 1" value="0x1"/>
            <value name="HIZ"
                   caption="Output Default Value is high impedance"
                   value="0x3"/>
         </value-group>
         <value-group name="I2S_TXCTRL__TXSAME">
            <value name="ZERO"
                   caption="Zero data transmitted in case of underrun"
                   value="0x0"/>
            <value name="SAME"
                   caption="Last data transmitted in case of underrun"
                   value="0x1"/>
         </value-group>
         <value-group name="I2S_TXCTRL__WORDADJ">
            <value name="RIGHT" caption="Data is right adjusted in word" value="0x0"/>
            <value name="LEFT" caption="Data is left adjusted in word" value="0x1"/>
         </value-group>
         <value-group name="I2S_RXCTRL__BITREV">
            <value name="MSBIT"
                   caption="Transfer Data Most Significant Bit (MSB) first (default for I2S protocol)"
                   value="0x0"/>
            <value name="LSBIT"
                   caption="Transfer Data Least Significant Bit (LSB) first"
                   value="0x1"/>
         </value-group>
         <value-group name="I2S_RXCTRL__CLKSEL">
            <value name="CLK0" caption="Use Clock Unit 0" value="0x0"/>
            <value name="CLK1" caption="Use Clock Unit 1" value="0x1"/>
         </value-group>
         <value-group name="I2S_RXCTRL__DATASIZE">
            <value name="32" caption="32 bits" value="0x0"/>
            <value name="24" caption="24 bits" value="0x1"/>
            <value name="20" caption="20 bits" value="0x2"/>
            <value name="18" caption="18 bits" value="0x3"/>
            <value name="16" caption="16 bits" value="0x4"/>
            <value name="16C" caption="16 bits compact stereo" value="0x5"/>
            <value name="8" caption="8 bits" value="0x6"/>
            <value name="8C" caption="8 bits compact stereo" value="0x7"/>
         </value-group>
         <value-group name="I2S_RXCTRL__DMA">
            <value name="SINGLE" caption="Single DMA channel" value="0x0"/>
            <value name="MULTIPLE"
                   caption="One DMA channel per data channel"
                   value="0x1"/>
         </value-group>
