ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="I2S_RXCTRL__EXTEND">
            <value name="ZERO" caption="Extend with zeroes" value="0x0"/>
            <value name="ONE" caption="Extend with ones" value="0x1"/>
            <value name="MSBIT" caption="Extend with Most Significant Bit" value="0x2"/>
            <value name="LSBIT"
                   caption="Extend with Least Significant Bit"
                   value="0x3"/>
         </value-group>
         <value-group name="I2S_RXCTRL__MONO">
            <value name="STEREO" caption="Normal mode" value="0x0"/>
            <value name="MONO"
                   caption="Left channel data is duplicated to right channel"
                   value="0x1"/>
         </value-group>
         <value-group name="I2S_RXCTRL__SERMODE">
            <value name="RX" caption="Receive" value="0x0"/>
            <value name="PDM2"
                   caption="Receive one PDM data on each serial clock edge"
                   value="0x2"/>
         </value-group>
         <value-group name="I2S_RXCTRL__SLOTADJ">
            <value name="RIGHT" caption="Data is right adjusted in slot" value="0x0"/>
            <value name="LEFT" caption="Data is left adjusted in slot" value="0x1"/>
         </value-group>
         <value-group name="I2S_RXCTRL__WORDADJ">
            <value name="RIGHT" caption="Data is right adjusted in word" value="0x0"/>
            <value name="LEFT" caption="Data is left adjusted in word" value="0x1"/>
         </value-group>
      </module>
      <module name="MCLK" id="U2408" version="1.0.0" caption="Main Clock">
         <register-group name="MCLK" caption="Main Clock">
            <register name="INTENCLR"
                      offset="0x1"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
            </register>
            <register name="INTENSET"
                      offset="0x2"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
            </register>
            <register name="INTFLAG"
                      offset="0x3"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x01"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="CKRDY" caption="Clock Ready" mask="0x1"/>
            </register>
            <register name="HSDIV"
                      offset="0x4"
                      rw="R"
                      size="1"
                      initval="0x01"
                      caption="HS Clock Division">
               <bitfield name="DIV"
                         caption="CPU Clock Division Factor"
                         mask="0xFF"
                         values="MCLK_HSDIV__DIV"/>
            </register>
            <register name="CPUDIV"
                      offset="0x5"
                      rw="RW"
                      size="1"
                      initval="0x01"
                      caption="CPU Clock Division">
               <bitfield name="DIV"
                         caption="Low-Power Clock Division Factor"
                         mask="0xFF"
                         values="MCLK_CPUDIV__DIV"/>
            </register>
            <register name="AHBMASK"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      initval="0x00FFFFFF"
                      caption="AHB Mask">
               <bitfield name="HPB0_" caption="HPB0 AHB Clock Mask" mask="0x1"/>
               <bitfield name="HPB1_" caption="HPB1 AHB Clock Mask" mask="0x2"/>
               <bitfield name="HPB2_" caption="HPB2 AHB Clock Mask" mask="0x4"/>
               <bitfield name="HPB3_" caption="HPB3 AHB Clock Mask" mask="0x8"/>
               <bitfield name="DSU_" caption="DSU AHB Clock Mask" mask="0x10"/>
               <bitfield name="NVMCTRL_" caption="NVMCTRL AHB Clock Mask" mask="0x40"/>
               <bitfield name="CMCC_" caption="CMCC AHB Clock Mask" mask="0x100"/>
               <bitfield name="DMAC_" caption="DMAC AHB Clock Mask" mask="0x200"/>
               <bitfield name="USB_" caption="USB AHB Clock Mask" mask="0x400"/>
               <bitfield name="PAC_" caption="PAC AHB Clock Mask" mask="0x1000"/>
               <bitfield name="QSPI_" caption="QSPI AHB Clock Mask" mask="0x2000"/>
               <bitfield name="SDHC0_" caption="SDHC0 AHB Clock Mask" mask="0x8000"/>
               <bitfield name="ICM_" caption="ICM AHB Clock Mask" mask="0x80000"/>
               <bitfield name="PUKCC_" caption="PUKCC AHB Clock Mask" mask="0x100000"/>
               <bitfield name="QSPI_2X_" caption="QSPI_2X AHB Clock Mask" mask="0x200000"/>
               <bitfield name="NVMCTRL_SMEEPROM_"
                         caption="NVMCTRL_SMEEPROM AHB Clock Mask"
                         mask="0x400000"/>
               <bitfield name="NVMCTRL_CACHE_"
                         caption="NVMCTRL_CACHE AHB Clock Mask"
                         mask="0x800000"/>
            </register>
            <register name="APBAMASK"
                      offset="0x14"
                      rw="RW"
                      size="4"
                      initval="0x000007FF"
                      caption="APBA Mask">
               <bitfield name="PAC_" caption="PAC APB Clock Enable" mask="0x1"/>
               <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x2"/>
               <bitfield name="MCLK_" caption="MCLK APB Clock Enable" mask="0x4"/>
               <bitfield name="RSTC_" caption="RSTC APB Clock Enable" mask="0x8"/>
               <bitfield name="OSCCTRL_" caption="OSCCTRL APB Clock Enable" mask="0x10"/>
               <bitfield name="OSC32KCTRL_"
                         caption="OSC32KCTRL APB Clock Enable"
                         mask="0x20"/>
               <bitfield name="SUPC_" caption="SUPC APB Clock Enable" mask="0x40"/>
               <bitfield name="GCLK_" caption="GCLK APB Clock Enable" mask="0x80"/>
               <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x100"/>
               <bitfield name="RTC_" caption="RTC APB Clock Enable" mask="0x200"/>
               <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x400"/>
               <bitfield name="FREQM_" caption="FREQM APB Clock Enable" mask="0x800"/>
               <bitfield name="SERCOM0_" caption="SERCOM0 APB Clock Enable" mask="0x1000"/>
               <bitfield name="SERCOM1_" caption="SERCOM1 APB Clock Enable" mask="0x2000"/>
               <bitfield name="TC0_" caption="TC0 APB Clock Enable" mask="0x4000"/>
               <bitfield name="TC1_" caption="TC1 APB Clock Enable" mask="0x8000"/>
            </register>
            <register name="APBBMASK"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      initval="0x00018056"
                      caption="APBB Mask">
               <bitfield name="USB_" caption="USB APB Clock Enable" mask="0x1"/>
               <bitfield name="DSU_" caption="DSU APB Clock Enable" mask="0x2"/>
               <bitfield name="NVMCTRL_" caption="NVMCTRL APB Clock Enable" mask="0x4"/>
               <bitfield name="PORT_" caption="PORT APB Clock Enable" mask="0x10"/>
               <bitfield name="EVSYS_" caption="EVSYS APB Clock Enable" mask="0x80"/>
               <bitfield name="SERCOM2_" caption="SERCOM2 APB Clock Enable" mask="0x200"/>
               <bitfield name="SERCOM3_" caption="SERCOM3 APB Clock Enable" mask="0x400"/>
               <bitfield name="TCC0_" caption="TCC0 APB Clock Enable" mask="0x800"/>
               <bitfield name="TCC1_" caption="TCC1 APB Clock Enable" mask="0x1000"/>
               <bitfield name="TC2_" caption="TC2 APB Clock Enable" mask="0x2000"/>
               <bitfield name="TC3_" caption="TC3 APB Clock Enable" mask="0x4000"/>
               <bitfield name="RAMECC_" caption="RAMECC APB Clock Enable" mask="0x10000"/>
            </register>
            <register name="APBCMASK"
                      offset="0x1C"
                      rw="RW"
                      size="4"
                      initval="0x00002000"
                      caption="APBC Mask">
               <bitfield name="TCC2_" caption="TCC2 APB Clock Enable" mask="0x8"/>
               <bitfield name="TCC3_" caption="TCC3 APB Clock Enable" mask="0x10"/>
               <bitfield name="TC4_" caption="TC4 APB Clock Enable" mask="0x20"/>
               <bitfield name="TC5_" caption="TC5 APB Clock Enable" mask="0x40"/>
               <bitfield name="PDEC_" caption="PDEC APB Clock Enable" mask="0x80"/>
               <bitfield name="AC_" caption="AC APB Clock Enable" mask="0x100"/>
               <bitfield name="AES_" caption="AES APB Clock Enable" mask="0x200"/>
               <bitfield name="TRNG_" caption="TRNG APB Clock Enable" mask="0x400"/>
               <bitfield name="ICM_" caption="ICM APB Clock Enable" mask="0x800"/>
               <bitfield name="QSPI_" caption="QSPI APB Clock Enable" mask="0x2000"/>
               <bitfield name="CCL_" caption="CCL APB Clock Enable" mask="0x4000"/>
            </register>
            <register name="APBDMASK"
                      offset="0x20"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="APBD Mask">
               <bitfield name="SERCOM4_" caption="SERCOM4 APB Clock Enable" mask="0x1"/>
               <bitfield name="SERCOM5_" caption="SERCOM5 APB Clock Enable" mask="0x2"/>
               <bitfield name="TCC4_" caption="TCC4 APB Clock Enable" mask="0x10"/>
               <bitfield name="ADC0_" caption="ADC0 APB Clock Enable" mask="0x80"/>
               <bitfield name="ADC1_" caption="ADC1 APB Clock Enable" mask="0x100"/>
               <bitfield name="DAC_" caption="DAC APB Clock Enable" mask="0x200"/>
               <bitfield name="I2S_" caption="I2S APB Clock Enable" mask="0x400"/>
               <bitfield name="PCC_" caption="PCC APB Clock Enable" mask="0x800"/>
            </register>
         </register-group>
