ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="MCLK_HSDIV__DIV">
            <value name="DIV1" caption="Divide by 1" value="0x01"/>
         </value-group>
         <value-group name="MCLK_CPUDIV__DIV">
            <value name="DIV1" caption="Divide by 1" value="0x01"/>
            <value name="DIV2" caption="Divide by 2" value="0x02"/>
            <value name="DIV4" caption="Divide by 4" value="0x04"/>
            <value name="DIV8" caption="Divide by 8" value="0x08"/>
            <value name="DIV16" caption="Divide by 16" value="0x10"/>
            <value name="DIV32" caption="Divide by 32" value="0x20"/>
            <value name="DIV64" caption="Divide by 64" value="0x40"/>
            <value name="DIV128" caption="Divide by 128" value="0x80"/>
         </value-group>
      </module>
      <module name="NVMCTRL"
              id="U2409"
              version="1.0.0"
              caption="Non-Volatile Memory Controller">
         <register-group name="NVMCTRL" caption="Non-Volatile Memory Controller">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="2"
                      initval="0x0004"
                      caption="Control A">
               <bitfield name="AUTOWS" caption="Auto Wait State Enable" mask="0x4"/>
               <bitfield name="SUSPEN" caption="Suspend Enable" mask="0x8"/>
               <bitfield name="WMODE"
                         caption="Write Mode"
                         mask="0x30"
                         values="NVMCTRL_CTRLA__WMODE"/>
               <bitfield name="PRM"
                         caption="Power Reduction Mode during Sleep"
                         mask="0xC0"
                         values="NVMCTRL_CTRLA__PRM"/>
               <bitfield name="RWS" caption="NVM Read Wait States" mask="0xF00"/>
               <bitfield name="AHBNS0"
                         caption="Force AHB0 access to NONSEQ, burst transfers are continuously rearbitrated"
                         mask="0x1000"/>
               <bitfield name="AHBNS1"
                         caption="Force AHB1 access to NONSEQ, burst transfers are continuously rearbitrated"
                         mask="0x2000"/>
               <bitfield name="CACHEDIS0" caption="AHB0 Cache Disable" mask="0x4000"/>
               <bitfield name="CACHEDIS1" caption="AHB1 Cache Disable" mask="0x8000"/>
            </register>
            <register name="CTRLB"
                      offset="0x4"
                      rw="W"
                      size="2"
                      initval="0x0000"
                      caption="Control B">
               <bitfield name="CMD"
                         caption="Command"
                         mask="0x7F"
                         values="NVMCTRL_CTRLB__CMD"/>
               <bitfield name="CMDEX"
                         caption="Command Execution"
                         mask="0xFF00"
                         values="NVMCTRL_CTRLB__CMDEX"/>
            </register>
            <register name="PARAM"
                      offset="0x8"
                      rw="R"
                      size="4"
                      initval="0x00060000"
                      caption="NVM Parameter">
               <bitfield name="NVMP" caption="NVM Pages" mask="0xFFFF"/>
               <bitfield name="PSZ"
                         caption="Page Size"
                         mask="0x70000"
                         values="NVMCTRL_PARAM__PSZ"/>
               <bitfield name="SEE"
                         caption="SmartEEPROM Supported"
                         mask="0x80000000"
                         values="NVMCTRL_PARAM__SEE"/>
            </register>
            <register name="INTENCLR"
                      offset="0xC"
                      rw="RW"
                      size="2"
                      atomic-op="clear:INTENCLR"
                      initval="0x0000"
                      caption="Interrupt Enable Clear">
               <bitfield name="DONE" caption="Command Done Interrupt Clear" mask="0x1"/>
               <bitfield name="ADDRE" caption="Address Error" mask="0x2"/>
               <bitfield name="PROGE" caption="Programming Error Interrupt Clear" mask="0x4"/>
               <bitfield name="LOCKE" caption="Lock Error Interrupt Clear" mask="0x8"/>
               <bitfield name="ECCSE" caption="ECC Single Error Interrupt Clear" mask="0x10"/>
               <bitfield name="ECCDE" caption="ECC Dual Error Interrupt Clear" mask="0x20"/>
               <bitfield name="NVME" caption="NVM Error Interrupt Clear" mask="0x40"/>
               <bitfield name="SUSP"
                         caption="Suspended Write Or Erase Interrupt Clear"
                         mask="0x80"/>
               <bitfield name="SEESFULL"
                         caption="Active SEES Full Interrupt Clear"
                         mask="0x100"/>
               <bitfield name="SEESOVF"
                         caption="Active SEES Overflow Interrupt Clear"
                         mask="0x200"/>
               <bitfield name="SEEWRC"
                         caption="SEE Write Completed Interrupt Clear"
                         mask="0x400"/>
            </register>
            <register name="INTENSET"
                      offset="0xE"
                      rw="RW"
                      size="2"
                      atomic-op="set:INTENSET"
                      initval="0x0000"
                      caption="Interrupt Enable Set">
               <bitfield name="DONE" caption="Command Done Interrupt Enable" mask="0x1"/>
               <bitfield name="ADDRE" caption="Address Error Interrupt Enable" mask="0x2"/>
               <bitfield name="PROGE"
                         caption="Programming Error Interrupt Enable"
                         mask="0x4"/>
               <bitfield name="LOCKE" caption="Lock Error Interrupt Enable" mask="0x8"/>
               <bitfield name="ECCSE"
                         caption="ECC Single Error Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="ECCDE" caption="ECC Dual Error Interrupt Enable" mask="0x20"/>
               <bitfield name="NVME" caption="NVM Error Interrupt Enable" mask="0x40"/>
               <bitfield name="SUSP"
                         caption="Suspended Write Or Erase  Interrupt Enable"
                         mask="0x80"/>
               <bitfield name="SEESFULL"
                         caption="Active SEES Full Interrupt Enable"
                         mask="0x100"/>
               <bitfield name="SEESOVF"
                         caption="Active SEES Overflow Interrupt Enable"
                         mask="0x200"/>
               <bitfield name="SEEWRC"
                         caption="SEE Write Completed Interrupt Enable"
                         mask="0x400"/>
            </register>
            <register name="INTFLAG"
                      offset="0x10"
                      rw="RW"
                      size="2"
                      atomic-op="clear:INTFLAG"
                      initval="0x0000"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="DONE" caption="Command Done" mask="0x1"/>
               <bitfield name="ADDRE" caption="Address Error" mask="0x2"/>
               <bitfield name="PROGE" caption="Programming Error" mask="0x4"/>
               <bitfield name="LOCKE" caption="Lock Error" mask="0x8"/>
               <bitfield name="ECCSE" caption="ECC Single Error" mask="0x10"/>
               <bitfield name="ECCDE" caption="ECC Dual Error" mask="0x20"/>
               <bitfield name="NVME" caption="NVM Error" mask="0x40"/>
               <bitfield name="SUSP"
                         caption="Suspended Write Or Erase Operation"
                         mask="0x80"/>
               <bitfield name="SEESFULL" caption="Active SEES Full" mask="0x100"/>
               <bitfield name="SEESOVF" caption="Active SEES Overflow" mask="0x200"/>
               <bitfield name="SEEWRC" caption="SEE Write Completed" mask="0x400"/>
            </register>
            <register name="STATUS"
                      offset="0x12"
                      rw="R"
                      size="2"
                      initval="0x0000"
                      caption="Status">
               <bitfield name="READY" caption="Ready to accept a command" mask="0x1"/>
               <bitfield name="PRM" caption="Power Reduction Mode" mask="0x2"/>
               <bitfield name="LOAD" caption="NVM Page Buffer Active Loading" mask="0x4"/>
               <bitfield name="SUSP"
                         caption="NVM Write Or Erase Operation Is Suspended"
                         mask="0x8"/>
               <bitfield name="AFIRST" caption="BANKA First" mask="0x10"/>
               <bitfield name="BPDIS" caption="Boot Loader Protection Disable" mask="0x20"/>
               <bitfield name="BOOTPROT"
                         caption="Boot Loader Protection Size"
                         mask="0xF00"
                         values="NVMCTRL_STATUS__BOOTPROT"/>
            </register>
            <register name="ADDR"
                      offset="0x14"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Address">
               <bitfield name="ADDR" caption="NVM Address" mask="0xFFFFFF"/>
            </register>
