ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="TEMP_LOG_WORD_2"
                      offset="0x8"
                      size="4"
                      rw="R"
                      caption="TEMP_LOG Page Word 2">
               <bitfield name="ROOM_ADC_VAL_CTAT"
                         caption="12-bit ADC conversion at room temperature CTAT"
                         mask="0xFFF"/>
               <bitfield name="HOT_ADC_VAL_CTAT"
                         caption="12-bit ADC conversion at hot temperature CTAT"
                         mask="0xFFF000"/>
            </register>
         </register-group>
         <register-group name="USER_FUSES">
            <register name="USER_WORD_0"
                      offset="0x0"
                      size="4"
                      rw="RW"
                      caption="USER Page Word 0">
               <bitfield name="BOD33_DIS" caption="BOD33 Disable" mask="0x1"/>
               <bitfield name="BOD33USERLEVEL" caption="BOD33 User Level" mask="0x1FE"/>
               <bitfield name="BOD33_ACTION"
                         caption="BOD33 Action"
                         mask="0x600"
                         values="SUPC_BOD33__ACTION"/>
               <bitfield name="BOD33_HYST" caption="BOD33 Hysteresis" mask="0x7800"/>
               <bitfield name="NVMCTRL_BOOTPROT"
                         caption="Bootloader Size"
                         mask="0x3C000000"
                         values="NVMCTRL_STATUS__BOOTPROT"/>
            </register>
            <register name="USER_WORD_1"
                      offset="0x4"
                      size="4"
                      rw="RW"
                      caption="USER Page Word 1">
               <bitfield name="NVMCTRL_SEESBLK"
                         caption="Number Of Physical NVM Blocks Composing a SmartEEPROM Sector"
                         mask="0xF"/>
               <bitfield name="NVMCTRL_SEEPSZ"
                         caption="Size Of SmartEEPROM Page"
                         mask="0x70"/>
               <bitfield name="RAMECC_ECCDIS" caption="RAM ECC Disable fuse" mask="0x80"/>
               <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x10000"/>
               <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x20000"/>
               <bitfield name="WDT_PER"
                         caption="WDT Period"
                         mask="0x3C0000"
                         values="WDT_CONFIG__PER"/>
               <bitfield name="WDT_WINDOW"
                         caption="WDT Window"
                         mask="0x3C00000"
                         values="WDT_CONFIG__WINDOW"/>
               <bitfield name="WDT_EWOFFSET"
                         caption="WDT Early Warning Offset"
                         mask="0x3C000000"
                         values="WDT_EWCTRL__EWOFFSET"/>
               <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x40000000"/>
            </register>
            <register name="USER_WORD_2"
                      offset="0x8"
                      size="4"
                      rw="RW"
                      caption="USER Page Word 2">
               <bitfield name="NVMCTRL_REGION_LOCKS"
                         caption="NVM Region Locks"
                         mask="0xFFFFFFFF"/>
            </register>
         </register-group>
         <value-group name="SUPC_BOD33__ACTION">
            <value name="NONE" caption="No action" value="0x0"/>
            <value name="RESET" caption="The BOD33 generates a reset" value="0x1"/>
            <value name="INT" caption="The BOD33 generates an interrupt" value="0x2"/>
            <value name="BKUP"
                   caption="The BOD33 puts the device in backup sleep mode"
                   value="0x3"/>
         </value-group>
         <value-group name="NVMCTRL_STATUS__BOOTPROT">
            <value name="0" caption="0 kbytes" value="0xF"/>
            <value name="8" caption="8 kbytes" value="0xE"/>
            <value name="16" caption="16 kbytes" value="0xD"/>
            <value name="24" caption="24 kbytes" value="0xC"/>
            <value name="32" caption="32 kbytes" value="0xB"/>
            <value name="40" caption="40 kbytes" value="0xA"/>
            <value name="48" caption="48 kbytes" value="0x9"/>
            <value name="56" caption="56 kbytes" value="0x8"/>
            <value name="64" caption="64 kbytes" value="0x7"/>
            <value name="72" caption="72 kbytes" value="0x6"/>
            <value name="80" caption="80 kbytes" value="0x5"/>
            <value name="88" caption="88 kbytes" value="0x4"/>
            <value name="96" caption="96 kbytes" value="0x3"/>
            <value name="104" caption="104 kbytes" value="0x2"/>
            <value name="112" caption="112 kbytes" value="0x1"/>
            <value name="120" caption="120 kbytes" value="0x0"/>
         </value-group>
         <value-group name="WDT_CONFIG__PER">
            <value name="CYC8" caption="8 clock cycles" value="0x0"/>
            <value name="CYC16" caption="16 clock cycles" value="0x1"/>
            <value name="CYC32" caption="32 clock cycles" value="0x2"/>
            <value name="CYC64" caption="64 clock cycles" value="0x3"/>
            <value name="CYC128" caption="128 clock cycles" value="0x4"/>
            <value name="CYC256" caption="256 clock cycles" value="0x5"/>
            <value name="CYC512" caption="512 clock cycles" value="0x6"/>
            <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
            <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
            <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
            <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
            <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
         </value-group>
         <value-group name="WDT_CONFIG__WINDOW">
            <value name="CYC8" caption="8 clock cycles" value="0x0"/>
            <value name="CYC16" caption="16 clock cycles" value="0x1"/>
            <value name="CYC32" caption="32 clock cycles" value="0x2"/>
            <value name="CYC64" caption="64 clock cycles" value="0x3"/>
            <value name="CYC128" caption="128 clock cycles" value="0x4"/>
            <value name="CYC256" caption="256 clock cycles" value="0x5"/>
            <value name="CYC512" caption="512 clock cycles" value="0x6"/>
            <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
            <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
            <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
            <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
            <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
         </value-group>
