ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="DFLLVAL"
                      offset="0x24"
                      rw="RW"
                      access="RWSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="DFLL48M Value">
               <bitfield name="FINE" caption="Fine Value" mask="0xFF"/>
               <bitfield name="COARSE" caption="Coarse Value" mask="0xFC00"/>
               <bitfield name="DIFF"
                         caption="Multiplication Ratio Difference"
                         mask="0xFFFF0000"/>
            </register>
            <register name="DFLLMUL"
                      offset="0x28"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="DFLL48M Multiplier">
               <bitfield name="MUL" caption="DFLL Multiply Factor" mask="0xFFFF"/>
               <bitfield name="FSTEP" caption="Fine Maximum Step" mask="0xFF0000"/>
               <bitfield name="CSTEP" caption="Coarse Maximum Step" mask="0xFC000000"/>
            </register>
            <register name="DFLLSYNC"
                      offset="0x2C"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="DFLL48M Synchronization">
               <bitfield name="ENABLE" caption="ENABLE Synchronization Busy" mask="0x2"/>
               <bitfield name="DFLLCTRLB"
                         caption="DFLLCTRLB Synchronization Busy"
                         mask="0x4"/>
               <bitfield name="DFLLVAL" caption="DFLLVAL Synchronization Busy" mask="0x8"/>
               <bitfield name="DFLLMUL" caption="DFLLMUL Synchronization Busy" mask="0x10"/>
            </register>
            <register-group name="DPLL"
                            name-in-module="DPLL"
                            offset="0x30"
                            size="0x14"
                            count="2"/>
         </register-group>
         <value-group name="OSCCTRL_XOSCCTRL__STARTUP">
            <value name="CYCLE1" caption="31 us" value="0"/>
            <value name="CYCLE2" caption="61 us" value="1"/>
            <value name="CYCLE4" caption="122 us" value="2"/>
            <value name="CYCLE8" caption="244 us" value="3"/>
            <value name="CYCLE16" caption="488 us" value="4"/>
            <value name="CYCLE32" caption="977 us" value="5"/>
            <value name="CYCLE64" caption="1953 us" value="6"/>
            <value name="CYCLE128" caption="3906 us" value="7"/>
            <value name="CYCLE256" caption="7813 us" value="8"/>
            <value name="CYCLE512" caption="15625 us" value="9"/>
            <value name="CYCLE1024" caption="31250 us" value="10"/>
            <value name="CYCLE2048" caption="62500 us" value="11"/>
            <value name="CYCLE4096" caption="125000 us" value="12"/>
            <value name="CYCLE8192" caption="250000 us" value="13"/>
            <value name="CYCLE16384" caption="500000 us" value="14"/>
            <value name="CYCLE32768" caption="1000000 us" value="15"/>
         </value-group>
         <value-group name="OSCCTRL_XOSCCTRL__CFDPRESC">
            <value name="DIV1" caption="48 MHz" value="0"/>
            <value name="DIV2" caption="24 MHz" value="1"/>
            <value name="DIV4" caption="12 MHz" value="2"/>
            <value name="DIV8" caption="6 MHz" value="3"/>
            <value name="DIV16" caption="3 MHz" value="4"/>
            <value name="DIV32" caption="1.5 MHz" value="5"/>
            <value name="DIV64" caption="0.75 MHz" value="6"/>
            <value name="DIV128" caption="0.3125 MHz" value="7"/>
         </value-group>
         <value-group name="OSCCTRL_DPLLCTRLB__LTIME">
            <value name="DEFAULT" caption="No time-out. Automatic lock" value="0x0"/>
            <value name="800US" caption="Time-out if no lock within 800us" value="0x4"/>
            <value name="900US" caption="Time-out if no lock within 900us" value="0x5"/>
            <value name="1MS" caption="Time-out if no lock within 1ms" value="0x6"/>
            <value name="1P1MS" caption="Time-out if no lock within 1.1ms" value="0x7"/>
         </value-group>
         <value-group name="OSCCTRL_DPLLCTRLB__FILTER">
            <value name="FILTER1"
                   caption="Bandwidth = 92.7Khz and Damping Factor = 0.76"
                   value="0"/>
            <value name="FILTER2"
                   caption="Bandwidth = 131Khz and Damping Factor = 1.08"
                   value="1"/>
            <value name="FILTER3"
                   caption="Bandwidth = 46.4Khz and Damping Factor = 0.38"
                   value="2"/>
            <value name="FILTER4"
                   caption="Bandwidth = 65.6Khz and Damping Factor = 0.54"
                   value="3"/>
            <value name="FILTER5"
                   caption="Bandwidth = 131Khz and Damping Factor = 0.56"
                   value="4"/>
            <value name="FILTER6"
                   caption="Bandwidth = 185Khz and Damping Factor = 0.79"
                   value="5"/>
            <value name="FILTER7"
                   caption="Bandwidth = 65.6Khz and Damping Factor = 0.28"
                   value="6"/>
            <value name="FILTER8"
                   caption="Bandwidth = 92.7Khz and Damping Factor = 0.39"
                   value="7"/>
            <value name="FILTER9"
                   caption="Bandwidth = 46.4Khz and Damping Factor = 1.49"
                   value="8"/>
            <value name="FILTER10"
                   caption="Bandwidth = 65.6Khz and Damping Factor = 2.11"
                   value="9"/>
            <value name="FILTER11"
                   caption="Bandwidth = 23.2Khz and Damping Factor = 0.75"
                   value="10"/>
            <value name="FILTER12"
                   caption="Bandwidth = 32.8Khz and Damping Factor = 1.06"
                   value="11"/>
            <value name="FILTER13"
                   caption="Bandwidth = 65.6Khz and Damping Factor = 1.07"
                   value="12"/>
            <value name="FILTER14"
                   caption="Bandwidth = 92.7Khz and Damping Factor = 1.51"
                   value="13"/>
            <value name="FILTER15"
                   caption="Bandwidth = 32.8Khz and Damping Factor = 0.53"
                   value="14"/>
            <value name="FILTER16"
                   caption="Bandwidth = 46.4Khz and Damping Factor = 0.75"
                   value="15"/>
         </value-group>
         <value-group name="OSCCTRL_DPLLCTRLB__DCOFILTER">
            <value name="FILTER1"
                   caption="Capacitor(pF) = 0.5 and Bandwidth Fn (MHz) = 3.21"
                   value="0"/>
            <value name="FILTER2"
                   caption="Capacitor(pF) = 1 and Bandwidth Fn (MHz) = 1.6"
                   value="1"/>
            <value name="FILTER3"
                   caption="Capacitor(pF) = 1.5 and Bandwidth Fn (MHz) = 1.1"
                   value="2"/>
            <value name="FILTER4"
                   caption="Capacitor(pF) = 2 and Bandwidth Fn (MHz) = 0.8"
                   value="3"/>
            <value name="FILTER5"
                   caption="Capacitor(pF) = 2.5 and Bandwidth Fn (MHz) = 0.64"
                   value="4"/>
            <value name="FILTER6"
                   caption="Capacitor(pF) = 3 and Bandwidth Fn (MHz) = 0.55"
                   value="5"/>
            <value name="FILTER7"
                   caption="Capacitor(pF) = 3.5 and Bandwidth Fn (MHz) = 0.45"
                   value="6"/>
            <value name="FILTER8"
                   caption="Capacitor(pF) = 4 and Bandwidth Fn (MHz) = 0.4"
                   value="7"/>
         </value-group>
         <value-group name="OSCCTRL_DPLLCTRLB__REFCLK">
            <value name="GCLK" caption="Dedicated GCLK clock reference" value="0x0"/>
            <value name="XOSC32" caption="XOSC32K clock reference" value="0x1"/>
            <value name="XOSC0" caption="XOSC0 clock reference" value="0x2"/>
            <value name="XOSC1" caption="XOSC1 clock reference" value="0x3"/>
         </value-group>
      </module>
      <module name="OSC32KCTRL"
              id="U2400"
              version="1.0.0"
              caption="32kHz Oscillators Control">
         <register-group name="OSC32KCTRL" caption="32kHz Oscillators Control">
            <register name="INTENCLR"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTENCLR"
                      initval="0x00000000"
                      caption="Interrupt Enable Clear">
               <bitfield name="XOSC32KRDY"
                         caption="XOSC32K Ready Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="XOSC32KFAIL"
                         caption="XOSC32K Clock Failure Detector Interrupt Enable"
                         mask="0x4"/>
            </register>
            <register name="INTENSET"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      atomic-op="set:INTENSET"
                      initval="0x00000000"
                      caption="Interrupt Enable Set">
               <bitfield name="XOSC32KRDY"
                         caption="XOSC32K Ready Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="XOSC32KFAIL"
                         caption="XOSC32K Clock Failure Detector Interrupt Enable"
                         mask="0x4"/>
            </register>
            <register name="INTFLAG"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTFLAG"
                      initval="0x00000000"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
               <bitfield name="XOSC32KFAIL"
                         caption="XOSC32K Clock Failure Detector"
                         mask="0x4"/>
            </register>
            <register name="STATUS"
                      offset="0xC"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Power and Clocks Status">
               <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
               <bitfield name="XOSC32KFAIL"
                         caption="XOSC32K Clock Failure Detector"
                         mask="0x4"/>
               <bitfield name="XOSC32KSW" caption="XOSC32K Clock switch" mask="0x8"/>
            </register>
            <register name="RTCCTRL"
                      offset="0x10"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="RTC Clock Selection">
               <bitfield name="RTCSEL"
                         caption="RTC Clock Selection"
                         mask="0x7"
                         values="OSC32KCTRL_RTCCTRL__RTCSEL"/>
            </register>
            <register name="XOSC32K"
                      offset="0x14"
                      rw="RW"
                      size="2"
                      initval="0x2080"
                      caption="32kHz External Crystal Oscillator (XOSC32K) Control">
               <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
               <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
               <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x8"/>
               <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x10"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
               <bitfield name="STARTUP"
                         caption="Oscillator Start-Up Time"
                         mask="0x700"
                         values="OSC32KCTRL_XOSC32K__STARTUP"/>
               <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
               <bitfield name="CGM"
                         caption="Control Gain Mode"
                         mask="0x6000"
                         values="OSC32KCTRL_XOSC32K__CGM"/>
            </register>
            <register name="CFDCTRL"
                      offset="0x16"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Clock Failure Detector Control">
               <bitfield name="CFDEN" caption="Clock Failure Detector Enable" mask="0x1"/>
               <bitfield name="SWBACK" caption="Clock Switch Back" mask="0x2"/>
               <bitfield name="CFDPRESC"
                         caption="Clock Failure Detector Prescaler"
                         mask="0x4"/>
            </register>
            <register name="EVCTRL"
                      offset="0x17"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Event Control">
               <bitfield name="CFDEO"
                         caption="Clock Failure Detector Event Output Enable"
                         mask="0x1"/>
            </register>
            <register name="OSCULP32K"
                      offset="0x1C"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control">
               <bitfield name="EN32K" caption="Enable Out 32k" mask="0x2"/>
               <bitfield name="EN1K" caption="Enable Out 1k" mask="0x4"/>
               <bitfield name="WRTLOCK" caption="Write Lock" mask="0x8000"/>
            </register>
         </register-group>
         <value-group name="OSC32KCTRL_XOSC32K__STARTUP">
            <value name="CYCLE2048" caption="62.6 ms" value="0"/>
            <value name="CYCLE4096" caption="125 ms" value="1"/>
            <value name="CYCLE16384" caption="500 ms" value="2"/>
            <value name="CYCLE32768" caption="1000 ms" value="3"/>
            <value name="CYCLE65536" caption="2000 ms" value="4"/>
            <value name="CYCLE131072" caption="4000 ms" value="5"/>
            <value name="CYCLE262144" caption="8000 ms" value="6"/>
         </value-group>
         <value-group name="OSC32KCTRL_RTCCTRL__RTCSEL">
            <value name="ULP1K"
                   caption="1.024kHz from 32kHz internal ULP oscillator"
                   value="0"/>
            <value name="ULP32K"
                   caption="32.768kHz from 32kHz internal ULP oscillator"
                   value="1"/>
            <value name="XOSC1K"
                   caption="1.024kHz from 32.768kHz internal oscillator"
                   value="4"/>
            <value name="XOSC32K"
                   caption="32.768kHz from 32.768kHz external crystal oscillator"
                   value="5"/>
         </value-group>
         <value-group name="OSC32KCTRL_XOSC32K__CGM">
            <value name="XT" caption="Standard mode" value="1"/>
            <value name="HS" caption="High Speed mode" value="2"/>
         </value-group>
      </module>
