ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
      <module name="PAC"
              id="U2120"
              version="1.2.0"
              caption="Peripheral Access Controller">
         <register-group name="PAC" caption="Peripheral Access Controller">
            <register name="WRCTRL"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Write control">
               <bitfield name="PERID" caption="Peripheral identifier" mask="0xFFFF"/>
               <bitfield name="KEY"
                         caption="Peripheral access control key"
                         mask="0xFF0000"
                         values="PAC_WRCTRL__KEY"/>
            </register>
            <register name="EVCTRL"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Event control">
               <bitfield name="ERREO"
                         caption="Peripheral acess error event output"
                         mask="0x1"/>
            </register>
            <register name="INTENCLR"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt enable clear">
               <bitfield name="ERR"
                         caption="Peripheral access error interrupt disable"
                         mask="0x1"/>
            </register>
            <register name="INTENSET"
                      offset="0x9"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt enable set">
               <bitfield name="ERR"
                         caption="Peripheral access error interrupt enable"
                         mask="0x1"/>
            </register>
            <register name="INTFLAGAHB"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTFLAGAHB"
                      initval="0x00000000"
                      caption="Bridge interrupt flag status">
               <bitfield name="FLASH_" caption="FLASH" mask="0x1"/>
               <bitfield name="FLASH_ALT_" caption="FLASH_ALT" mask="0x2"/>
               <bitfield name="SEEPROM_" caption="SEEPROM" mask="0x4"/>
               <bitfield name="RAMCM4S_" caption="RAMCM4S" mask="0x8"/>
               <bitfield name="RAMPPPDSU_" caption="RAMPPPDSU" mask="0x10"/>
               <bitfield name="RAMDMAWR_" caption="RAMDMAWR" mask="0x20"/>
               <bitfield name="RAMDMACICM_" caption="RAMDMACICM" mask="0x40"/>
               <bitfield name="HPB0_" caption="HPB0" mask="0x80"/>
               <bitfield name="HPB1_" caption="HPB1" mask="0x100"/>
               <bitfield name="HPB2_" caption="HPB2" mask="0x200"/>
               <bitfield name="HPB3_" caption="HPB3" mask="0x400"/>
               <bitfield name="PUKCC_" caption="PUKCC" mask="0x800"/>
               <bitfield name="SDHC0_" caption="SDHC0" mask="0x1000"/>
               <bitfield name="QSPI_" caption="QSPI" mask="0x4000"/>
            </register>
            <register name="INTFLAGA"
                      offset="0x14"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTFLAGA"
                      initval="0x00000000"
                      caption="Peripheral interrupt flag status - Bridge A">
               <bitfield name="PAC_" caption="PAC" mask="0x1"/>
               <bitfield name="PM_" caption="PM" mask="0x2"/>
               <bitfield name="MCLK_" caption="MCLK" mask="0x4"/>
               <bitfield name="RSTC_" caption="RSTC" mask="0x8"/>
               <bitfield name="OSCCTRL_" caption="OSCCTRL" mask="0x10"/>
               <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL" mask="0x20"/>
               <bitfield name="SUPC_" caption="SUPC" mask="0x40"/>
               <bitfield name="GCLK_" caption="GCLK" mask="0x80"/>
               <bitfield name="WDT_" caption="WDT" mask="0x100"/>
               <bitfield name="RTC_" caption="RTC" mask="0x200"/>
               <bitfield name="EIC_" caption="EIC" mask="0x400"/>
               <bitfield name="FREQM_" caption="FREQM" mask="0x800"/>
               <bitfield name="SERCOM0_" caption="SERCOM0" mask="0x1000"/>
               <bitfield name="SERCOM1_" caption="SERCOM1" mask="0x2000"/>
               <bitfield name="TC0_" caption="TC0" mask="0x4000"/>
               <bitfield name="TC1_" caption="TC1" mask="0x8000"/>
            </register>
            <register name="INTFLAGB"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTFLAGB"
                      initval="0x00000000"
                      caption="Peripheral interrupt flag status - Bridge B">
               <bitfield name="USB_" caption="USB" mask="0x1"/>
               <bitfield name="DSU_" caption="DSU" mask="0x2"/>
               <bitfield name="NVMCTRL_" caption="NVMCTRL" mask="0x4"/>
               <bitfield name="CMCC_" caption="CMCC" mask="0x8"/>
               <bitfield name="PORT_" caption="PORT" mask="0x10"/>
               <bitfield name="DMAC_" caption="DMAC" mask="0x20"/>
               <bitfield name="EVSYS_" caption="EVSYS" mask="0x80"/>
               <bitfield name="SERCOM2_" caption="SERCOM2" mask="0x200"/>
               <bitfield name="SERCOM3_" caption="SERCOM3" mask="0x400"/>
               <bitfield name="TCC0_" caption="TCC0" mask="0x800"/>
               <bitfield name="TCC1_" caption="TCC1" mask="0x1000"/>
               <bitfield name="TC2_" caption="TC2" mask="0x2000"/>
               <bitfield name="TC3_" caption="TC3" mask="0x4000"/>
               <bitfield name="RAMECC_" caption="RAMECC" mask="0x10000"/>
            </register>
