ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="STATUSD"
                      offset="0x40"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Peripheral write protection status - Bridge D">
               <bitfield name="SERCOM4_" caption="SERCOM4 APB Protect Enable" mask="0x1"/>
               <bitfield name="SERCOM5_" caption="SERCOM5 APB Protect Enable" mask="0x2"/>
               <bitfield name="TCC4_" caption="TCC4 APB Protect Enable" mask="0x10"/>
               <bitfield name="ADC0_" caption="ADC0 APB Protect Enable" mask="0x80"/>
               <bitfield name="ADC1_" caption="ADC1 APB Protect Enable" mask="0x100"/>
               <bitfield name="DAC_" caption="DAC APB Protect Enable" mask="0x200"/>
               <bitfield name="I2S_" caption="I2S APB Protect Enable" mask="0x400"/>
               <bitfield name="PCC_" caption="PCC APB Protect Enable" mask="0x800"/>
            </register>
         </register-group>
         <value-group name="PAC_WRCTRL__KEY">
            <value name="OFF" caption="No action" value="0"/>
            <value name="CLR" caption="Clear protection" value="1"/>
            <value name="SET" caption="Set protection" value="2"/>
            <value name="SETLCK" caption="Set and lock protection" value="3"/>
         </value-group>
      </module>
      <module name="PCC"
              id="U2017"
              version="1.1.0"
              caption="Parallel Capture Controller">
         <register-group name="PCC" caption="Parallel Capture Controller">
            <register name="MR"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Mode Register">
               <bitfield name="PCEN" caption="Parallel Capture Enable" mask="0x1"/>
               <bitfield name="DSIZE"
                         caption="Data size"
                         mask="0x30"
                         values="PCC_MR__DSIZE"/>
               <bitfield name="SCALE" caption="Scale data" mask="0x100"/>
               <bitfield name="ALWYS" caption="Always Sampling" mask="0x200"/>
               <bitfield name="HALFS" caption="Half Sampling" mask="0x400"/>
               <bitfield name="FRSTS" caption="First sample" mask="0x800"/>
               <bitfield name="ISIZE"
                         caption="Input Data Size"
                         mask="0x70000"
                         values="PCC_MR__ISIZE"/>
               <bitfield name="CID" caption="Clear If Disabled" mask="0xC0000000"/>
            </register>
            <register name="IER"
                      offset="0x4"
                      rw="W"
                      size="4"
                      access-size="4"
                      atomic-op="set:IMR"
                      initval="0x00000000"
                      caption="Interrupt Enable Register">
               <bitfield name="DRDY" caption="Data Ready Interrupt Enable" mask="0x1"/>
               <bitfield name="OVRE" caption="Overrun Error Interrupt Enable" mask="0x2"/>
            </register>
            <register name="IDR"
                      offset="0x8"
                      rw="W"
                      size="4"
                      access-size="4"
                      atomic-op="clear:IMR"
                      initval="0x00000000"
                      caption="Interrupt Disable Register">
               <bitfield name="DRDY" caption="Data Ready Interrupt Disable" mask="0x1"/>
               <bitfield name="OVRE" caption="Overrun Error Interrupt Disable" mask="0x2"/>
            </register>
            <register name="IMR"
                      offset="0xC"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Interrupt Mask Register">
               <bitfield name="DRDY" caption="Data Ready Interrupt Mask" mask="0x1"/>
               <bitfield name="OVRE" caption="Overrun Error Interrupt Mask" mask="0x2"/>
            </register>
            <register name="ISR"
                      offset="0x10"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Interrupt Status Register">
               <bitfield name="DRDY" caption="Data Ready Interrupt Status" mask="0x1"/>
               <bitfield name="OVRE" caption="Overrun Error Interrupt Status" mask="0x2"/>
            </register>
            <register name="RHR"
                      offset="0x14"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Reception Holding Register">
               <bitfield name="RDATA" caption="Reception Data" mask="0xFFFFFFFF"/>
            </register>
            <register name="WPMR"
                      offset="0xE0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Write Protection Mode Register">
               <bitfield name="WPEN" caption="Write Protection Enable" mask="0x1"/>
               <bitfield name="WPKEY"
                         caption="Write Protection Key"
                         mask="0xFFFFFF00"
                         values="PCC_WPMR__WPKEY"/>
            </register>
            <register name="WPSR"
                      offset="0xE4"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Write Protection Status Register">
               <bitfield name="WPVS" caption="Write Protection Violation Source" mask="0x1"/>
               <bitfield name="WPVSRC"
                         caption="Write Protection Violation Status"
                         mask="0xFFFF00"/>
            </register>
         </register-group>
         <value-group name="PCC_MR__DSIZE">
            <value name="1DATA" caption="1 data is read in the PCC_RHR" value="0x0"/>
            <value name="2DATA" caption="2 data is read in the PCC_RHR" value="0x1"/>
            <value name="4DATA"
                   caption="4 data are read in the PCC_RHR (only for 8 bits data size, ISIZE = 0)"
                   value="0x2"/>
         </value-group>
         <value-group name="PCC_MR__ISIZE">
            <value name="8BITS" caption="Input data bus size is 8 bits" value="0x0"/>
            <value name="10BITS" caption="Input data bus size is 10 bits" value="0x1"/>
            <value name="12BITS" caption="Input data bus size is 12 bits" value="0x2"/>
            <value name="14BITS" caption="Input data bus size is 14 bits" value="0x3"/>
         </value-group>
         <value-group name="PCC_WPMR__WPKEY">
            <value name="PASSWD" caption="Write Protection Key" value="0x504343"/>
         </value-group>
      </module>
      <module name="PDEC"
              id="U2263"
              version="1.0.0"
              caption="Quadrature Decodeur">
         <register-group name="PDEC" caption="Quadrature Decodeur">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operation Mode"
                         mask="0xC"
                         values="PDEC_CTRLA__MODE"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="CONF"
                         caption="PDEC Configuration"
                         mask="0x700"
                         values="PDEC_CTRLA__CONF"/>
               <bitfield name="ALOCK" caption="Auto Lock" mask="0x800"/>
               <bitfield name="SWAP" caption="PDEC Phase A and B Swap" mask="0x4000"/>
               <bitfield name="PEREN" caption="Period Enable" mask="0x8000"/>
               <bitfield name="PINEN0" caption="PDEC Input From Pin 0 Enable" mask="0x10000"/>
               <bitfield name="PINEN1" caption="PDEC Input From Pin 1 Enable" mask="0x20000"/>
               <bitfield name="PINEN2" caption="PDEC Input From Pin 2 Enable" mask="0x40000"/>
               <bitfield name="PINVEN0" caption="IO Pin 0 Invert Enable" mask="0x100000"/>
               <bitfield name="PINVEN1" caption="IO Pin 1 Invert Enable" mask="0x200000"/>
               <bitfield name="PINVEN2" caption="IO Pin 2 Invert Enable" mask="0x400000"/>
               <bitfield name="ANGULAR" caption="Angular Counter Length" mask="0x7000000"/>
               <bitfield name="MAXCMP"
                         caption="Maximum Consecutive Missing Pulses"
                         mask="0xF0000000"/>
            </register>
            <register name="CTRLBCLR"
                      offset="0x4"
                      rw="RW"
                      access="RWSYNC"
                      size="1"
                      atomic-op="clear:CTRLBCLR"
                      initval="0x00"
                      caption="Control B Clear">
               <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
               <bitfield name="CMD"
                         caption="Command"
                         mask="0xE0"
                         values="PDEC_CTRLBCLR__CMD"/>
            </register>
