ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="INTENCLR"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="SLEEPRDY" caption="Sleep Mode Entry Ready Enable" mask="0x1"/>
            </register>
            <register name="INTENSET"
                      offset="0x5"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="SLEEPRDY" caption="Sleep Mode Entry Ready Enable" mask="0x1"/>
            </register>
            <register name="INTFLAG"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="SLEEPRDY" caption="Sleep Mode Entry Ready" mask="0x1"/>
            </register>
            <register name="STDBYCFG"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Standby Configuration">
               <bitfield name="RAMCFG"
                         caption="Ram Configuration"
                         mask="0x3"
                         values="PM_STDBYCFG__RAMCFG"/>
               <bitfield name="FASTWKUP"
                         caption="Fast Wakeup"
                         mask="0x30"
                         values="PM_STDBYCFG__FASTWKUP"/>
            </register>
            <register name="HIBCFG"
                      offset="0x9"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Hibernate Configuration">
               <bitfield name="RAMCFG"
                         caption="Ram Configuration"
                         mask="0x3"
                         values="PM_HIBCFG__RAMCFG"/>
               <bitfield name="BRAMCFG"
                         caption="Backup Ram Configuration"
                         mask="0xC"
                         values="PM_HIBCFG__BRAMCFG"/>
            </register>
            <register name="BKUPCFG"
                      offset="0xA"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Backup Configuration">
               <bitfield name="BRAMCFG"
                         caption="Ram Configuration"
                         mask="0x3"
                         values="PM_BKUPCFG__BRAMCFG"/>
            </register>
            <register name="PWSAKDLY"
                      offset="0x12"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Power Switch Acknowledge Delay">
               <bitfield name="DLYVAL" caption="Delay Value" mask="0x7F"/>
               <bitfield name="IGNACK" caption="Ignore Acknowledge" mask="0x80"/>
            </register>
         </register-group>
         <value-group name="PM_SLEEPCFG__SLEEPMODE">
            <value name="IDLE" caption="CPU, AHBx, and APBx clocks are OFF" value="2"/>
            <value name="STANDBY" caption="All Clocks are OFF" value="4"/>
            <value name="HIBERNATE"
                   caption="Backup domain is ON as well as some PDRAMs"
                   value="5"/>
            <value name="BACKUP" caption="Only Backup domain is powered ON" value="6"/>
            <value name="OFF" caption="All power domains are powered OFF" value="7"/>
         </value-group>
         <value-group name="PM_STDBYCFG__RAMCFG">
            <value name="RET" caption="All the system RAM is retained" value="0"/>
            <value name="PARTIAL"
                   caption="Only the first 32Kbytes of the system RAM is retained"
                   value="1"/>
            <value name="OFF" caption="All the system RAM is turned OFF" value="2"/>
         </value-group>
         <value-group name="PM_HIBCFG__RAMCFG">
            <value name="RET" caption="All the system RAM is retained" value="0"/>
            <value name="PARTIAL"
                   caption="Only the first 32Kbytes of the system RAM is retained"
                   value="1"/>
            <value name="OFF" caption="All the system RAM is turned OFF" value="2"/>
         </value-group>
         <value-group name="PM_HIBCFG__BRAMCFG">
            <value name="RET" caption="All the backup RAM is retained" value="0"/>
            <value name="PARTIAL"
                   caption="Only the first 4Kbytes of the backup RAM is retained"
                   value="1"/>
            <value name="OFF" caption="All the backup RAM is turned OFF" value="2"/>
         </value-group>
         <value-group name="PM_STDBYCFG__FASTWKUP">
            <value name="NO" caption="Fast Wakeup is disabled" value="0"/>
            <value name="NVM" caption="Fast Wakeup is enabled on NVM" value="1"/>
            <value name="MAINVREG"
                   caption="Fast Wakeup is enabled on the main voltage regulator (MAINVREG)"
                   value="2"/>
            <value name="BOTH"
                   caption="Fast Wakeup is enabled on both NVM and MAINVREG"
                   value="3"/>
         </value-group>
         <value-group name="PM_BKUPCFG__BRAMCFG">
            <value name="RET" caption="All the backup RAM is retained" value="0"/>
            <value name="PARTIAL"
                   caption="Only the first 4Kbytes of the backup RAM is retained"
                   value="1"/>
            <value name="OFF" caption="All the backup RAM is turned OFF" value="2"/>
         </value-group>
      </module>
      <module name="PORT" id="U2210" version="2.2.0" caption="Port Module">
         <register-group name="GROUP" size="0x80">
            <register name="DIR"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Data Direction">
               <bitfield name="DIR" caption="Port Data Direction" mask="0xFFFFFFFF"/>
            </register>
            <register name="DIRCLR"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      atomic-op="clear:DIR"
                      initval="0x00000000"
                      caption="Data Direction Clear">
               <bitfield name="DIRCLR" caption="Port Data Direction Clear" mask="0xFFFFFFFF"/>
            </register>
            <register name="DIRSET"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      atomic-op="set:DIR"
                      initval="0x00000000"
                      caption="Data Direction Set">
               <bitfield name="DIRSET" caption="Port Data Direction Set" mask="0xFFFFFFFF"/>
            </register>
            <register name="DIRTGL"
                      offset="0xC"
                      rw="RW"
                      size="4"
                      atomic-op="toggle:DIR"
                      initval="0x00000000"
                      caption="Data Direction Toggle">
               <bitfield name="DIRTGL"
                         caption="Port Data Direction Toggle"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="OUT"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Data Output Value">
               <bitfield name="OUT" caption="PORT Data Output Value" mask="0xFFFFFFFF"/>
            </register>
            <register name="OUTCLR"
                      offset="0x14"
                      rw="RW"
                      size="4"
                      atomic-op="clear:OUT"
                      initval="0x00000000"
                      caption="Data Output Value Clear">
               <bitfield name="OUTCLR"
                         caption="PORT Data Output Value Clear"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="OUTSET"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      atomic-op="set:OUT"
                      initval="0x00000000"
                      caption="Data Output Value Set">
               <bitfield name="OUTSET"
                         caption="PORT Data Output Value Set"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="OUTTGL"
                      offset="0x1C"
                      rw="RW"
                      size="4"
                      atomic-op="toggle:OUT"
                      initval="0x00000000"
                      caption="Data Output Value Toggle">
               <bitfield name="OUTTGL"
                         caption="PORT Data Output Value Toggle"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="IN"
                      offset="0x20"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Data Input Value">
               <bitfield name="IN" caption="PORT Data Input Value" mask="0xFFFFFFFF"/>
            </register>
