ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="CTRL"
                      offset="0x24"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Control">
               <bitfield name="SAMPLING" caption="Input Sampling Mode" mask="0xFFFFFFFF"/>
            </register>
            <register name="WRCONFIG"
                      offset="0x28"
                      rw="W"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Write Configuration">
               <bitfield name="PINMASK"
                         caption="Pin Mask for Multiple Pin Configuration"
                         mask="0xFFFF"/>
               <bitfield name="PMUXEN"
                         caption="Peripheral Multiplexer Enable"
                         mask="0x10000"/>
               <bitfield name="INEN" caption="Input Enable" mask="0x20000"/>
               <bitfield name="PULLEN" caption="Pull Enable" mask="0x40000"/>
               <bitfield name="DRVSTR"
                         caption="Output Driver Strength Selection"
                         mask="0x400000"/>
               <bitfield name="PMUX" caption="Peripheral Multiplexing" mask="0xF000000"/>
               <bitfield name="WRPMUX" caption="Write PMUX" mask="0x10000000"/>
               <bitfield name="WRPINCFG" caption="Write PINCFG" mask="0x40000000"/>
               <bitfield name="HWSEL" caption="Half-Word Select" mask="0x80000000"/>
            </register>
            <register name="EVCTRL"
                      offset="0x2C"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Event Input Control">
               <bitfield name="PID0" caption="PORT Event Pin Identifier 0" mask="0x1F"/>
               <bitfield name="EVACT0"
                         caption="PORT Event Action 0"
                         mask="0x60"
                         values="PORT_EVCTRL__EVACT0"/>
               <bitfield name="PORTEI0" caption="PORT Event Input Enable 0" mask="0x80"/>
               <bitfield name="PID1" caption="PORT Event Pin Identifier 1" mask="0x1F00"/>
               <bitfield name="EVACT1" caption="PORT Event Action 1" mask="0x6000"/>
               <bitfield name="PORTEI1" caption="PORT Event Input Enable 1" mask="0x8000"/>
               <bitfield name="PID2" caption="PORT Event Pin Identifier 2" mask="0x1F0000"/>
               <bitfield name="EVACT2" caption="PORT Event Action 2" mask="0x600000"/>
               <bitfield name="PORTEI2" caption="PORT Event Input Enable 2" mask="0x800000"/>
               <bitfield name="PID3" caption="PORT Event Pin Identifier 3" mask="0x1F000000"/>
               <bitfield name="EVACT3" caption="PORT Event Action 3" mask="0x60000000"/>
               <bitfield name="PORTEI3"
                         caption="PORT Event Input Enable 3"
                         mask="0x80000000"/>
            </register>
            <register name="PMUX"
                      offset="0x30"
                      rw="RW"
                      size="1"
                      count="16"
                      initval="0x00"
                      caption="Peripheral Multiplexing">
               <bitfield name="PMUXE"
                         caption="Peripheral Multiplexing for Even-Numbered Pin"
                         mask="0xF"
                         values="PORT_PMUX__PMUXE"/>
               <bitfield name="PMUXO"
                         caption="Peripheral Multiplexing for Odd-Numbered Pin"
                         mask="0xF0"
                         values="PORT_PMUX__PMUXO"/>
            </register>
            <register name="PINCFG"
                      offset="0x40"
                      rw="RW"
                      size="1"
                      count="32"
                      initval="0x00"
                      caption="Pin Configuration">
               <bitfield name="PMUXEN" caption="Peripheral Multiplexer Enable" mask="0x1"/>
               <bitfield name="INEN" caption="Input Enable" mask="0x2"/>
               <bitfield name="PULLEN" caption="Pull Enable" mask="0x4"/>
               <bitfield name="DRVSTR"
                         caption="Output Driver Strength Selection"
                         mask="0x40"/>
            </register>
         </register-group>
         <register-group name="PORT" caption="Port Module">
            <register-group name="GROUP"
                            name-in-module="GROUP"
                            offset="0x00"
                            size="0x80"
                            count="2"/>
         </register-group>
         <value-group name="PORT_EVCTRL__EVACT0">
            <value name="OUT" caption="Event output to pin" value="0x0"/>
            <value name="SET"
                   caption="Set output register of pin on event"
                   value="0x1"/>
            <value name="CLR"
                   caption="Clear output register of pin on event"
                   value="0x2"/>
            <value name="TGL"
                   caption="Toggle output register of pin on event"
                   value="0x3"/>
         </value-group>
         <value-group name="PORT_PMUX__PMUXE">
            <value name="A" caption="Peripheral function A selected" value="0x0"/>
            <value name="B" caption="Peripheral function B selected" value="0x1"/>
            <value name="C" caption="Peripheral function C selected" value="0x2"/>
            <value name="D" caption="Peripheral function D selected" value="0x3"/>
            <value name="E" caption="Peripheral function E selected" value="0x4"/>
            <value name="F" caption="Peripheral function F selected" value="0x5"/>
            <value name="G" caption="Peripheral function G selected" value="0x6"/>
            <value name="H" caption="Peripheral function H selected" value="0x7"/>
            <value name="I" caption="Peripheral function I selected" value="0x8"/>
            <value name="J" caption="Peripheral function J selected" value="0x9"/>
            <value name="K" caption="Peripheral function K selected" value="0xA"/>
            <value name="L" caption="Peripheral function L selected" value="0xB"/>
            <value name="M" caption="Peripheral function M selected" value="0xC"/>
            <value name="N" caption="Peripheral function N selected" value="0xD"/>
         </value-group>
