ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="INSTRFRAME"
                      offset="0x38"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Instruction Frame">
               <bitfield name="WIDTH"
                         caption="Instruction Code, Address, Option Code and Data Width"
                         mask="0x7"
                         values="QSPI_INSTRFRAME__WIDTH"/>
               <bitfield name="INSTREN" caption="Instruction Enable" mask="0x10"/>
               <bitfield name="ADDREN" caption="Address Enable" mask="0x20"/>
               <bitfield name="OPTCODEEN" caption="Option Enable" mask="0x40"/>
               <bitfield name="DATAEN" caption="Data Enable" mask="0x80"/>
               <bitfield name="OPTCODELEN"
                         caption="Option Code Length"
                         mask="0x300"
                         values="QSPI_INSTRFRAME__OPTCODELEN"/>
               <bitfield name="ADDRLEN"
                         caption="Address Length"
                         mask="0x400"
                         values="QSPI_INSTRFRAME__ADDRLEN"/>
               <bitfield name="TFRTYPE"
                         caption="Data Transfer Type"
                         mask="0x3000"
                         values="QSPI_INSTRFRAME__TFRTYPE"/>
               <bitfield name="CRMODE" caption="Continuous Read Mode" mask="0x4000"/>
               <bitfield name="DDREN" caption="Double Data Rate Enable" mask="0x8000"/>
               <bitfield name="DUMMYLEN" caption="Dummy Cycles Length" mask="0x1F0000"/>
            </register>
            <register name="SCRAMBCTRL"
                      offset="0x40"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Scrambling Mode">
               <bitfield name="ENABLE" caption="Scrambling/Unscrambling Enable" mask="0x1"/>
               <bitfield name="RANDOMDIS"
                         caption="Scrambling/Unscrambling Random Value Disable"
                         mask="0x2"/>
            </register>
            <register name="SCRAMBKEY"
                      offset="0x44"
                      rw="W"
                      size="4"
                      initval="0x00000000"
                      caption="Scrambling Key">
               <bitfield name="KEY" caption="Scrambling User Key" mask="0xFFFFFFFF"/>
            </register>
         </register-group>
         <value-group name="QSPI_CTRLB__CSMODE">
            <value name="NORELOAD"
                   caption="The chip select is deasserted if TD has not been reloaded before the end of the current transfer."
                   value="0x0"/>
            <value name="LASTXFER"
                   caption="The chip select is deasserted when the bit LASTXFER is written at 1 and the character written in TD has been transferred."
                   value="0x1"/>
            <value name="SYSTEMATICALLY"
                   caption="The chip select is deasserted systematically after each transfer."
                   value="0x2"/>
         </value-group>
         <value-group name="QSPI_CTRLB__DATALEN">
            <value name="8BITS" caption="8-bits transfer" value="0x0"/>
            <value name="9BITS" caption="9 bits transfer" value="0x1"/>
            <value name="10BITS" caption="10-bits transfer" value="0x2"/>
            <value name="11BITS" caption="11-bits transfer" value="0x3"/>
            <value name="12BITS" caption="12-bits transfer" value="0x4"/>
            <value name="13BITS" caption="13-bits transfer" value="0x5"/>
            <value name="14BITS" caption="14-bits transfer" value="0x6"/>
            <value name="15BITS" caption="15-bits transfer" value="0x7"/>
            <value name="16BITS" caption="16-bits transfer" value="0x8"/>
         </value-group>
         <value-group name="QSPI_CTRLB__MODE">
            <value name="SPI" caption="SPI operating mode" value="0"/>
            <value name="MEMORY" caption="Serial Memory operating mode" value="1"/>
         </value-group>
         <value-group name="QSPI_CTRLB__LOOPEN">
            <value name="DISABLED" caption="Local Loopback is disabled" value="0"/>
            <value name="ENABLED" caption="Local Loopback is enabled" value="1"/>
         </value-group>
         <value-group name="QSPI_INSTRFRAME__ADDRLEN">
            <value name="24BITS" caption="24-bits address length" value="0"/>
            <value name="32BITS" caption="32-bits address length" value="1"/>
         </value-group>
         <value-group name="QSPI_INSTRFRAME__OPTCODELEN">
            <value name="1BIT" caption="1-bit length option code" value="0x0"/>
            <value name="2BITS" caption="2-bits length option code" value="0x1"/>
            <value name="4BITS" caption="4-bits length option code" value="0x2"/>
            <value name="8BITS" caption="8-bits length option code" value="0x3"/>
         </value-group>
         <value-group name="QSPI_INSTRFRAME__TFRTYPE">
            <value name="READ"
                   caption="Read transfer from the serial memory.Scrambling is not performed.Read at random location (fetch) in the serial flash memory is not possible."
                   value="0x0"/>
            <value name="READMEMORY"
                   caption="Read data transfer from the serial memory.If enabled, scrambling is performed.Read at random location (fetch) in the serial flash memory is possible."
                   value="0x1"/>
            <value name="WRITE"
                   caption="Write transfer into the serial memory.Scrambling is not performed."
                   value="0x2"/>
            <value name="WRITEMEMORY"
                   caption="Write data transfer into the serial memory.If enabled, scrambling is performed."
                   value="0x3"/>
         </value-group>
         <value-group name="QSPI_INSTRFRAME__WIDTH">
            <value name="SINGLE_BIT_SPI"
                   caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Single-bit SPI"
                   value="0x0"/>
            <value name="DUAL_OUTPUT"
                   caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Dual SPI"
                   value="0x1"/>
            <value name="QUAD_OUTPUT"
                   caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Quad SPI"
                   value="0x2"/>
            <value name="DUAL_IO"
                   caption="Instruction: Single-bit SPI / Address-Option: Dual SPI / Data: Dual SPI"
                   value="0x3"/>
            <value name="QUAD_IO"
                   caption="Instruction: Single-bit SPI / Address-Option: Quad SPI / Data: Quad SPI"
                   value="0x4"/>
            <value name="DUAL_CMD"
                   caption="Instruction: Dual SPI / Address-Option: Dual SPI / Data: Dual SPI"
                   value="0x5"/>
            <value name="QUAD_CMD"
                   caption="Instruction: Quad SPI / Address-Option: Quad SPI / Data: Quad SPI"
                   value="0x6"/>
         </value-group>
      </module>
      <module name="RAMECC" id="U2268" version="1.0.0" caption="RAM ECC">
         <register-group name="RAMECC" caption="RAM ECC">
            <register name="INTENCLR"
                      offset="0x0"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="SINGLEE"
                         caption="Single Bit ECC Error Interrupt Enable Clear"
                         mask="0x1"/>
               <bitfield name="DUALE"
                         caption="Dual Bit ECC Error Interrupt Enable Clear"
                         mask="0x2"/>
            </register>
            <register name="INTENSET"
                      offset="0x1"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="SINGLEE"
                         caption="Single Bit ECC Error Interrupt Enable Set"
                         mask="0x1"/>
               <bitfield name="DUALE"
                         caption="Dual Bit ECC Error Interrupt Enable Set"
                         mask="0x2"/>
            </register>
            <register name="INTFLAG"
                      offset="0x2"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag">
               <bitfield name="SINGLEE" caption="Single Bit ECC Error Interrupt" mask="0x1"/>
               <bitfield name="DUALE" caption="Dual Bit ECC Error Interrupt" mask="0x2"/>
            </register>
            <register name="STATUS"
                      offset="0x3"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Status">
               <bitfield name="ECCDIS" caption="ECC Disable" mask="0x1"/>
            </register>
            <register name="ERRADDR"
                      offset="0x4"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Error Address">
               <bitfield name="ERRADDR" caption="Error Address" mask="0x1FFFF"/>
            </register>
            <register name="DBGCTRL"
                      offset="0xF"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Debug Control">
               <bitfield name="ECCDIS" caption="ECC Disable" mask="0x1"/>
               <bitfield name="ECCELOG" caption="ECC Error Log" mask="0x2"/>
            </register>
         </register-group>
      </module>
      <module name="RSTC"
              id="U2239"
              version="4.0.0"
              caption="Reset Controller">
         <register-group name="RSTC" caption="Reset Controller">
            <register name="RCAUSE"
                      offset="0x0"
                      rw="R"
                      size="1"
                      caption="Reset Cause">
               <bitfield name="POR" caption="Power On Reset" mask="0x1"/>
               <bitfield name="BODCORE" caption="Brown Out CORE Detector Reset" mask="0x2"/>
               <bitfield name="BODVDD" caption="Brown Out VDD Detector Reset" mask="0x4"/>
               <bitfield name="NVM" caption="NVM Reset" mask="0x8"/>
               <bitfield name="EXT" caption="External Reset" mask="0x10"/>
               <bitfield name="WDT" caption="Watchdog Reset" mask="0x20"/>
               <bitfield name="SYST" caption="System Reset Request" mask="0x40"/>
               <bitfield name="BACKUP" caption="Backup Reset" mask="0x80"/>
            </register>
            <register name="BKUPEXIT"
                      offset="0x2"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Backup Exit Source">
               <bitfield name="RTC" caption="Real Timer Counter Interrupt" mask="0x2"/>
               <bitfield name="BBPS" caption="Battery Backup Power Switch" mask="0x4"/>
               <bitfield name="HIB" caption="Hibernate" mask="0x80"/>
            </register>
         </register-group>
      </module>
