ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
      <module name="RTC"
              id="U2250"
              version="2.1.0"
              caption="Real-Time Counter">
         <register-group name="RTC" caption="Real-Time Counter">
            <mode name="MODE0"
                  qualifier="RTC.MODE0.CTRLA.MODE"
                  value="0"
                  caption="32-bit Counter with Single 32-bit Compare"/>
            <mode name="MODE1"
                  qualifier="RTC.MODE1.CTRLA.MODE"
                  value="1"
                  caption="16-bit Counter with Two 16-bit Compares"/>
            <mode name="MODE2"
                  qualifier="RTC.MODE2.CTRLA.MODE"
                  value="2"
                  caption="Clock/Calendar with Alarm"/>
            <register modes="MODE0"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="MODE0 Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0xC"
                         values="RTC_MODE0_CTRLA__MODE"/>
               <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
               <bitfield name="PRESCALER"
                         caption="Prescaler"
                         mask="0xF00"
                         values="RTC_MODE0_CTRLA__PRESCALER"/>
               <bitfield name="BKTRST"
                         caption="BKUP Registers Reset On Tamper Enable"
                         mask="0x2000"/>
               <bitfield name="GPTRST"
                         caption="GP Registers Reset On Tamper Enable"
                         mask="0x4000"/>
               <bitfield name="COUNTSYNC"
                         caption="Count Read Synchronization Enable"
                         mask="0x8000"/>
            </register>
            <register modes="MODE1"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="MODE1 Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0xC"
                         values="RTC_MODE1_CTRLA__MODE"/>
               <bitfield name="PRESCALER"
                         caption="Prescaler"
                         mask="0xF00"
                         values="RTC_MODE1_CTRLA__PRESCALER"/>
               <bitfield name="BKTRST"
                         caption="BKUP Registers Reset On Tamper Enable"
                         mask="0x2000"/>
               <bitfield name="GPTRST"
                         caption="GP Registers Reset On Tamper Enable"
                         mask="0x4000"/>
               <bitfield name="COUNTSYNC"
                         caption="Count Read Synchronization Enable"
                         mask="0x8000"/>
            </register>
            <register modes="MODE2"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="MODE2 Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0xC"
                         values="RTC_MODE2_CTRLA__MODE"/>
               <bitfield name="CLKREP" caption="Clock Representation" mask="0x40"/>
               <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
               <bitfield name="PRESCALER"
                         caption="Prescaler"
                         mask="0xF00"
                         values="RTC_MODE2_CTRLA__PRESCALER"/>
               <bitfield name="BKTRST"
                         caption="BKUP Registers Reset On Tamper Enable"
                         mask="0x2000"/>
               <bitfield name="GPTRST"
                         caption="GP Registers Reset On Tamper Enable"
                         mask="0x4000"/>
               <bitfield name="CLOCKSYNC"
                         caption="Clock Read Synchronization Enable"
                         mask="0x8000"/>
            </register>
            <register modes="MODE0"
                      name="CTRLB"
                      offset="0x2"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="MODE0 Control B">
               <bitfield name="GP0EN" caption="General Purpose 0 Enable" mask="0x1"/>
               <bitfield name="GP2EN" caption="General Purpose 2 Enable" mask="0x2"/>
               <bitfield name="DEBMAJ" caption="Debouncer Majority Enable" mask="0x10"/>
               <bitfield name="DEBASYNC" caption="Debouncer Asynchronous Enable" mask="0x20"/>
               <bitfield name="RTCOUT" caption="RTC Output Enable" mask="0x40"/>
               <bitfield name="DMAEN" caption="DMA Enable" mask="0x80"/>
               <bitfield name="DEBF"
                         caption="Debounce Freqnuency"
                         mask="0x700"
                         values="RTC_MODE0_CTRLB__DEBF"/>
               <bitfield name="ACTF"
                         caption="Active Layer Freqnuency"
                         mask="0x7000"
                         values="RTC_MODE0_CTRLB__ACTF"/>
            </register>
            <register modes="MODE1"
                      name="CTRLB"
                      offset="0x2"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="MODE1 Control B">
               <bitfield name="GP0EN" caption="General Purpose 0 Enable" mask="0x1"/>
               <bitfield name="GP2EN" caption="General Purpose 2 Enable" mask="0x2"/>
               <bitfield name="DEBMAJ" caption="Debouncer Majority Enable" mask="0x10"/>
               <bitfield name="DEBASYNC" caption="Debouncer Asynchronous Enable" mask="0x20"/>
               <bitfield name="RTCOUT" caption="RTC Output Enable" mask="0x40"/>
               <bitfield name="DMAEN" caption="DMA Enable" mask="0x80"/>
               <bitfield name="DEBF"
                         caption="Debounce Freqnuency"
                         mask="0x700"
                         values="RTC_MODE1_CTRLB__DEBF"/>
               <bitfield name="ACTF"
                         caption="Active Layer Freqnuency"
                         mask="0x7000"
                         values="RTC_MODE1_CTRLB__ACTF"/>
            </register>
            <register modes="MODE2"
                      name="CTRLB"
                      offset="0x2"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="MODE2 Control B">
               <bitfield name="GP0EN" caption="General Purpose 0 Enable" mask="0x1"/>
               <bitfield name="GP2EN" caption="General Purpose 2 Enable" mask="0x2"/>
               <bitfield name="DEBMAJ" caption="Debouncer Majority Enable" mask="0x10"/>
               <bitfield name="DEBASYNC" caption="Debouncer Asynchronous Enable" mask="0x20"/>
               <bitfield name="RTCOUT" caption="RTC Output Enable" mask="0x40"/>
               <bitfield name="DMAEN" caption="DMA Enable" mask="0x80"/>
               <bitfield name="DEBF"
                         caption="Debounce Freqnuency"
                         mask="0x700"
                         values="RTC_MODE2_CTRLB__DEBF"/>
               <bitfield name="ACTF"
                         caption="Active Layer Freqnuency"
                         mask="0x7000"
                         values="RTC_MODE2_CTRLB__ACTF"/>
            </register>
            <register modes="MODE0"
                      name="EVCTRL"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="MODE0 Event Control">
               <bitfield name="PEREO0"
                         caption="Periodic Interval 0 Event Output Enable"
                         mask="0x1"/>
               <bitfield name="PEREO1"
                         caption="Periodic Interval 1 Event Output Enable"
                         mask="0x2"/>
               <bitfield name="PEREO2"
                         caption="Periodic Interval 2 Event Output Enable"
                         mask="0x4"/>
               <bitfield name="PEREO3"
                         caption="Periodic Interval 3 Event Output Enable"
                         mask="0x8"/>
               <bitfield name="PEREO4"
                         caption="Periodic Interval 4 Event Output Enable"
                         mask="0x10"/>
               <bitfield name="PEREO5"
                         caption="Periodic Interval 5 Event Output Enable"
                         mask="0x20"/>
               <bitfield name="PEREO6"
                         caption="Periodic Interval 6 Event Output Enable"
                         mask="0x40"/>
               <bitfield name="PEREO7"
                         caption="Periodic Interval 7 Event Output Enable"
                         mask="0x80"/>
               <bitfield name="CMPEO0" caption="Compare 0 Event Output Enable" mask="0x100"/>
               <bitfield name="CMPEO1" caption="Compare 1 Event Output Enable" mask="0x200"/>
               <bitfield name="TAMPEREO" caption="Tamper Event Output Enable" mask="0x4000"/>
               <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
               <bitfield name="TAMPEVEI" caption="Tamper Event Input Enable" mask="0x10000"/>
            </register>
            <register modes="MODE1"
                      name="EVCTRL"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="MODE1 Event Control">
               <bitfield name="PEREO0"
                         caption="Periodic Interval 0 Event Output Enable"
                         mask="0x1"/>
               <bitfield name="PEREO1"
                         caption="Periodic Interval 1 Event Output Enable"
                         mask="0x2"/>
               <bitfield name="PEREO2"
                         caption="Periodic Interval 2 Event Output Enable"
                         mask="0x4"/>
               <bitfield name="PEREO3"
                         caption="Periodic Interval 3 Event Output Enable"
                         mask="0x8"/>
               <bitfield name="PEREO4"
                         caption="Periodic Interval 4 Event Output Enable"
                         mask="0x10"/>
               <bitfield name="PEREO5"
                         caption="Periodic Interval 5 Event Output Enable"
                         mask="0x20"/>
               <bitfield name="PEREO6"
                         caption="Periodic Interval 6 Event Output Enable"
                         mask="0x40"/>
               <bitfield name="PEREO7"
                         caption="Periodic Interval 7 Event Output Enable"
                         mask="0x80"/>
               <bitfield name="CMPEO0" caption="Compare 0 Event Output Enable" mask="0x100"/>
               <bitfield name="CMPEO1" caption="Compare 1 Event Output Enable" mask="0x200"/>
               <bitfield name="CMPEO2" caption="Compare 2 Event Output Enable" mask="0x400"/>
               <bitfield name="CMPEO3" caption="Compare 3 Event Output Enable" mask="0x800"/>
               <bitfield name="TAMPEREO" caption="Tamper Event Output Enable" mask="0x4000"/>
               <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
               <bitfield name="TAMPEVEI" caption="Tamper Event Input Enable" mask="0x10000"/>
            </register>
            <register modes="MODE2"
                      name="EVCTRL"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="MODE2 Event Control">
               <bitfield name="PEREO0"
                         caption="Periodic Interval 0 Event Output Enable"
                         mask="0x1"/>
               <bitfield name="PEREO1"
                         caption="Periodic Interval 1 Event Output Enable"
                         mask="0x2"/>
               <bitfield name="PEREO2"
                         caption="Periodic Interval 2 Event Output Enable"
                         mask="0x4"/>
               <bitfield name="PEREO3"
                         caption="Periodic Interval 3 Event Output Enable"
                         mask="0x8"/>
               <bitfield name="PEREO4"
                         caption="Periodic Interval 4 Event Output Enable"
                         mask="0x10"/>
               <bitfield name="PEREO5"
                         caption="Periodic Interval 5 Event Output Enable"
                         mask="0x20"/>
               <bitfield name="PEREO6"
                         caption="Periodic Interval 6 Event Output Enable"
                         mask="0x40"/>
               <bitfield name="PEREO7"
                         caption="Periodic Interval 7 Event Output Enable"
                         mask="0x80"/>
               <bitfield name="ALARMEO0" caption="Alarm 0 Event Output Enable" mask="0x100"/>
               <bitfield name="ALARMEO1" caption="Alarm 1 Event Output Enable" mask="0x200"/>
               <bitfield name="TAMPEREO" caption="Tamper Event Output Enable" mask="0x4000"/>
               <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
               <bitfield name="TAMPEVEI" caption="Tamper Event Input Enable" mask="0x10000"/>
            </register>
            <register modes="MODE0"
                      name="INTENCLR"
                      offset="0x8"
                      rw="RW"
                      size="2"
                      atomic-op="clear:INTENCLR"
                      initval="0x0000"
                      caption="MODE0 Interrupt Enable Clear">
               <bitfield name="PER0"
                         caption="Periodic Interval 0 Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="PER1"
                         caption="Periodic Interval 1 Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="PER2"
                         caption="Periodic Interval 2 Interrupt Enable"
                         mask="0x4"/>
               <bitfield name="PER3"
                         caption="Periodic Interval 3 Interrupt Enable"
                         mask="0x8"/>
               <bitfield name="PER4"
                         caption="Periodic Interval 4 Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="PER5"
                         caption="Periodic Interval 5 Interrupt Enable"
                         mask="0x20"/>
               <bitfield name="PER6"
                         caption="Periodic Interval 6 Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="PER7"
                         caption="Periodic Interval 7 Interrupt Enable"
                         mask="0x80"/>
               <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x100"/>
               <bitfield name="CMP1" caption="Compare 1 Interrupt Enable" mask="0x200"/>
               <bitfield name="TAMPER" caption="Tamper Enable" mask="0x4000"/>
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
            </register>
            <register modes="MODE1"
                      name="INTENCLR"
                      offset="0x8"
                      rw="RW"
                      size="2"
                      atomic-op="clear:INTENCLR"
                      initval="0x0000"
                      caption="MODE1 Interrupt Enable Clear">
               <bitfield name="PER0"
                         caption="Periodic Interval 0 Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="PER1"
                         caption="Periodic Interval 1 Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="PER2"
                         caption="Periodic Interval 2 Interrupt Enable"
                         mask="0x4"/>
               <bitfield name="PER3"
                         caption="Periodic Interval 3 Interrupt Enable"
                         mask="0x8"/>
               <bitfield name="PER4"
                         caption="Periodic Interval 4 Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="PER5"
                         caption="Periodic Interval 5 Interrupt Enable"
                         mask="0x20"/>
               <bitfield name="PER6"
                         caption="Periodic Interval 6 Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="PER7"
                         caption="Periodic Interval 7 Interrupt Enable"
                         mask="0x80"/>
               <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x100"/>
               <bitfield name="CMP1" caption="Compare 1 Interrupt Enable" mask="0x200"/>
               <bitfield name="CMP2" caption="Compare 2 Interrupt Enable" mask="0x400"/>
               <bitfield name="CMP3" caption="Compare 3 Interrupt Enable" mask="0x800"/>
               <bitfield name="TAMPER" caption="Tamper Enable" mask="0x4000"/>
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
            </register>
            <register modes="MODE2"
                      name="INTENCLR"
                      offset="0x8"
                      rw="RW"
                      size="2"
                      atomic-op="clear:INTENCLR"
                      initval="0x0000"
                      caption="MODE2 Interrupt Enable Clear">
               <bitfield name="PER0"
                         caption="Periodic Interval 0 Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="PER1"
                         caption="Periodic Interval 1 Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="PER2"
                         caption="Periodic Interval 2 Interrupt Enable"
                         mask="0x4"/>
               <bitfield name="PER3"
                         caption="Periodic Interval 3 Interrupt Enable"
                         mask="0x8"/>
               <bitfield name="PER4"
                         caption="Periodic Interval 4 Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="PER5"
                         caption="Periodic Interval 5 Interrupt Enable"
                         mask="0x20"/>
               <bitfield name="PER6"
                         caption="Periodic Interval 6 Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="PER7"
                         caption="Periodic Interval 7 Interrupt Enable"
                         mask="0x80"/>
               <bitfield name="ALARM0" caption="Alarm 0 Interrupt Enable" mask="0x100"/>
               <bitfield name="ALARM1" caption="Alarm 1 Interrupt Enable" mask="0x200"/>
               <bitfield name="TAMPER" caption="Tamper Enable" mask="0x4000"/>
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
            </register>
            <register modes="MODE0"
                      name="INTENSET"
                      offset="0xA"
                      rw="RW"
                      size="2"
                      atomic-op="set:INTENSET"
                      initval="0x0000"
                      caption="MODE0 Interrupt Enable Set">
               <bitfield name="PER0"
                         caption="Periodic Interval 0 Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="PER1"
                         caption="Periodic Interval 1 Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="PER2"
                         caption="Periodic Interval 2 Interrupt Enable"
                         mask="0x4"/>
               <bitfield name="PER3"
                         caption="Periodic Interval 3 Interrupt Enable"
                         mask="0x8"/>
               <bitfield name="PER4"
                         caption="Periodic Interval 4 Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="PER5"
                         caption="Periodic Interval 5 Interrupt Enable"
                         mask="0x20"/>
               <bitfield name="PER6"
                         caption="Periodic Interval 6 Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="PER7"
                         caption="Periodic Interval 7 Interrupt Enable"
                         mask="0x80"/>
               <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x100"/>
               <bitfield name="CMP1" caption="Compare 1 Interrupt Enable" mask="0x200"/>
               <bitfield name="TAMPER" caption="Tamper Enable" mask="0x4000"/>
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
            </register>
