ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register modes="MODE1"
                      name="INTENSET"
                      offset="0xA"
                      rw="RW"
                      size="2"
                      atomic-op="set:INTENSET"
                      initval="0x0000"
                      caption="MODE1 Interrupt Enable Set">
               <bitfield name="PER0"
                         caption="Periodic Interval 0 Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="PER1"
                         caption="Periodic Interval 1 Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="PER2"
                         caption="Periodic Interval 2 Interrupt Enable"
                         mask="0x4"/>
               <bitfield name="PER3"
                         caption="Periodic Interval 3 Interrupt Enable"
                         mask="0x8"/>
               <bitfield name="PER4"
                         caption="Periodic Interval 4 Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="PER5"
                         caption="Periodic Interval 5 Interrupt Enable"
                         mask="0x20"/>
               <bitfield name="PER6"
                         caption="Periodic Interval 6 Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="PER7"
                         caption="Periodic Interval 7 Interrupt Enable"
                         mask="0x80"/>
               <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x100"/>
               <bitfield name="CMP1" caption="Compare 1 Interrupt Enable" mask="0x200"/>
               <bitfield name="CMP2" caption="Compare 2 Interrupt Enable" mask="0x400"/>
               <bitfield name="CMP3" caption="Compare 3 Interrupt Enable" mask="0x800"/>
               <bitfield name="TAMPER" caption="Tamper Enable" mask="0x4000"/>
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
            </register>
            <register modes="MODE2"
                      name="INTENSET"
                      offset="0xA"
                      rw="RW"
                      size="2"
                      atomic-op="set:INTENSET"
                      initval="0x0000"
                      caption="MODE2 Interrupt Enable Set">
               <bitfield name="PER0" caption="Periodic Interval 0 Enable" mask="0x1"/>
               <bitfield name="PER1" caption="Periodic Interval 1 Enable" mask="0x2"/>
               <bitfield name="PER2" caption="Periodic Interval 2 Enable" mask="0x4"/>
               <bitfield name="PER3" caption="Periodic Interval 3 Enable" mask="0x8"/>
               <bitfield name="PER4" caption="Periodic Interval 4 Enable" mask="0x10"/>
               <bitfield name="PER5" caption="Periodic Interval 5 Enable" mask="0x20"/>
               <bitfield name="PER6" caption="Periodic Interval 6 Enable" mask="0x40"/>
               <bitfield name="PER7" caption="Periodic Interval 7 Enable" mask="0x80"/>
               <bitfield name="ALARM0" caption="Alarm 0 Interrupt Enable" mask="0x100"/>
               <bitfield name="ALARM1" caption="Alarm 1 Interrupt Enable" mask="0x200"/>
               <bitfield name="TAMPER" caption="Tamper Enable" mask="0x4000"/>
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
            </register>
            <register modes="MODE0"
                      name="INTFLAG"
                      offset="0xC"
                      rw="RW"
                      size="2"
                      atomic-op="clear:INTFLAG"
                      initval="0x0000"
                      caption="MODE0 Interrupt Flag Status and Clear">
               <bitfield name="PER0" caption="Periodic Interval 0" mask="0x1"/>
               <bitfield name="PER1" caption="Periodic Interval 1" mask="0x2"/>
               <bitfield name="PER2" caption="Periodic Interval 2" mask="0x4"/>
               <bitfield name="PER3" caption="Periodic Interval 3" mask="0x8"/>
               <bitfield name="PER4" caption="Periodic Interval 4" mask="0x10"/>
               <bitfield name="PER5" caption="Periodic Interval 5" mask="0x20"/>
               <bitfield name="PER6" caption="Periodic Interval 6" mask="0x40"/>
               <bitfield name="PER7" caption="Periodic Interval 7" mask="0x80"/>
               <bitfield name="CMP0" caption="Compare 0" mask="0x100"/>
               <bitfield name="CMP1" caption="Compare 1" mask="0x200"/>
               <bitfield name="TAMPER" caption="Tamper" mask="0x4000"/>
               <bitfield name="OVF" caption="Overflow" mask="0x8000"/>
            </register>
            <register modes="MODE1"
                      name="INTFLAG"
                      offset="0xC"
                      rw="RW"
                      size="2"
                      atomic-op="clear:INTFLAG"
                      initval="0x0000"
                      caption="MODE1 Interrupt Flag Status and Clear">
               <bitfield name="PER0" caption="Periodic Interval 0" mask="0x1"/>
               <bitfield name="PER1" caption="Periodic Interval 1" mask="0x2"/>
               <bitfield name="PER2" caption="Periodic Interval 2" mask="0x4"/>
               <bitfield name="PER3" caption="Periodic Interval 3" mask="0x8"/>
               <bitfield name="PER4" caption="Periodic Interval 4" mask="0x10"/>
               <bitfield name="PER5" caption="Periodic Interval 5" mask="0x20"/>
               <bitfield name="PER6" caption="Periodic Interval 6" mask="0x40"/>
               <bitfield name="PER7" caption="Periodic Interval 7" mask="0x80"/>
               <bitfield name="CMP0" caption="Compare 0" mask="0x100"/>
               <bitfield name="CMP1" caption="Compare 1" mask="0x200"/>
               <bitfield name="CMP2" caption="Compare 2" mask="0x400"/>
               <bitfield name="CMP3" caption="Compare 3" mask="0x800"/>
               <bitfield name="TAMPER" caption="Tamper" mask="0x4000"/>
               <bitfield name="OVF" caption="Overflow" mask="0x8000"/>
            </register>
            <register modes="MODE2"
                      name="INTFLAG"
                      offset="0xC"
                      rw="RW"
                      size="2"
                      atomic-op="clear:INTFLAG"
                      initval="0x0000"
                      caption="MODE2 Interrupt Flag Status and Clear">
               <bitfield name="PER0" caption="Periodic Interval 0" mask="0x1"/>
               <bitfield name="PER1" caption="Periodic Interval 1" mask="0x2"/>
               <bitfield name="PER2" caption="Periodic Interval 2" mask="0x4"/>
               <bitfield name="PER3" caption="Periodic Interval 3" mask="0x8"/>
               <bitfield name="PER4" caption="Periodic Interval 4" mask="0x10"/>
               <bitfield name="PER5" caption="Periodic Interval 5" mask="0x20"/>
               <bitfield name="PER6" caption="Periodic Interval 6" mask="0x40"/>
               <bitfield name="PER7" caption="Periodic Interval 7" mask="0x80"/>
               <bitfield name="ALARM0" caption="Alarm 0" mask="0x100"/>
               <bitfield name="ALARM1" caption="Alarm 1" mask="0x200"/>
               <bitfield name="TAMPER" caption="Tamper" mask="0x4000"/>
               <bitfield name="OVF" caption="Overflow" mask="0x8000"/>
            </register>
            <register name="DBGCTRL"
                      offset="0xE"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Debug Control">
               <bitfield name="DBGRUN" caption="Run During Debug" mask="0x1"/>
            </register>
            <register modes="MODE0"
                      name="SYNCBUSY"
                      offset="0x10"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="MODE0 Synchronization Busy Status">
               <bitfield name="SWRST" caption="Software Reset Busy" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable Bit Busy" mask="0x2"/>
               <bitfield name="FREQCORR" caption="FREQCORR Register Busy" mask="0x4"/>
               <bitfield name="COUNT" caption="COUNT Register Busy" mask="0x8"/>
               <bitfield name="COMP0" caption="COMP 0 Register Busy" mask="0x20"/>
               <bitfield name="COMP1" caption="COMP 1 Register Busy" mask="0x40"/>
               <bitfield name="COUNTSYNC"
                         caption="Count Synchronization Enable Bit Busy"
                         mask="0x8000"/>
               <bitfield name="GP0" caption="General Purpose 0 Register Busy" mask="0x10000"/>
               <bitfield name="GP1" caption="General Purpose 1 Register Busy" mask="0x20000"/>
               <bitfield name="GP2" caption="General Purpose 2 Register Busy" mask="0x40000"/>
               <bitfield name="GP3" caption="General Purpose 3 Register Busy" mask="0x80000"/>
            </register>
            <register modes="MODE1"
                      name="SYNCBUSY"
                      offset="0x10"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="MODE1 Synchronization Busy Status">
               <bitfield name="SWRST" caption="Software Reset Bit Busy" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable Bit Busy" mask="0x2"/>
               <bitfield name="FREQCORR" caption="FREQCORR Register Busy" mask="0x4"/>
               <bitfield name="COUNT" caption="COUNT Register Busy" mask="0x8"/>
               <bitfield name="PER" caption="PER Register Busy" mask="0x10"/>
               <bitfield name="COMP0" caption="COMP 0 Register Busy" mask="0x20"/>
               <bitfield name="COMP1" caption="COMP 1 Register Busy" mask="0x40"/>
               <bitfield name="COMP2" caption="COMP 2 Register Busy" mask="0x80"/>
               <bitfield name="COMP3" caption="COMP 3 Register Busy" mask="0x100"/>
               <bitfield name="COUNTSYNC"
                         caption="Count Synchronization Enable Bit Busy"
                         mask="0x8000"/>
               <bitfield name="GP0" caption="General Purpose 0 Register Busy" mask="0x10000"/>
               <bitfield name="GP1" caption="General Purpose 1 Register Busy" mask="0x20000"/>
               <bitfield name="GP2" caption="General Purpose 2 Register Busy" mask="0x40000"/>
               <bitfield name="GP3" caption="General Purpose 3 Register Busy" mask="0x80000"/>
            </register>
            <register modes="MODE2"
                      name="SYNCBUSY"
                      offset="0x10"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="MODE2 Synchronization Busy Status">
               <bitfield name="SWRST" caption="Software Reset Bit Busy" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable Bit Busy" mask="0x2"/>
               <bitfield name="FREQCORR" caption="FREQCORR Register Busy" mask="0x4"/>
               <bitfield name="CLOCK" caption="CLOCK Register Busy" mask="0x8"/>
               <bitfield name="ALARM0" caption="ALARM 0 Register Busy" mask="0x20"/>
               <bitfield name="ALARM1" caption="ALARM 1 Register Busy" mask="0x40"/>
               <bitfield name="MASK0" caption="MASK 0 Register Busy" mask="0x800"/>
               <bitfield name="MASK1" caption="MASK 1 Register Busy" mask="0x1000"/>
               <bitfield name="CLOCKSYNC"
                         caption="Clock Synchronization Enable Bit Busy"
                         mask="0x8000"/>
               <bitfield name="GP0" caption="General Purpose 0 Register Busy" mask="0x10000"/>
               <bitfield name="GP1" caption="General Purpose 1 Register Busy" mask="0x20000"/>
               <bitfield name="GP2" caption="General Purpose 2 Register Busy" mask="0x40000"/>
               <bitfield name="GP3" caption="General Purpose 3 Register Busy" mask="0x80000"/>
            </register>
            <register name="FREQCORR"
                      offset="0x14"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Frequency Correction">
               <bitfield name="VALUE" caption="Correction Value" mask="0x7F"/>
               <bitfield name="SIGN" caption="Correction Sign" mask="0x80"/>
            </register>
            <register modes="MODE0"
                      name="COUNT"
                      offset="0x18"
                      rw="RW"
                      access="RSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="MODE0 Counter Value">
               <bitfield name="COUNT" caption="Counter Value" mask="0xFFFFFFFF"/>
            </register>
            <register modes="MODE1"
                      name="COUNT"
                      offset="0x18"
                      rw="RW"
                      access="RSYNC"
                      size="2"
                      initval="0x0000"
                      caption="MODE1 Counter Value">
               <bitfield name="COUNT" caption="Counter Value" mask="0xFFFF"/>
            </register>
            <register modes="MODE2"
                      name="CLOCK"
                      offset="0x18"
                      rw="RW"
                      access="RSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="MODE2 Clock Value">
               <bitfield name="SECOND" caption="Second" mask="0x3F"/>
               <bitfield name="MINUTE" caption="Minute" mask="0xFC0"/>
               <bitfield name="HOUR"
                         caption="Hour"
                         mask="0x1F000"
                         values="RTC_MODE2_CLOCK__HOUR"/>
               <bitfield name="DAY" caption="Day" mask="0x3E0000"/>
               <bitfield name="MONTH" caption="Month" mask="0x3C00000"/>
               <bitfield name="YEAR" caption="Year" mask="0xFC000000"/>
            </register>
            <register modes="MODE1"
                      name="PER"
                      offset="0x1C"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="MODE1 Counter Period">
               <bitfield name="PER" caption="Counter Period" mask="0xFFFF"/>
            </register>
            <register modes="MODE0"
                      name="COMP"
                      offset="0x20"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      count="2"
                      initval="0x00000000"
                      caption="MODE0 Compare n Value">
               <bitfield name="COMP" caption="Compare Value" mask="0xFFFFFFFF"/>
            </register>
            <register modes="MODE1"
                      name="COMP"
                      offset="0x20"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      count="4"
                      initval="0x0000"
                      caption="MODE1 Compare n Value">
               <bitfield name="COMP" caption="Compare Value" mask="0xFFFF"/>
            </register>
            <register name="GP"
                      offset="0x40"
                      rw="RW"
                      size="4"
                      count="4"
                      initval="0x00000000"
                      caption="General Purpose">
               <bitfield name="GP" caption="General Purpose" mask="0xFFFFFFFF"/>
            </register>
            <register modes="MODE2"
                      name="ALARM0"
                      offset="0x20"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="MODE2_ALARM Alarm n Value">
               <bitfield name="SECOND" caption="Second" mask="0x3F"/>
               <bitfield name="MINUTE" caption="Minute" mask="0xFC0"/>
               <bitfield name="HOUR"
                         caption="Hour"
                         mask="0x1F000"
                         values="RTC_MODE2_ALARM_ALARM__HOUR"/>
               <bitfield name="DAY" caption="Day" mask="0x3E0000"/>
               <bitfield name="MONTH" caption="Month" mask="0x3C00000"/>
               <bitfield name="YEAR" caption="Year" mask="0xFC000000"/>
            </register>
            <register modes="MODE2"
                      name="MASK0"
                      offset="0x24"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="MODE2_ALARM Alarm n Mask">
               <bitfield name="SEL"
                         caption="Alarm Mask Selection"
                         mask="0x7"
                         values="RTC_MODE2_ALARM_MASK__SEL"/>
            </register>
            <register modes="MODE2"
                      name="ALARM1"
                      offset="0x28"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="MODE2_ALARM Alarm n Value">
               <bitfield name="SECOND" caption="Second" mask="0x3F"/>
               <bitfield name="MINUTE" caption="Minute" mask="0xFC0"/>
               <bitfield name="HOUR"
                         caption="Hour"
                         mask="0x1F000"
                         values="RTC_MODE2_ALARM_ALARM__HOUR"/>
               <bitfield name="DAY" caption="Day" mask="0x3E0000"/>
               <bitfield name="MONTH" caption="Month" mask="0x3C00000"/>
               <bitfield name="YEAR" caption="Year" mask="0xFC000000"/>
            </register>
            <register modes="MODE2"
                      name="MASK1"
                      offset="0x2C"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="MODE2_ALARM Alarm n Mask">
               <bitfield name="SEL"
                         caption="Alarm Mask Selection"
                         mask="0x7"
                         values="RTC_MODE2_ALARM_MASK__SEL"/>
            </register>
            <register name="TAMPCTRL"
                      offset="0x60"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Tamper Control">
               <bitfield name="IN0ACT"
                         caption="Tamper Input 0 Action"
                         mask="0x3"
                         values="RTC_TAMPCTRL__IN0ACT"/>
               <bitfield name="IN1ACT"
                         caption="Tamper Input 1 Action"
                         mask="0xC"
                         values="RTC_TAMPCTRL__IN1ACT"/>
               <bitfield name="IN2ACT"
                         caption="Tamper Input 2 Action"
                         mask="0x30"
                         values="RTC_TAMPCTRL__IN2ACT"/>
               <bitfield name="IN3ACT"
                         caption="Tamper Input 3 Action"
                         mask="0xC0"
                         values="RTC_TAMPCTRL__IN3ACT"/>
               <bitfield name="IN4ACT"
                         caption="Tamper Input 4 Action"
                         mask="0x300"
                         values="RTC_TAMPCTRL__IN4ACT"/>
               <bitfield name="TAMLVL0" caption="Tamper Level Select 0" mask="0x10000"/>
               <bitfield name="TAMLVL1" caption="Tamper Level Select 1" mask="0x20000"/>
               <bitfield name="TAMLVL2" caption="Tamper Level Select 2" mask="0x40000"/>
               <bitfield name="TAMLVL3" caption="Tamper Level Select 3" mask="0x80000"/>
               <bitfield name="TAMLVL4" caption="Tamper Level Select 4" mask="0x100000"/>
               <bitfield name="DEBNC0" caption="Debouncer Enable 0" mask="0x1000000"/>
               <bitfield name="DEBNC1" caption="Debouncer Enable 1" mask="0x2000000"/>
               <bitfield name="DEBNC2" caption="Debouncer Enable 2" mask="0x4000000"/>
               <bitfield name="DEBNC3" caption="Debouncer Enable 3" mask="0x8000000"/>
               <bitfield name="DEBNC4" caption="Debouncer Enable 4" mask="0x10000000"/>
            </register>
            <register modes="MODE0"
                      name="TIMESTAMP"
                      offset="0x64"
                      rw="R"
                      access="RSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="MODE0 Timestamp">
               <bitfield name="COUNT" caption="Count Timestamp Value" mask="0xFFFFFFFF"/>
            </register>
            <register modes="MODE1"
                      name="TIMESTAMP"
                      offset="0x64"
                      rw="R"
                      access="RSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="MODE1 Timestamp">
               <bitfield name="COUNT" caption="Count Timestamp Value" mask="0xFFFF"/>
            </register>
            <register modes="MODE2"
                      name="TIMESTAMP"
                      offset="0x64"
                      rw="R"
                      access="RSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="MODE2 Timestamp">
               <bitfield name="SECOND" caption="Second Timestamp Value" mask="0x3F"/>
               <bitfield name="MINUTE" caption="Minute Timestamp Value" mask="0xFC0"/>
               <bitfield name="HOUR"
                         caption="Hour Timestamp Value"
                         mask="0x1F000"
                         values="RTC_MODE2_TIMESTAMP__HOUR"/>
               <bitfield name="DAY" caption="Day Timestamp Value" mask="0x3E0000"/>
               <bitfield name="MONTH" caption="Month Timestamp Value" mask="0x3C00000"/>
               <bitfield name="YEAR" caption="Year Timestamp Value" mask="0xFC000000"/>
            </register>
