ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="TAMPID"
                      offset="0x68"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Tamper ID">
               <bitfield name="TAMPID0" caption="Tamper Input 0 Detected" mask="0x1"/>
               <bitfield name="TAMPID1" caption="Tamper Input 1 Detected" mask="0x2"/>
               <bitfield name="TAMPID2" caption="Tamper Input 2 Detected" mask="0x4"/>
               <bitfield name="TAMPID3" caption="Tamper Input 3 Detected" mask="0x8"/>
               <bitfield name="TAMPID4" caption="Tamper Input 4 Detected" mask="0x10"/>
               <bitfield name="TAMPEVT" caption="Tamper Event Detected" mask="0x80000000"/>
            </register>
            <register name="BKUP"
                      offset="0x80"
                      rw="RW"
                      size="4"
                      count="8"
                      initval="0x00000000"
                      caption="Backup">
               <bitfield name="BKUP" caption="Backup" mask="0xFFFFFFFF"/>
            </register>
         </register-group>
         <value-group name="RTC_MODE0_CTRLA__MODE">
            <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0x0"/>
            <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="0x1"/>
            <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="0x2"/>
         </value-group>
         <value-group name="RTC_MODE0_CTRLA__PRESCALER">
            <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
            <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x1"/>
            <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x2"/>
            <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x3"/>
            <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x4"/>
            <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x5"/>
            <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x6"/>
            <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x7"/>
            <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x8"/>
            <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x9"/>
            <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
            <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
         </value-group>
         <value-group name="RTC_MODE1_CTRLA__MODE">
            <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0"/>
            <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="1"/>
            <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="2"/>
         </value-group>
         <value-group name="RTC_MODE1_CTRLA__PRESCALER">
            <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
            <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x1"/>
            <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x2"/>
            <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x3"/>
            <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x4"/>
            <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x5"/>
            <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x6"/>
            <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x7"/>
            <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x8"/>
            <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x9"/>
            <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
            <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
         </value-group>
         <value-group name="RTC_MODE2_CTRLA__MODE">
            <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0"/>
            <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="1"/>
            <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="2"/>
         </value-group>
         <value-group name="RTC_MODE2_CTRLA__PRESCALER">
            <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
            <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x1"/>
            <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x2"/>
            <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x3"/>
            <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x4"/>
            <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x5"/>
            <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x6"/>
            <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x7"/>
            <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x8"/>
            <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x9"/>
            <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
            <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
         </value-group>
         <value-group name="RTC_MODE0_CTRLB__ACTF">
            <value name="DIV2" caption="CLK_RTC_OUT = CLK_RTC/2" value="0x0"/>
            <value name="DIV4" caption="CLK_RTC_OUT = CLK_RTC/4" value="0x1"/>
            <value name="DIV8" caption="CLK_RTC_OUT = CLK_RTC/8" value="0x2"/>
            <value name="DIV16" caption="CLK_RTC_OUT = CLK_RTC/16" value="0x3"/>
            <value name="DIV32" caption="CLK_RTC_OUT = CLK_RTC/32" value="0x4"/>
            <value name="DIV64" caption="CLK_RTC_OUT = CLK_RTC/64" value="0x5"/>
            <value name="DIV128" caption="CLK_RTC_OUT = CLK_RTC/128" value="0x6"/>
            <value name="DIV256" caption="CLK_RTC_OUT = CLK_RTC/256" value="0x7"/>
         </value-group>
         <value-group name="RTC_MODE0_CTRLB__DEBF">
            <value name="DIV2" caption="CLK_RTC_DEB = CLK_RTC/2" value="0x0"/>
            <value name="DIV4" caption="CLK_RTC_DEB = CLK_RTC/4" value="0x1"/>
            <value name="DIV8" caption="CLK_RTC_DEB = CLK_RTC/8" value="0x2"/>
            <value name="DIV16" caption="CLK_RTC_DEB = CLK_RTC/16" value="0x3"/>
            <value name="DIV32" caption="CLK_RTC_DEB = CLK_RTC/32" value="0x4"/>
            <value name="DIV64" caption="CLK_RTC_DEB = CLK_RTC/64" value="0x5"/>
            <value name="DIV128" caption="CLK_RTC_DEB = CLK_RTC/128" value="0x6"/>
            <value name="DIV256" caption="CLK_RTC_DEB = CLK_RTC/256" value="0x7"/>
         </value-group>
         <value-group name="RTC_MODE1_CTRLB__ACTF">
            <value name="DIV2" caption="CLK_RTC_OUT = CLK_RTC/2" value="0x0"/>
            <value name="DIV4" caption="CLK_RTC_OUT = CLK_RTC/4" value="0x1"/>
            <value name="DIV8" caption="CLK_RTC_OUT = CLK_RTC/8" value="0x2"/>
            <value name="DIV16" caption="CLK_RTC_OUT = CLK_RTC/16" value="0x3"/>
            <value name="DIV32" caption="CLK_RTC_OUT = CLK_RTC/32" value="0x4"/>
            <value name="DIV64" caption="CLK_RTC_OUT = CLK_RTC/64" value="0x5"/>
            <value name="DIV128" caption="CLK_RTC_OUT = CLK_RTC/128" value="0x6"/>
            <value name="DIV256" caption="CLK_RTC_OUT = CLK_RTC/256" value="0x7"/>
         </value-group>
         <value-group name="RTC_MODE1_CTRLB__DEBF">
            <value name="DIV2" caption="CLK_RTC_DEB = CLK_RTC/2" value="0x0"/>
            <value name="DIV4" caption="CLK_RTC_DEB = CLK_RTC/4" value="0x1"/>
            <value name="DIV8" caption="CLK_RTC_DEB = CLK_RTC/8" value="0x2"/>
            <value name="DIV16" caption="CLK_RTC_DEB = CLK_RTC/16" value="0x3"/>
            <value name="DIV32" caption="CLK_RTC_DEB = CLK_RTC/32" value="0x4"/>
            <value name="DIV64" caption="CLK_RTC_DEB = CLK_RTC/64" value="0x5"/>
            <value name="DIV128" caption="CLK_RTC_DEB = CLK_RTC/128" value="0x6"/>
            <value name="DIV256" caption="CLK_RTC_DEB = CLK_RTC/256" value="0x7"/>
         </value-group>
         <value-group name="RTC_MODE2_CTRLB__ACTF">
            <value name="DIV2" caption="CLK_RTC_OUT = CLK_RTC/2" value="0x0"/>
            <value name="DIV4" caption="CLK_RTC_OUT = CLK_RTC/4" value="0x1"/>
            <value name="DIV8" caption="CLK_RTC_OUT = CLK_RTC/8" value="0x2"/>
            <value name="DIV16" caption="CLK_RTC_OUT = CLK_RTC/16" value="0x3"/>
            <value name="DIV32" caption="CLK_RTC_OUT = CLK_RTC/32" value="0x4"/>
            <value name="DIV64" caption="CLK_RTC_OUT = CLK_RTC/64" value="0x5"/>
            <value name="DIV128" caption="CLK_RTC_OUT = CLK_RTC/128" value="0x6"/>
            <value name="DIV256" caption="CLK_RTC_OUT = CLK_RTC/256" value="0x7"/>
         </value-group>
         <value-group name="RTC_MODE2_CTRLB__DEBF">
            <value name="DIV2" caption="CLK_RTC_DEB = CLK_RTC/2" value="0x0"/>
            <value name="DIV4" caption="CLK_RTC_DEB = CLK_RTC/4" value="0x1"/>
            <value name="DIV8" caption="CLK_RTC_DEB = CLK_RTC/8" value="0x2"/>
            <value name="DIV16" caption="CLK_RTC_DEB = CLK_RTC/16" value="0x3"/>
            <value name="DIV32" caption="CLK_RTC_DEB = CLK_RTC/32" value="0x4"/>
            <value name="DIV64" caption="CLK_RTC_DEB = CLK_RTC/64" value="0x5"/>
            <value name="DIV128" caption="CLK_RTC_DEB = CLK_RTC/128" value="0x6"/>
            <value name="DIV256" caption="CLK_RTC_DEB = CLK_RTC/256" value="0x7"/>
         </value-group>
         <value-group name="RTC_MODE2_CLOCK__HOUR">
            <value name="AM" caption="AM when CLKREP in 12-hour" value="0x00"/>
            <value name="PM" caption="PM when CLKREP in 12-hour" value="0x10"/>
         </value-group>
         <value-group name="RTC_MODE2_ALARM_ALARM__HOUR">
            <value name="AM" caption="Morning hour" value="0x00"/>
            <value name="PM" caption="Afternoon hour" value="0x10"/>
         </value-group>
         <value-group name="RTC_MODE2_ALARM_MASK__SEL">
            <value name="OFF" caption="Alarm Disabled" value="0x0"/>
            <value name="SS" caption="Match seconds only" value="0x1"/>
            <value name="MMSS" caption="Match seconds and minutes only" value="0x2"/>
            <value name="HHMMSS"
                   caption="Match seconds, minutes, and hours only"
                   value="0x3"/>
            <value name="DDHHMMSS"
                   caption="Match seconds, minutes, hours, and days only"
                   value="0x4"/>
            <value name="MMDDHHMMSS"
                   caption="Match seconds, minutes, hours, days, and months only"
                   value="0x5"/>
            <value name="YYMMDDHHMMSS"
                   caption="Match seconds, minutes, hours, days, months, and years"
                   value="0x6"/>
         </value-group>
