ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="PSR"
                      offset="0x24"
                      rw="R"
                      size="4"
                      initval="0x00F80000"
                      caption="Present State">
               <bitfield name="CMDINHC"
                         caption="Command Inhibit (CMD)"
                         mask="0x1"
                         values="SDHC_PSR__CMDINHC"/>
               <bitfield name="CMDINHD"
                         caption="Command Inhibit (DAT)"
                         mask="0x2"
                         values="SDHC_PSR__CMDINHD"/>
               <bitfield name="DLACT"
                         caption="DAT Line Active"
                         mask="0x4"
                         values="SDHC_PSR__DLACT"/>
               <bitfield name="RTREQ"
                         caption="Re-Tuning Request"
                         mask="0x8"
                         values="SDHC_PSR__RTREQ"/>
               <bitfield name="WTACT"
                         caption="Write Transfer Active"
                         mask="0x100"
                         values="SDHC_PSR__WTACT"/>
               <bitfield name="RTACT"
                         caption="Read Transfer Active"
                         mask="0x200"
                         values="SDHC_PSR__RTACT"/>
               <bitfield name="BUFWREN"
                         caption="Buffer Write Enable"
                         mask="0x400"
                         values="SDHC_PSR__BUFWREN"/>
               <bitfield name="BUFRDEN"
                         caption="Buffer Read Enable"
                         mask="0x800"
                         values="SDHC_PSR__BUFRDEN"/>
               <bitfield name="CARDINS"
                         caption="Card Inserted"
                         mask="0x10000"
                         values="SDHC_PSR__CARDINS"/>
               <bitfield name="CARDSS"
                         caption="Card State Stable"
                         mask="0x20000"
                         values="SDHC_PSR__CARDSS"/>
               <bitfield name="CARDDPL"
                         caption="Card Detect Pin Level"
                         mask="0x40000"
                         values="SDHC_PSR__CARDDPL"/>
               <bitfield name="WRPPL"
                         caption="Write Protect Pin Level"
                         mask="0x80000"
                         values="SDHC_PSR__WRPPL"/>
               <bitfield name="DATLL" caption="DAT[3:0] Line Level" mask="0xF00000"/>
               <bitfield name="CMDLL" caption="CMD Line Level" mask="0x1000000"/>
            </register>
            <register name="HC1R"
                      offset="0x28"
                      rw="RW"
                      size="1"
                      initval="0xE00"
                      caption="Host Control 1">
               <mode name="DEFAULT" caption="SD_SDIO"/>
               <mode name="EMMC"/>
               <bitfield modes="DEFAULT"
                         name="LEDCTRL"
                         caption="LED Control"
                         mask="0x1"
                         values="SDHC_HC1R__LEDCTRL"/>
               <bitfield name="DW"
                         caption="Data Width"
                         mask="0x2"
                         values="SDHC_HC1R__DW"/>
               <bitfield name="HSEN"
                         caption="High Speed Enable"
                         mask="0x4"
                         values="SDHC_HC1R__HSEN"/>
               <bitfield name="DMASEL"
                         caption="DMA Select"
                         mask="0x18"
                         values="SDHC_HC1R__DMASEL"/>
               <bitfield modes="DEFAULT"
                         name="CARDDTL"
                         caption="Card Detect Test Level"
                         mask="0x40"
                         values="SDHC_HC1R__CARDDTL"/>
               <bitfield modes="DEFAULT"
                         name="CARDDSEL"
                         caption="Card Detect Signal Selection"
                         mask="0x80"
                         values="SDHC_HC1R__CARDDSEL"/>
            </register>
            <register name="PCR"
                      offset="0x29"
                      rw="RW"
                      size="1"
                      initval="0x0E"
                      caption="Power Control">
               <bitfield name="SDBPWR"
                         caption="SD Bus Power"
                         mask="0x1"
                         values="SDHC_PCR__SDBPWR"/>
               <bitfield name="SDBVSEL"
                         caption="SD Bus Voltage Select"
                         mask="0xE"
                         values="SDHC_PCR__SDBVSEL"/>
            </register>
            <register name="BGCR"
                      offset="0x2A"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Block Gap Control">
               <mode name="DEFAULT" caption="SD_SDIO"/>
               <mode name="EMMC"/>
               <bitfield name="STPBGR"
                         caption="Stop at Block Gap Request"
                         mask="0x1"
                         values="SDHC_BGCR__STPBGR"/>
               <bitfield name="CONTR"
                         caption="Continue Request"
                         mask="0x2"
                         values="SDHC_BGCR__CONTR"/>
               <bitfield modes="DEFAULT"
                         name="RWCTRL"
                         caption="Read Wait Control"
                         mask="0x4"
                         values="SDHC_BGCR__RWCTRL"/>
               <bitfield modes="DEFAULT"
                         name="INTBG"
                         caption="Interrupt at Block Gap"
                         mask="0x8"
                         values="SDHC_BGCR__INTBG"/>
            </register>
            <register name="WCR"
                      offset="0x2B"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Wakeup Control">
               <bitfield name="WKENCINT"
                         caption="Wakeup Event Enable on Card Interrupt"
                         mask="0x1"
                         values="SDHC_WCR__WKENCINT"/>
               <bitfield name="WKENCINS"
                         caption="Wakeup Event Enable on Card Insertion"
                         mask="0x2"
                         values="SDHC_WCR__WKENCINS"/>
               <bitfield name="WKENCREM"
                         caption="Wakeup Event Enable on Card Removal"
                         mask="0x4"
                         values="SDHC_WCR__WKENCREM"/>
            </register>
            <register name="CCR"
                      offset="0x2C"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Clock Control">
               <bitfield name="INTCLKEN"
                         caption="Internal Clock Enable"
                         mask="0x1"
                         values="SDHC_CCR__INTCLKEN"/>
               <bitfield name="INTCLKS"
                         caption="Internal Clock Stable"
                         mask="0x2"
                         values="SDHC_CCR__INTCLKS"/>
               <bitfield name="SDCLKEN"
                         caption="SD Clock Enable"
                         mask="0x4"
                         values="SDHC_CCR__SDCLKEN"/>
               <bitfield name="CLKGSEL"
                         caption="Clock Generator Select"
                         mask="0x20"
                         values="SDHC_CCR__CLKGSEL"/>
               <bitfield name="USDCLKFSEL"
                         caption="Upper Bits of SDCLK Frequency Select"
                         mask="0xC0"/>
               <bitfield name="SDCLKFSEL" caption="SDCLK Frequency Select" mask="0xFF00"/>
            </register>
            <register name="TCR"
                      offset="0x2E"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Timeout Control">
               <bitfield name="DTCVAL" caption="Data Timeout Counter Value" mask="0xF"/>
            </register>
            <register name="SRR"
                      offset="0x2F"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Software Reset">
               <bitfield name="SWRSTALL"
                         caption="Software Reset For All"
                         mask="0x1"
                         values="SDHC_SRR__SWRSTALL"/>
               <bitfield name="SWRSTCMD"
                         caption="Software Reset For CMD Line"
                         mask="0x2"
                         values="SDHC_SRR__SWRSTCMD"/>
               <bitfield name="SWRSTDAT"
                         caption="Software Reset For DAT Line"
                         mask="0x4"
                         values="SDHC_SRR__SWRSTDAT"/>
            </register>
