ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="NISTR"
                      offset="0x30"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Normal Interrupt Status">
               <mode name="DEFAULT" caption="SD_SDIO"/>
               <mode name="EMMC"/>
               <bitfield name="CMDC"
                         caption="Command Complete"
                         mask="0x1"
                         values="SDHC_NISTR__CMDC"/>
               <bitfield name="TRFC"
                         caption="Transfer Complete"
                         mask="0x2"
                         values="SDHC_NISTR__TRFC"/>
               <bitfield name="BLKGE"
                         caption="Block Gap Event"
                         mask="0x4"
                         values="SDHC_NISTR__BLKGE"/>
               <bitfield name="DMAINT"
                         caption="DMA Interrupt"
                         mask="0x8"
                         values="SDHC_NISTR__DMAINT"/>
               <bitfield name="BWRRDY"
                         caption="Buffer Write Ready"
                         mask="0x10"
                         values="SDHC_NISTR__BWRRDY"/>
               <bitfield name="BRDRDY"
                         caption="Buffer Read Ready"
                         mask="0x20"
                         values="SDHC_NISTR__BRDRDY"/>
               <bitfield modes="DEFAULT"
                         name="CINS"
                         caption="Card Insertion"
                         mask="0x40"
                         values="SDHC_NISTR__CINS"/>
               <bitfield modes="DEFAULT"
                         name="CREM"
                         caption="Card Removal"
                         mask="0x80"
                         values="SDHC_NISTR__CREM"/>
               <bitfield modes="DEFAULT"
                         name="CINT"
                         caption="Card Interrupt"
                         mask="0x100"
                         values="SDHC_NISTR__CINT"/>
               <bitfield modes="EMMC"
                         name="BOOTAR"
                         caption="Boot Acknowledge Received"
                         mask="0x4000"/>
               <bitfield name="ERRINT"
                         caption="Error Interrupt"
                         mask="0x8000"
                         values="SDHC_NISTR__ERRINT"/>
            </register>
            <register name="EISTR"
                      offset="0x32"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Error Interrupt Status">
               <mode name="DEFAULT" caption="SD_SDIO"/>
               <mode name="EMMC"/>
               <bitfield name="CMDTEO"
                         caption="Command Timeout Error"
                         mask="0x1"
                         values="SDHC_EISTR__CMDTEO"/>
               <bitfield name="CMDCRC"
                         caption="Command CRC Error"
                         mask="0x2"
                         values="SDHC_EISTR__CMDCRC"/>
               <bitfield name="CMDEND"
                         caption="Command End Bit Error"
                         mask="0x4"
                         values="SDHC_EISTR__CMDEND"/>
               <bitfield name="CMDIDX"
                         caption="Command Index Error"
                         mask="0x8"
                         values="SDHC_EISTR__CMDIDX"/>
               <bitfield name="DATTEO"
                         caption="Data Timeout Error"
                         mask="0x10"
                         values="SDHC_EISTR__DATTEO"/>
               <bitfield name="DATCRC"
                         caption="Data CRC Error"
                         mask="0x20"
                         values="SDHC_EISTR__DATCRC"/>
               <bitfield name="DATEND"
                         caption="Data End Bit Error"
                         mask="0x40"
                         values="SDHC_EISTR__DATEND"/>
               <bitfield name="CURLIM"
                         caption="Current Limit Error"
                         mask="0x80"
                         values="SDHC_EISTR__CURLIM"/>
               <bitfield name="ACMD"
                         caption="Auto CMD Error"
                         mask="0x100"
                         values="SDHC_EISTR__ACMD"/>
               <bitfield name="ADMA"
                         caption="ADMA Error"
                         mask="0x200"
                         values="SDHC_EISTR__ADMA"/>
               <bitfield modes="EMMC"
                         name="BOOTAE"
                         caption="Boot Acknowledge Error"
                         mask="0x1000"
                         values="SDHC_EISTR__BOOTAE"/>
            </register>
            <register name="NISTER"
                      offset="0x34"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Normal Interrupt Status Enable">
               <mode name="DEFAULT" caption="SD_SDIO"/>
               <mode name="EMMC"/>
               <bitfield name="CMDC"
                         caption="Command Complete Status Enable"
                         mask="0x1"
                         values="SDHC_NISTER__CMDC"/>
               <bitfield name="TRFC"
                         caption="Transfer Complete Status Enable"
                         mask="0x2"
                         values="SDHC_NISTER__TRFC"/>
               <bitfield name="BLKGE"
                         caption="Block Gap Event Status Enable"
                         mask="0x4"
                         values="SDHC_NISTER__BLKGE"/>
               <bitfield name="DMAINT"
                         caption="DMA Interrupt Status Enable"
                         mask="0x8"
                         values="SDHC_NISTER__DMAINT"/>
               <bitfield name="BWRRDY"
                         caption="Buffer Write Ready Status Enable"
                         mask="0x10"
                         values="SDHC_NISTER__BWRRDY"/>
               <bitfield name="BRDRDY"
                         caption="Buffer Read Ready Status Enable"
                         mask="0x20"
                         values="SDHC_NISTER__BRDRDY"/>
               <bitfield modes="DEFAULT"
                         name="CINS"
                         caption="Card Insertion Status Enable"
                         mask="0x40"
                         values="SDHC_NISTER__CINS"/>
               <bitfield modes="DEFAULT"
                         name="CREM"
                         caption="Card Removal Status Enable"
                         mask="0x80"
                         values="SDHC_NISTER__CREM"/>
               <bitfield modes="DEFAULT"
                         name="CINT"
                         caption="Card Interrupt Status Enable"
                         mask="0x100"
                         values="SDHC_NISTER__CINT"/>
               <bitfield modes="EMMC"
                         name="BOOTAR"
                         caption="Boot Acknowledge Received Status Enable"
                         mask="0x4000"/>
            </register>
