ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="EISTER"
                      offset="0x36"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Error Interrupt Status Enable">
               <mode name="DEFAULT" caption="SD_SDIO"/>
               <mode name="EMMC"/>
               <bitfield name="CMDTEO"
                         caption="Command Timeout Error Status Enable"
                         mask="0x1"
                         values="SDHC_EISTER__CMDTEO"/>
               <bitfield name="CMDCRC"
                         caption="Command CRC Error Status Enable"
                         mask="0x2"
                         values="SDHC_EISTER__CMDCRC"/>
               <bitfield name="CMDEND"
                         caption="Command End Bit Error Status Enable"
                         mask="0x4"
                         values="SDHC_EISTER__CMDEND"/>
               <bitfield name="CMDIDX"
                         caption="Command Index Error Status Enable"
                         mask="0x8"
                         values="SDHC_EISTER__CMDIDX"/>
               <bitfield name="DATTEO"
                         caption="Data Timeout Error Status Enable"
                         mask="0x10"
                         values="SDHC_EISTER__DATTEO"/>
               <bitfield name="DATCRC"
                         caption="Data CRC Error Status Enable"
                         mask="0x20"
                         values="SDHC_EISTER__DATCRC"/>
               <bitfield name="DATEND"
                         caption="Data End Bit Error Status Enable"
                         mask="0x40"
                         values="SDHC_EISTER__DATEND"/>
               <bitfield name="CURLIM"
                         caption="Current Limit Error Status Enable"
                         mask="0x80"
                         values="SDHC_EISTER__CURLIM"/>
               <bitfield name="ACMD"
                         caption="Auto CMD Error Status Enable"
                         mask="0x100"
                         values="SDHC_EISTER__ACMD"/>
               <bitfield name="ADMA"
                         caption="ADMA Error Status Enable"
                         mask="0x200"
                         values="SDHC_EISTER__ADMA"/>
               <bitfield modes="EMMC"
                         name="BOOTAE"
                         caption="Boot Acknowledge Error Status Enable"
                         mask="0x1000"/>
            </register>
            <register name="NISIER"
                      offset="0x38"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Normal Interrupt Signal Enable">
               <mode name="DEFAULT" caption="SD_SDIO"/>
               <mode name="EMMC"/>
               <bitfield name="CMDC"
                         caption="Command Complete Signal Enable"
                         mask="0x1"
                         values="SDHC_NISIER__CMDC"/>
               <bitfield name="TRFC"
                         caption="Transfer Complete Signal Enable"
                         mask="0x2"
                         values="SDHC_NISIER__TRFC"/>
               <bitfield name="BLKGE"
                         caption="Block Gap Event Signal Enable"
                         mask="0x4"
                         values="SDHC_NISIER__BLKGE"/>
               <bitfield name="DMAINT"
                         caption="DMA Interrupt Signal Enable"
                         mask="0x8"
                         values="SDHC_NISIER__DMAINT"/>
               <bitfield name="BWRRDY"
                         caption="Buffer Write Ready Signal Enable"
                         mask="0x10"
                         values="SDHC_NISIER__BWRRDY"/>
               <bitfield name="BRDRDY"
                         caption="Buffer Read Ready Signal Enable"
                         mask="0x20"
                         values="SDHC_NISIER__BRDRDY"/>
               <bitfield modes="DEFAULT"
                         name="CINS"
                         caption="Card Insertion Signal Enable"
                         mask="0x40"
                         values="SDHC_NISIER__CINS"/>
               <bitfield modes="DEFAULT"
                         name="CREM"
                         caption="Card Removal Signal Enable"
                         mask="0x80"
                         values="SDHC_NISIER__CREM"/>
               <bitfield modes="DEFAULT"
                         name="CINT"
                         caption="Card Interrupt Signal Enable"
                         mask="0x100"
                         values="SDHC_NISIER__CINT"/>
               <bitfield modes="EMMC"
                         name="BOOTAR"
                         caption="Boot Acknowledge Received Signal Enable"
                         mask="0x4000"/>
            </register>
            <register name="EISIER"
                      offset="0x3A"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Error Interrupt Signal Enable">
               <mode name="DEFAULT" caption="SD_SDIO"/>
               <mode name="EMMC"/>
               <bitfield name="CMDTEO"
                         caption="Command Timeout Error Signal Enable"
                         mask="0x1"
                         values="SDHC_EISIER__CMDTEO"/>
               <bitfield name="CMDCRC"
                         caption="Command CRC Error Signal Enable"
                         mask="0x2"
                         values="SDHC_EISIER__CMDCRC"/>
               <bitfield name="CMDEND"
                         caption="Command End Bit Error Signal Enable"
                         mask="0x4"
                         values="SDHC_EISIER__CMDEND"/>
               <bitfield name="CMDIDX"
                         caption="Command Index Error Signal Enable"
                         mask="0x8"
                         values="SDHC_EISIER__CMDIDX"/>
               <bitfield name="DATTEO"
                         caption="Data Timeout Error Signal Enable"
                         mask="0x10"
                         values="SDHC_EISIER__DATTEO"/>
               <bitfield name="DATCRC"
                         caption="Data CRC Error Signal Enable"
                         mask="0x20"
                         values="SDHC_EISIER__DATCRC"/>
               <bitfield name="DATEND"
                         caption="Data End Bit Error Signal Enable"
                         mask="0x40"
                         values="SDHC_EISIER__DATEND"/>
               <bitfield name="CURLIM"
                         caption="Current Limit Error Signal Enable"
                         mask="0x80"
                         values="SDHC_EISIER__CURLIM"/>
               <bitfield name="ACMD"
                         caption="Auto CMD Error Signal Enable"
                         mask="0x100"
                         values="SDHC_EISIER__ACMD"/>
               <bitfield name="ADMA"
                         caption="ADMA Error Signal Enable"
                         mask="0x200"
                         values="SDHC_EISIER__ADMA"/>
               <bitfield modes="EMMC"
                         name="BOOTAE"
                         caption="Boot Acknowledge Error Signal Enable"
                         mask="0x1000"/>
            </register>
            <register name="ACESR"
                      offset="0x3C"
                      rw="R"
                      size="2"
                      initval="0x0000"
                      caption="Auto CMD Error Status">
               <bitfield name="ACMD12NE"
                         caption="Auto CMD12 Not Executed"
                         mask="0x1"
                         values="SDHC_ACESR__ACMD12NE"/>
               <bitfield name="ACMDTEO"
                         caption="Auto CMD Timeout Error"
                         mask="0x2"
                         values="SDHC_ACESR__ACMDTEO"/>
               <bitfield name="ACMDCRC"
                         caption="Auto CMD CRC Error"
                         mask="0x4"
                         values="SDHC_ACESR__ACMDCRC"/>
               <bitfield name="ACMDEND"
                         caption="Auto CMD End Bit Error"
                         mask="0x8"
                         values="SDHC_ACESR__ACMDEND"/>
               <bitfield name="ACMDIDX"
                         caption="Auto CMD Index Error"
                         mask="0x10"
                         values="SDHC_ACESR__ACMDIDX"/>
               <bitfield name="CMDNI"
                         caption="Command not Issued By Auto CMD12 Error"
                         mask="0x80"
                         values="SDHC_ACESR__CMDNI"/>
            </register>
