ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="HC2R"
                      offset="0x3E"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Host Control 2">
               <mode name="DEFAULT" caption="SD_SDIO"/>
               <mode name="EMMC"/>
               <bitfield modes="DEFAULT"
                         name="UHSMS"
                         caption="UHS Mode Select"
                         mask="0x7"
                         values="SDHC_HC2R__UHSMS"/>
               <bitfield modes="DEFAULT"
                         name="VS18EN"
                         caption="1.8V Signaling Enable"
                         mask="0x8"
                         values="SDHC_HC2R__VS18EN"/>
               <bitfield modes="EMMC"
                         name="HS200EN"
                         caption="HS200 Mode Enable"
                         mask="0xF"
                         values="SDHC_HC2R__HS200EN"/>
               <bitfield name="DRVSEL"
                         caption="Driver Strength Select"
                         mask="0x30"
                         values="SDHC_HC2R__DRVSEL"/>
               <bitfield name="EXTUN"
                         caption="Execute Tuning"
                         mask="0x40"
                         values="SDHC_HC2R__EXTUN"/>
               <bitfield name="SLCKSEL"
                         caption="Sampling Clock Select"
                         mask="0x80"
                         values="SDHC_HC2R__SLCKSEL"/>
               <bitfield modes="DEFAULT"
                         name="ASINTEN"
                         caption="Asynchronous Interrupt Enable"
                         mask="0x4000"
                         values="SDHC_HC2R__ASINTEN"/>
               <bitfield name="PVALEN"
                         caption="Preset Value Enable"
                         mask="0x8000"
                         values="SDHC_HC2R__PVALEN"/>
            </register>
            <register name="CA0R"
                      offset="0x40"
                      rw="R"
                      size="4"
                      initval="0x27E80080"
                      caption="Capabilities 0">
               <bitfield name="TEOCLKF"
                         caption="Timeout Clock Frequency"
                         mask="0x3F"
                         values="SDHC_CA0R__TEOCLKF"/>
               <bitfield name="TEOCLKU"
                         caption="Timeout Clock Unit"
                         mask="0x80"
                         values="SDHC_CA0R__TEOCLKU"/>
               <bitfield name="BASECLKF"
                         caption="Base Clock Frequency"
                         mask="0xFF00"
                         values="SDHC_CA0R__BASECLKF"/>
               <bitfield name="MAXBLKL"
                         caption="Max Block Length"
                         mask="0x30000"
                         values="SDHC_CA0R__MAXBLKL"/>
               <bitfield name="ED8SUP"
                         caption="8-bit Support for Embedded Device"
                         mask="0x40000"
                         values="SDHC_CA0R__ED8SUP"/>
               <bitfield name="ADMA2SUP"
                         caption="ADMA2 Support"
                         mask="0x80000"
                         values="SDHC_CA0R__ADMA2SUP"/>
               <bitfield name="HSSUP"
                         caption="High Speed Support"
                         mask="0x200000"
                         values="SDHC_CA0R__HSSUP"/>
               <bitfield name="SDMASUP"
                         caption="SDMA Support"
                         mask="0x400000"
                         values="SDHC_CA0R__SDMASUP"/>
               <bitfield name="SRSUP"
                         caption="Suspend/Resume Support"
                         mask="0x800000"
                         values="SDHC_CA0R__SRSUP"/>
               <bitfield name="V33VSUP"
                         caption="Voltage Support 3.3V"
                         mask="0x1000000"
                         values="SDHC_CA0R__V33VSUP"/>
               <bitfield name="V30VSUP"
                         caption="Voltage Support 3.0V"
                         mask="0x2000000"
                         values="SDHC_CA0R__V30VSUP"/>
               <bitfield name="V18VSUP"
                         caption="Voltage Support 1.8V"
                         mask="0x4000000"
                         values="SDHC_CA0R__V18VSUP"/>
               <bitfield name="SB64SUP"
                         caption="64-Bit System Bus Support"
                         mask="0x10000000"
                         values="SDHC_CA0R__SB64SUP"/>
               <bitfield name="ASINTSUP"
                         caption="Asynchronous Interrupt Support"
                         mask="0x20000000"
                         values="SDHC_CA0R__ASINTSUP"/>
               <bitfield name="SLTYPE"
                         caption="Slot Type"
                         mask="0xC0000000"
                         values="SDHC_CA0R__SLTYPE"/>
            </register>
            <register name="CA1R"
                      offset="0x44"
                      rw="R"
                      size="4"
                      initval="0x00000070"
                      caption="Capabilities 1">
               <bitfield name="SDR50SUP"
                         caption="SDR50 Support"
                         mask="0x1"
                         values="SDHC_CA1R__SDR50SUP"/>
               <bitfield name="SDR104SUP"
                         caption="SDR104 Support"
                         mask="0x2"
                         values="SDHC_CA1R__SDR104SUP"/>
               <bitfield name="DDR50SUP"
                         caption="DDR50 Support"
                         mask="0x4"
                         values="SDHC_CA1R__DDR50SUP"/>
               <bitfield name="DRVASUP"
                         caption="Driver Type A Support"
                         mask="0x10"
                         values="SDHC_CA1R__DRVASUP"/>
               <bitfield name="DRVCSUP"
                         caption="Driver Type C Support"
                         mask="0x20"
                         values="SDHC_CA1R__DRVCSUP"/>
               <bitfield name="DRVDSUP"
                         caption="Driver Type D Support"
                         mask="0x40"
                         values="SDHC_CA1R__DRVDSUP"/>
               <bitfield name="TCNTRT"
                         caption="Timer Count for Re-Tuning"
                         mask="0xF00"
                         values="SDHC_CA1R__TCNTRT"/>
               <bitfield name="TSDR50"
                         caption="Use Tuning for SDR50"
                         mask="0x2000"
                         values="SDHC_CA1R__TSDR50"/>
               <bitfield name="CLKMULT"
                         caption="Clock Multiplier"
                         mask="0xFF0000"
                         values="SDHC_CA1R__CLKMULT"/>
            </register>
            <register name="MCCAR"
                      offset="0x48"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Maximum Current Capabilities">
               <bitfield name="MAXCUR33V"
                         caption="Maximum Current for 3.3V"
                         mask="0xFF"
                         values="SDHC_MCCAR__MAXCUR33V"/>
               <bitfield name="MAXCUR30V"
                         caption="Maximum Current for 3.0V"
                         mask="0xFF00"
                         values="SDHC_MCCAR__MAXCUR30V"/>
               <bitfield name="MAXCUR18V"
                         caption="Maximum Current for 1.8V"
                         mask="0xFF0000"
                         values="SDHC_MCCAR__MAXCUR18V"/>
            </register>
            <register name="FERACES"
                      offset="0x50"
                      rw="W"
                      size="2"
                      initval="0x0000"
                      caption="Force Event for Auto CMD Error Status">
               <bitfield name="ACMD12NE"
                         caption="Force Event for Auto CMD12 Not Executed"
                         mask="0x1"
                         values="SDHC_FERACES__ACMD12NE"/>
               <bitfield name="ACMDTEO"
                         caption="Force Event for Auto CMD Timeout Error"
                         mask="0x2"
                         values="SDHC_FERACES__ACMDTEO"/>
               <bitfield name="ACMDCRC"
                         caption="Force Event for Auto CMD CRC Error"
                         mask="0x4"
                         values="SDHC_FERACES__ACMDCRC"/>
               <bitfield name="ACMDEND"
                         caption="Force Event for Auto CMD End Bit Error"
                         mask="0x8"
                         values="SDHC_FERACES__ACMDEND"/>
               <bitfield name="ACMDIDX"
                         caption="Force Event for Auto CMD Index Error"
                         mask="0x10"
                         values="SDHC_FERACES__ACMDIDX"/>
               <bitfield name="CMDNI"
                         caption="Force Event for Command Not Issued By Auto CMD12 Error"
                         mask="0x80"
                         values="SDHC_FERACES__CMDNI"/>
            </register>
            <register name="FEREIS"
                      offset="0x52"
                      rw="W"
                      size="2"
                      initval="0x0000"
                      caption="Force Event for Error Interrupt Status">
               <bitfield name="CMDTEO"
                         caption="Force Event for Command Timeout Error"
                         mask="0x1"
                         values="SDHC_FEREIS__CMDTEO"/>
               <bitfield name="CMDCRC"
                         caption="Force Event for Command CRC Error"
                         mask="0x2"
                         values="SDHC_FEREIS__CMDCRC"/>
               <bitfield name="CMDEND"
                         caption="Force Event for Command End Bit Error"
                         mask="0x4"
                         values="SDHC_FEREIS__CMDEND"/>
               <bitfield name="CMDIDX"
                         caption="Force Event for Command Index Error"
                         mask="0x8"
                         values="SDHC_FEREIS__CMDIDX"/>
               <bitfield name="DATTEO"
                         caption="Force Event for Data Timeout Error"
                         mask="0x10"
                         values="SDHC_FEREIS__DATTEO"/>
               <bitfield name="DATCRC"
                         caption="Force Event for Data CRC Error"
                         mask="0x20"
                         values="SDHC_FEREIS__DATCRC"/>
               <bitfield name="DATEND"
                         caption="Force Event for Data End Bit Error"
                         mask="0x40"
                         values="SDHC_FEREIS__DATEND"/>
               <bitfield name="CURLIM"
                         caption="Force Event for Current Limit Error"
                         mask="0x80"
                         values="SDHC_FEREIS__CURLIM"/>
               <bitfield name="ACMD"
                         caption="Force Event for Auto CMD Error"
                         mask="0x100"
                         values="SDHC_FEREIS__ACMD"/>
               <bitfield name="ADMA"
                         caption="Force Event for ADMA Error"
                         mask="0x200"
                         values="SDHC_FEREIS__ADMA"/>
               <bitfield name="BOOTAE"
                         caption="Force Event for Boot Acknowledge Error"
                         mask="0x1000"
                         values="SDHC_FEREIS__BOOTAE"/>
            </register>
            <register name="AESR"
                      offset="0x54"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="ADMA Error Status">
               <bitfield name="ERRST"
                         caption="ADMA Error State"
                         mask="0x3"
                         values="SDHC_AESR__ERRST"/>
               <bitfield name="LMIS"
                         caption="ADMA Length Mismatch Error"
                         mask="0x4"
                         values="SDHC_AESR__LMIS"/>
            </register>
            <register name="ASAR"
                      offset="0x58"
                      rw="RW"
                      size="4"
                      count="1"
                      initval="0x00000000"
                      caption="ADMA System Address">
               <bitfield name="ADMASA" caption="ADMA System Address" mask="0xFFFFFFFF"/>
            </register>
            <register name="PVR"
                      offset="0x60"
                      rw="RW"
                      size="2"
                      count="8"
                      initval="0x0000"
                      caption="Preset Value n">
               <bitfield name="SDCLKFSEL"
                         caption="SDCLK Frequency Select Value for Initialization"
                         mask="0x3FF"/>
               <bitfield name="CLKGSEL"
                         caption="Clock Generator Select Value for Initialization"
                         mask="0x400"
                         values="SDHC_PVR__CLKGSEL"/>
               <bitfield name="DRVSEL"
                         caption="Driver Strength Select Value for Initialization"
                         mask="0xC000"
                         values="SDHC_PVR__DRVSEL"/>
            </register>
