ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="SDHC_CR__CMDICEN">
            <value name="DISABLE" caption="Disable" value="0"/>
            <value name="ENABLE" caption="Enable" value="1"/>
         </value-group>
         <value-group name="SDHC_CR__CMDTYP">
            <value name="NORMAL" caption="Other commands" value="0"/>
            <value name="SUSPEND"
                   caption="CMD52 for writing Bus Suspend in CCCR"
                   value="1"/>
            <value name="RESUME"
                   caption="CMD52 for writing Function Select in CCCR"
                   value="2"/>
            <value name="ABORT"
                   caption="CMD12, CMD52 for writing I/O Abort in CCCR"
                   value="3"/>
         </value-group>
         <value-group name="SDHC_CR__DPSEL">
            <value name="NO_DATA" caption="No Data Present" value="0"/>
            <value name="DATA" caption="Data Present" value="1"/>
         </value-group>
         <value-group name="SDHC_CR__RESPTYP">
            <value name="NONE" caption="No response" value="0"/>
            <value name="136_BIT" caption="136-bit response" value="1"/>
            <value name="48_BIT" caption="48-bit response" value="2"/>
            <value name="48_BIT_BUSY"
                   caption="48-bit response check busy after response"
                   value="3"/>
         </value-group>
         <value-group name="SDHC_PSR__BUFRDEN">
            <value name="DISABLE" caption="Read disable" value="0"/>
            <value name="ENABLE" caption="Read enable" value="1"/>
         </value-group>
         <value-group name="SDHC_PSR__BUFWREN">
            <value name="DISABLE" caption="Write disable" value="0"/>
            <value name="ENABLE" caption="Write enable" value="1"/>
         </value-group>
         <value-group name="SDHC_PSR__CARDDPL">
            <value name="NO" caption="No card present (SDCD#=1)" value="0"/>
            <value name="YES" caption="Card present (SDCD#=0)" value="1"/>
         </value-group>
         <value-group name="SDHC_PSR__CARDINS">
            <value name="NO" caption="Reset or Debouncing or No Card" value="0"/>
            <value name="YES" caption="Card inserted" value="1"/>
         </value-group>
         <value-group name="SDHC_PSR__CARDSS">
            <value name="NO" caption="Reset or Debouncing" value="0"/>
            <value name="YES" caption="No Card or Insered" value="1"/>
         </value-group>
         <value-group name="SDHC_PSR__CMDINHC">
            <value name="CAN"
                   caption="Can issue command using only CMD line"
                   value="0"/>
            <value name="CANNOT" caption="Cannot issue command" value="1"/>
         </value-group>
         <value-group name="SDHC_PSR__CMDINHD">
            <value name="CAN"
                   caption="Can issue command which uses the DAT line"
                   value="0"/>
            <value name="CANNOT"
                   caption="Cannot issue command which uses the DAT line"
                   value="1"/>
         </value-group>
         <value-group name="SDHC_PSR__DLACT">
            <value name="INACTIVE" caption="DAT Line Inactive" value="0"/>
            <value name="ACTIVE" caption="DAT Line Active" value="1"/>
         </value-group>
         <value-group name="SDHC_PSR__RTACT">
            <value name="NO" caption="No valid data" value="0"/>
            <value name="YES" caption="Transferring data" value="1"/>
         </value-group>
         <value-group name="SDHC_PSR__RTREQ">
            <value name="OK" caption="Fixed or well-tuned sampling clock" value="0"/>
            <value name="REQUIRED" caption="Sampling clock needs re-tuning" value="1"/>
         </value-group>
         <value-group name="SDHC_PSR__WRPPL">
            <value name="PROTECTED" caption="Write protected (SDWP#=0)" value="0"/>
            <value name="ENABLED" caption="Write enabled (SDWP#=1)" value="1"/>
         </value-group>
         <value-group name="SDHC_PSR__WTACT">
            <value name="NO" caption="No valid data" value="0"/>
            <value name="YES" caption="Transferring data" value="1"/>
         </value-group>
         <value-group name="SDHC_HC1R__CARDDSEL">
            <value name="NORMAL"
                   caption="SDCD# is selected (for normal use)"
                   value="0"/>
            <value name="TEST"
                   caption="The Card Select Test Level is selected (for test purpose)"
                   value="1"/>
         </value-group>
         <value-group name="SDHC_HC1R__CARDDTL">
            <value name="NO" caption="No Card" value="0"/>
            <value name="YES" caption="Card Inserted" value="1"/>
         </value-group>
         <value-group name="SDHC_HC1R__DMASEL">
            <value name="SDMA" caption="SDMA is selected" value="0"/>
            <value name="32BIT" caption="32-bit Address ADMA2 is selected" value="2"/>
         </value-group>
         <value-group name="SDHC_HC1R__DW">
            <value name="1BIT" caption="1-bit mode" value="0"/>
            <value name="4BIT" caption="4-bit mode" value="1"/>
         </value-group>
         <value-group name="SDHC_HC1R__HSEN">
            <value name="NORMAL" caption="Normal Speed mode" value="0"/>
            <value name="HIGH" caption="High Speed mode" value="1"/>
         </value-group>
         <value-group name="SDHC_HC1R__LEDCTRL">
            <value name="OFF" caption="LED off" value="0"/>
            <value name="ON" caption="LED on" value="1"/>
         </value-group>
         <value-group name="SDHC_PCR__SDBPWR">
            <value name="OFF" caption="Power off" value="0"/>
            <value name="ON" caption="Power on" value="1"/>
         </value-group>
         <value-group name="SDHC_PCR__SDBVSEL">
            <value name="1V8" caption="1.8V (Typ.)" value="5"/>
            <value name="3V0" caption="3.0V (Typ.)" value="6"/>
            <value name="3V3" caption="3.3V (Typ.)" value="7"/>
         </value-group>
         <value-group name="SDHC_BGCR__CONTR">
            <value name="GO_ON" caption="Not affected" value="0"/>
            <value name="RESTART" caption="Restart" value="1"/>
         </value-group>
         <value-group name="SDHC_BGCR__INTBG">
            <value name="DISABLED" caption="Disabled" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_BGCR__RWCTRL">
            <value name="DISABLE" caption="Disable Read Wait Control" value="0"/>
            <value name="ENABLE" caption="Enable Read Wait Control" value="1"/>
         </value-group>
