ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="SDHC_BGCR__STPBGR">
            <value name="TRANSFER" caption="Transfer" value="0"/>
            <value name="STOP" caption="Stop" value="1"/>
         </value-group>
         <value-group name="SDHC_WCR__WKENCINS">
            <value name="DISABLE" caption="Disable" value="0"/>
            <value name="ENABLE" caption="Enable" value="1"/>
         </value-group>
         <value-group name="SDHC_WCR__WKENCINT">
            <value name="DISABLE" caption="Disable" value="0"/>
            <value name="ENABLE" caption="Enable" value="1"/>
         </value-group>
         <value-group name="SDHC_WCR__WKENCREM">
            <value name="DISABLE" caption="Disable" value="0"/>
            <value name="ENABLE" caption="Enable" value="1"/>
         </value-group>
         <value-group name="SDHC_CCR__CLKGSEL">
            <value name="DIV" caption="Divided Clock Mode" value="0"/>
            <value name="PROG" caption="Programmable Clock Mode" value="1"/>
         </value-group>
         <value-group name="SDHC_CCR__INTCLKEN">
            <value name="OFF" caption="Stop" value="0"/>
            <value name="ON" caption="Oscillate" value="1"/>
         </value-group>
         <value-group name="SDHC_CCR__INTCLKS">
            <value name="NOT_READY" caption="Not Ready" value="0"/>
            <value name="READY" caption="Ready" value="1"/>
         </value-group>
         <value-group name="SDHC_CCR__SDCLKEN">
            <value name="DISABLE" caption="Disable" value="0"/>
            <value name="ENABLE" caption="Enable" value="1"/>
         </value-group>
         <value-group name="SDHC_SRR__SWRSTALL">
            <value name="WORK" caption="Work" value="0"/>
            <value name="RESET" caption="Reset" value="1"/>
         </value-group>
         <value-group name="SDHC_SRR__SWRSTCMD">
            <value name="WORK" caption="Work" value="0"/>
            <value name="RESET" caption="Reset" value="1"/>
         </value-group>
         <value-group name="SDHC_SRR__SWRSTDAT">
            <value name="WORK" caption="Work" value="0"/>
            <value name="RESET" caption="Reset" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTR__BLKGE">
            <value name="NO" caption="No Block Gap Event" value="0"/>
            <value name="STOP" caption="Transaction stopped at block gap" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTR__BRDRDY">
            <value name="NO" caption="Not ready to read buffer" value="0"/>
            <value name="YES" caption="Ready to read buffer" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTR__BWRRDY">
            <value name="NO" caption="Not ready to write buffer" value="0"/>
            <value name="YES" caption="Ready to write buffer" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTR__CINS">
            <value name="NO" caption="Card state stable or Debouncing" value="0"/>
            <value name="YES" caption="Card inserted" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTR__CINT">
            <value name="NO" caption="No Card Interrupt" value="0"/>
            <value name="YES" caption="Generate Card Interrupt" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTR__CMDC">
            <value name="NO" caption="No command complete" value="0"/>
            <value name="YES" caption="Command complete" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTR__CREM">
            <value name="NO" caption="Card state stable or Debouncing" value="0"/>
            <value name="YES" caption="Card Removed" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTR__DMAINT">
            <value name="NO" caption="No DMA Interrupt" value="0"/>
            <value name="YES" caption="DMA Interrupt is generated" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTR__ERRINT">
            <value name="NO" caption="No Error" value="0"/>
            <value name="YES" caption="Error" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTR__TRFC">
            <value name="NO" caption="Not complete" value="0"/>
            <value name="YES" caption="Command execution is completed" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTR__ACMD">
            <value name="NO" caption="No Error" value="0"/>
            <value name="YES" caption="Error" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTR__ADMA">
            <value name="NO" caption="No Error" value="0"/>
            <value name="YES" caption="Error" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTR__CMDCRC">
            <value name="NO" caption="No Error" value="0"/>
            <value name="YES" caption="CRC Error Generated" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTR__CMDEND">
            <value name="NO" caption="No error" value="0"/>
            <value name="YES" caption="End Bit Error Generated" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTR__CMDIDX">
            <value name="NO" caption="No Error" value="0"/>
            <value name="YES" caption="Error" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTR__CMDTEO">
            <value name="NO" caption="No Error" value="0"/>
            <value name="YES" caption="Timeout" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTR__CURLIM">
            <value name="NO" caption="No Error" value="0"/>
            <value name="YES" caption="Power Fail" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTR__DATCRC">
            <value name="NO" caption="No Error" value="0"/>
            <value name="YES" caption="Error" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTR__DATEND">
            <value name="NO" caption="No Error" value="0"/>
            <value name="YES" caption="Error" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTR__DATTEO">
            <value name="NO" caption="No Error" value="0"/>
            <value name="YES" caption="Timeout" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTR__BOOTAE">
            <value name="FIFONOTEMPTY"
                   caption="FIFO contains at least one byte"
                   value="0"/>
            <value name="FIFOEMPTY" caption="FIFO is empty" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTER__BLKGE">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTER__BRDRDY">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTER__BWRRDY">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
