ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="SDHC_NISTER__CINS">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTER__CINT">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTER__CMDC">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTER__CREM">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTER__DMAINT">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISTER__TRFC">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTER__ACMD">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTER__ADMA">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTER__CMDCRC">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTER__CMDEND">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTER__CMDIDX">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTER__CMDTEO">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTER__CURLIM">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTER__DATCRC">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTER__DATEND">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISTER__DATTEO">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISIER__BLKGE">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISIER__BRDRDY">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISIER__BWRRDY">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISIER__CINS">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISIER__CINT">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISIER__CMDC">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISIER__CREM">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISIER__DMAINT">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_NISIER__TRFC">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISIER__ACMD">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISIER__ADMA">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISIER__CMDCRC">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISIER__CMDEND">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISIER__CMDIDX">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISIER__CMDTEO">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISIER__CURLIM">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
         <value-group name="SDHC_EISIER__DATCRC">
            <value name="MASKED" caption="Masked" value="0"/>
            <value name="ENABLED" caption="Enabled" value="1"/>
         </value-group>
