ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="SDHC_FEREIS__CMDEND">
            <value name="NO" caption="No Interrupt" value="0"/>
            <value name="YES" caption="Interrupt is generated" value="1"/>
         </value-group>
         <value-group name="SDHC_FEREIS__CMDIDX">
            <value name="NO" caption="No Interrupt" value="0"/>
            <value name="YES" caption="Interrupt is generated" value="1"/>
         </value-group>
         <value-group name="SDHC_FEREIS__CMDTEO">
            <value name="NO" caption="No Interrupt" value="0"/>
            <value name="YES" caption="Interrupt is generated" value="1"/>
         </value-group>
         <value-group name="SDHC_FEREIS__CURLIM">
            <value name="NO" caption="No Interrupt" value="0"/>
            <value name="YES" caption="Interrupt is generated" value="1"/>
         </value-group>
         <value-group name="SDHC_FEREIS__DATCRC">
            <value name="NO" caption="No Interrupt" value="0"/>
            <value name="YES" caption="Interrupt is generated" value="1"/>
         </value-group>
         <value-group name="SDHC_FEREIS__DATEND">
            <value name="NO" caption="No Interrupt" value="0"/>
            <value name="YES" caption="Interrupt is generated" value="1"/>
         </value-group>
         <value-group name="SDHC_FEREIS__DATTEO">
            <value name="NO" caption="No Interrupt" value="0"/>
            <value name="YES" caption="Interrupt is generated" value="1"/>
         </value-group>
         <value-group name="SDHC_AESR__ERRST">
            <value name="STOP" caption="ST_STOP (Stop DMA)" value="0"/>
            <value name="FDS" caption="ST_FDS (Fetch Descriptor)" value="1"/>
            <value name="TFR" caption="ST_TFR (Transfer Data)" value="3"/>
         </value-group>
         <value-group name="SDHC_AESR__LMIS">
            <value name="NO" caption="No Error" value="0"/>
            <value name="YES" caption="Error" value="1"/>
         </value-group>
         <value-group name="SDHC_PVR__CLKGSEL">
            <value name="DIV"
                   caption="Host Controller Ver2.00 Compatible Clock Generator (Divider)"
                   value="0"/>
            <value name="PROG" caption="Programmable Clock Generator" value="1"/>
         </value-group>
         <value-group name="SDHC_PVR__DRVSEL">
            <value name="B" caption="Driver Type B is Selected" value="0"/>
            <value name="A" caption="Driver Type A is Selected" value="1"/>
            <value name="C" caption="Driver Type C is Selected" value="2"/>
            <value name="D" caption="Driver Type D is Selected" value="3"/>
         </value-group>
         <value-group name="SDHC_MC1R__CMDTYP">
            <value name="NORMAL" caption="Not a MMC specific command" value="0"/>
            <value name="WAITIRQ" caption="Wait IRQ Command" value="1"/>
            <value name="STREAM" caption="Stream Command" value="2"/>
            <value name="BOOT" caption="Boot Command" value="3"/>
         </value-group>
         <value-group name="SDHC_ACR__BMAX">
            <value name="INCR16" value="0"/>
            <value name="INCR8" value="1"/>
            <value name="INCR4" value="2"/>
            <value name="SINGLE" value="3"/>
         </value-group>
         <value-group name="SDHC_CC2R__FSDCLKD">
            <value name="NOEFFECT" caption="No effect" value="0"/>
            <value name="DISABLE"
                   caption="SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled"
                   value="1"/>
         </value-group>
         <value-group name="SDHC_DBGR__NIDBG">
            <value name="IDBG"
                   caption="Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer)"
                   value="0"/>
            <value name="NIDBG"
                   caption="Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer)"
                   value="1"/>
         </value-group>
         <value-group name="SDHC_CACR__KEY">
            <value name="KEY" caption="Key" value="0x46"/>
         </value-group>
      </module>
      <module name="SERCOM"
              id="U2201"
              version="5.0.0"
              caption="Serial Communication Interface">
         <register-group name="SERCOM" caption="Serial Communication Interface">
            <mode name="I2CM"
                  qualifier="SERCOM.I2CM_CTRLA.MODE"
                  value="5"
                  caption="I2C Master Mode"/>
            <mode name="I2CS"
                  qualifier="SERCOM.I2CS_CTRLA.MODE"
                  value="4"
                  caption="I2C Slave Mode"/>
            <mode name="SPIS"
                  qualifier="SERCOM.SPIS_CTRLA.MODE"
                  mask="6"
                  value="2"
                  caption="SPI Slave Mode"/>
            <mode name="SPIM"
                  qualifier="SERCOM.SPIM_CTRLA.MODE"
                  mask="6"
                  value="3"
                  caption="SPI Master Mode"/>
            <mode name="USART_EXT"
                  qualifier="SERCOM.USART_CTRLA.MODE"
                  mask="6"
                  value="0"
                  caption="USART EXTERNAL CLOCK Mode"/>
            <mode name="USART_INT"
                  qualifier="SERCOM.USART_CTRLA.MODE"
                  mask="6"
                  value="1"
                  caption="USART INTERNAL CLOCK Mode"/>
            <register modes="I2CM"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="I2CM Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0x1C"
                         values="SERCOM_I2CM_CTRLA__MODE"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x80"/>
               <bitfield name="PINOUT" caption="Pin Usage" mask="0x10000"/>
               <bitfield name="SDAHOLD"
                         caption="SDA Hold Time"
                         mask="0x300000"
                         values="SERCOM_I2CM_CTRLA__SDAHOLD"/>
               <bitfield name="MEXTTOEN"
                         caption="Master SCL Low Extend Timeout"
                         mask="0x400000"/>
               <bitfield name="SEXTTOEN"
                         caption="Slave SCL Low Extend Timeout"
                         mask="0x800000"/>
               <bitfield name="SPEED"
                         caption="Transfer Speed"
                         mask="0x3000000"
                         values="SERCOM_I2CM_CTRLA__SPEED"/>
               <bitfield name="SCLSM" caption="SCL Clock Stretch Mode" mask="0x8000000"/>
               <bitfield name="INACTOUT"
                         caption="Inactive Time-Out"
                         mask="0x30000000"
                         values="SERCOM_I2CM_CTRLA__INACTOUT"/>
               <bitfield name="LOWTOUTEN" caption="SCL Low Timeout Enable" mask="0x40000000"/>
            </register>
            <register modes="I2CS"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="I2CS Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0x1C"
                         values="SERCOM_I2CM_CTRLA__MODE"/>
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
               <bitfield name="PINOUT" caption="Pin Usage" mask="0x10000"/>
               <bitfield name="SDAHOLD"
                         caption="SDA Hold Time"
                         mask="0x300000"
                         values="SERCOM_I2CM_CTRLA__SDAHOLD"/>
               <bitfield name="SEXTTOEN"
                         caption="Slave SCL Low Extend Timeout"
                         mask="0x800000"/>
               <bitfield name="SPEED"
                         caption="Transfer Speed"
                         mask="0x3000000"
                         values="SERCOM_I2CM_CTRLA__SPEED"/>
               <bitfield name="SCLSM" caption="SCL Clock Stretch Mode" mask="0x8000000"/>
               <bitfield name="LOWTOUTEN" caption="SCL Low Timeout Enable" mask="0x40000000"/>
            </register>
            <register modes="SPIM"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="SPIM Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0x1C"
                         values="SERCOM_SPIM_CTRLA__MODE"/>
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
               <bitfield name="IBON"
                         caption="Immediate Buffer Overflow Notification"
                         mask="0x100"/>
               <bitfield name="DOPO"
                         caption="Data Out Pinout"
                         mask="0x30000"
                         values="SERCOM_SPIM_CTRLA__DOPO"/>
               <bitfield name="DIPO"
                         caption="Data In Pinout"
                         mask="0x300000"
                         values="SERCOM_SPIM_CTRLA__DIPO"/>
               <bitfield name="FORM"
                         caption="Frame Format"
                         mask="0xF000000"
                         values="SERCOM_SPIM_CTRLA__FORM"/>
               <bitfield name="CPHA"
                         caption="Clock Phase"
                         mask="0x10000000"
                         values="SERCOM_SPIM_CTRLA__CPHA"/>
               <bitfield name="CPOL"
                         caption="Clock Polarity"
                         mask="0x20000000"
                         values="SERCOM_SPIM_CTRLA__CPOL"/>
               <bitfield name="DORD"
                         caption="Data Order"
                         mask="0x40000000"
                         values="SERCOM_SPIM_CTRLA__DORD"/>
            </register>
            <register modes="SPIS"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="SPIS Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0x1C"
                         values="SERCOM_SPIM_CTRLA__MODE"/>
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
               <bitfield name="IBON"
                         caption="Immediate Buffer Overflow Notification"
                         mask="0x100"/>
               <bitfield name="DOPO"
                         caption="Data Out Pinout"
                         mask="0x30000"
                         values="SERCOM_SPIM_CTRLA__DOPO"/>
               <bitfield name="DIPO"
                         caption="Data In Pinout"
                         mask="0x300000"
                         values="SERCOM_SPIM_CTRLA__DIPO"/>
               <bitfield name="FORM"
                         caption="Frame Format"
                         mask="0xF000000"
                         values="SERCOM_SPIM_CTRLA__FORM"/>
               <bitfield name="CPHA"
                         caption="Clock Phase"
                         mask="0x10000000"
                         values="SERCOM_SPIM_CTRLA__CPHA"/>
               <bitfield name="CPOL"
                         caption="Clock Polarity"
                         mask="0x20000000"
                         values="SERCOM_SPIM_CTRLA__CPOL"/>
               <bitfield name="DORD"
                         caption="Data Order"
                         mask="0x40000000"
                         values="SERCOM_SPIM_CTRLA__DORD"/>
            </register>
            <register modes="USART_EXT"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="USART_EXT Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0x1C"
                         values="SERCOM_USART_CTRLA__MODE"/>
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
               <bitfield name="IBON"
                         caption="Immediate Buffer Overflow Notification"
                         mask="0x100"/>
               <bitfield name="TXINV" caption="Transmit Data Invert" mask="0x200"/>
               <bitfield name="RXINV" caption="Receive Data Invert" mask="0x400"/>
               <bitfield name="SAMPR"
                         caption="Sample"
                         mask="0xE000"
                         values="SERCOM_USART_CTRLA__SAMPR"/>
               <bitfield name="TXPO"
                         caption="Transmit Data Pinout"
                         mask="0x30000"
                         values="SERCOM_USART_CTRLA__TXPO"/>
               <bitfield name="RXPO"
                         caption="Receive Data Pinout"
                         mask="0x300000"
                         values="SERCOM_USART_CTRLA__RXPO"/>
               <bitfield name="SAMPA"
                         caption="Sample Adjustment"
                         mask="0xC00000"
                         values="SERCOM_USART_CTRLA__SAMPA"/>
               <bitfield name="FORM"
                         caption="Frame Format"
                         mask="0xF000000"
                         values="SERCOM_USART_CTRLA__FORM"/>
               <bitfield name="CMODE"
                         caption="Communication Mode"
                         mask="0x10000000"
                         values="SERCOM_USART_CTRLA__CMODE"/>
               <bitfield name="CPOL"
                         caption="Clock Polarity"
                         mask="0x20000000"
                         values="SERCOM_USART_CTRLA__CPOL"/>
               <bitfield name="DORD"
                         caption="Data Order"
                         mask="0x40000000"
                         values="SERCOM_USART_CTRLA__DORD"/>
            </register>
            <register modes="USART_INT"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="USART_INT Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0x1C"
                         values="SERCOM_USART_CTRLA__MODE"/>
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
               <bitfield name="IBON"
                         caption="Immediate Buffer Overflow Notification"
                         mask="0x100"/>
               <bitfield name="TXINV" caption="Transmit Data Invert" mask="0x200"/>
               <bitfield name="RXINV" caption="Receive Data Invert" mask="0x400"/>
               <bitfield name="SAMPR"
                         caption="Sample"
                         mask="0xE000"
                         values="SERCOM_USART_CTRLA__SAMPR"/>
               <bitfield name="TXPO"
                         caption="Transmit Data Pinout"
                         mask="0x30000"
                         values="SERCOM_USART_CTRLA__TXPO"/>
               <bitfield name="RXPO"
                         caption="Receive Data Pinout"
                         mask="0x300000"
                         values="SERCOM_USART_CTRLA__RXPO"/>
               <bitfield name="SAMPA"
                         caption="Sample Adjustment"
                         mask="0xC00000"
                         values="SERCOM_USART_CTRLA__SAMPA"/>
               <bitfield name="FORM"
                         caption="Frame Format"
                         mask="0xF000000"
                         values="SERCOM_USART_CTRLA__FORM"/>
               <bitfield name="CMODE"
                         caption="Communication Mode"
                         mask="0x10000000"
                         values="SERCOM_USART_CTRLA__CMODE"/>
               <bitfield name="CPOL"
                         caption="Clock Polarity"
                         mask="0x20000000"
                         values="SERCOM_USART_CTRLA__CPOL"/>
               <bitfield name="DORD"
                         caption="Data Order"
                         mask="0x40000000"
                         values="SERCOM_USART_CTRLA__DORD"/>
            </register>
