ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register modes="I2CM"
                      name="CTRLB"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="I2CM Control B">
               <bitfield name="SMEN" caption="Smart Mode Enable" mask="0x100"/>
               <bitfield name="QCEN" caption="Quick Command Enable" mask="0x200"/>
               <bitfield name="CMD" caption="Command" mask="0x30000"/>
               <bitfield name="ACKACT" caption="Acknowledge Action" mask="0x40000"/>
            </register>
            <register modes="I2CS"
                      name="CTRLB"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="I2CS Control B">
               <bitfield name="SMEN" caption="Smart Mode Enable" mask="0x100"/>
               <bitfield name="GCMD" caption="PMBus Group Command" mask="0x200"/>
               <bitfield name="AACKEN" caption="Automatic Address Acknowledge" mask="0x400"/>
               <bitfield name="AMODE"
                         caption="Address Mode"
                         mask="0xC000"
                         values="SERCOM_I2CS_CTRLB__AMODE"/>
               <bitfield name="CMD" caption="Command" mask="0x30000"/>
               <bitfield name="ACKACT" caption="Acknowledge Action" mask="0x40000"/>
            </register>
            <register modes="SPIM"
                      name="CTRLB"
                      offset="0x4"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="SPIM Control B">
               <bitfield name="CHSIZE"
                         caption="Character Size"
                         mask="0x7"
                         values="SERCOM_SPIM_CTRLB__CHSIZE"/>
               <bitfield name="PLOADEN" caption="Data Preload Enable" mask="0x40"/>
               <bitfield name="SSDE" caption="Slave Select Low Detect Enable" mask="0x200"/>
               <bitfield name="MSSEN" caption="Master Slave Select Enable" mask="0x2000"/>
               <bitfield name="AMODE"
                         caption="Address Mode"
                         mask="0xC000"
                         values="SERCOM_SPIM_CTRLB__AMODE"/>
               <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
            </register>
            <register modes="SPIS"
                      name="CTRLB"
                      offset="0x4"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="SPIS Control B">
               <bitfield name="CHSIZE"
                         caption="Character Size"
                         mask="0x7"
                         values="SERCOM_SPIM_CTRLB__CHSIZE"/>
               <bitfield name="PLOADEN" caption="Data Preload Enable" mask="0x40"/>
               <bitfield name="SSDE" caption="Slave Select Low Detect Enable" mask="0x200"/>
               <bitfield name="MSSEN" caption="Master Slave Select Enable" mask="0x2000"/>
               <bitfield name="AMODE"
                         caption="Address Mode"
                         mask="0xC000"
                         values="SERCOM_SPIM_CTRLB__AMODE"/>
               <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
            </register>
            <register modes="USART_EXT"
                      name="CTRLB"
                      offset="0x4"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="USART_EXT Control B">
               <bitfield name="CHSIZE"
                         caption="Character Size"
                         mask="0x7"
                         values="SERCOM_USART_CTRLB__CHSIZE"/>
               <bitfield name="SBMODE"
                         caption="Stop Bit Mode"
                         mask="0x40"
                         values="SERCOM_USART_CTRLB__SBMODE"/>
               <bitfield name="COLDEN" caption="Collision Detection Enable" mask="0x100"/>
               <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200"/>
               <bitfield name="ENC" caption="Encoding Format" mask="0x400"/>
               <bitfield name="PMODE"
                         caption="Parity Mode"
                         mask="0x2000"
                         values="SERCOM_USART_CTRLB__PMODE"/>
               <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000"/>
               <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
               <bitfield name="LINCMD"
                         caption="LIN Command"
                         mask="0x3000000"
                         values="SERCOM_USART_CTRLB__LINCMD"/>
            </register>
            <register modes="USART_INT"
                      name="CTRLB"
                      offset="0x4"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="USART_INT Control B">
               <bitfield name="CHSIZE"
                         caption="Character Size"
                         mask="0x7"
                         values="SERCOM_USART_CTRLB__CHSIZE"/>
               <bitfield name="SBMODE"
                         caption="Stop Bit Mode"
                         mask="0x40"
                         values="SERCOM_USART_CTRLB__SBMODE"/>
               <bitfield name="COLDEN" caption="Collision Detection Enable" mask="0x100"/>
               <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200"/>
               <bitfield name="ENC" caption="Encoding Format" mask="0x400"/>
               <bitfield name="PMODE"
                         caption="Parity Mode"
                         mask="0x2000"
                         values="SERCOM_USART_CTRLB__PMODE"/>
               <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000"/>
               <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
               <bitfield name="LINCMD"
                         caption="LIN Command"
                         mask="0x3000000"
                         values="SERCOM_USART_CTRLB__LINCMD"/>
            </register>
