ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register modes="I2CM"
                      name="CTRLC"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="I2CM Control C">
               <bitfield name="DATA32B"
                         caption="Data 32 Bit"
                         mask="0x1000000"
                         values="SERCOM_I2CM_CTRLC__DATA32B"/>
            </register>
            <register modes="I2CS"
                      name="CTRLC"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="I2CS Control C">
               <bitfield name="SDASETUP" caption="SDA Setup Time" mask="0xF"/>
               <bitfield name="DATA32B"
                         caption="Data 32 Bit"
                         mask="0x1000000"
                         values="SERCOM_I2CM_CTRLC__DATA32B"/>
            </register>
            <register modes="SPIM"
                      name="CTRLC"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="SPIM Control C">
               <bitfield name="ICSPACE" caption="Inter-Character Spacing" mask="0x3F"/>
               <bitfield name="DATA32B"
                         caption="Data 32 Bit"
                         mask="0x1000000"
                         values="SERCOM_SPIM_CTRLC__DATA32B"/>
            </register>
            <register modes="SPIS"
                      name="CTRLC"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="SPIS Control C">
               <bitfield name="ICSPACE" caption="Inter-Character Spacing" mask="0x3F"/>
               <bitfield name="DATA32B"
                         caption="Data 32 Bit"
                         mask="0x1000000"
                         values="SERCOM_SPIM_CTRLC__DATA32B"/>
            </register>
            <register modes="USART_EXT"
                      name="CTRLC"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="USART_EXT Control C">
               <bitfield name="GTIME" caption="Guard Time" mask="0x7"/>
               <bitfield name="BRKLEN"
                         caption="LIN Master Break Length"
                         mask="0x300"
                         values="SERCOM_USART_CTRLC__BRKLEN"/>
               <bitfield name="HDRDLY"
                         caption="LIN Master Header Delay"
                         mask="0xC00"
                         values="SERCOM_USART_CTRLC__HDRDLY"/>
               <bitfield name="INACK" caption="Inhibit Not Acknowledge" mask="0x10000"/>
               <bitfield name="DSNACK" caption="Disable Successive NACK" mask="0x20000"/>
               <bitfield name="MAXITER" caption="Maximum Iterations" mask="0x700000"/>
               <bitfield name="DATA32B"
                         caption="Data 32 Bit"
                         mask="0x3000000"
                         values="SERCOM_USART_CTRLC__DATA32B"/>
            </register>
            <register modes="USART_INT"
                      name="CTRLC"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="USART_INT Control C">
               <bitfield name="GTIME" caption="Guard Time" mask="0x7"/>
               <bitfield name="BRKLEN"
                         caption="LIN Master Break Length"
                         mask="0x300"
                         values="SERCOM_USART_CTRLC__BRKLEN"/>
               <bitfield name="HDRDLY"
                         caption="LIN Master Header Delay"
                         mask="0xC00"
                         values="SERCOM_USART_CTRLC__HDRDLY"/>
               <bitfield name="INACK" caption="Inhibit Not Acknowledge" mask="0x10000"/>
               <bitfield name="DSNACK" caption="Disable Successive NACK" mask="0x20000"/>
               <bitfield name="MAXITER" caption="Maximum Iterations" mask="0x700000"/>
               <bitfield name="DATA32B"
                         caption="Data 32 Bit"
                         mask="0x3000000"
                         values="SERCOM_USART_CTRLC__DATA32B"/>
            </register>
            <register modes="I2CM"
                      name="BAUD"
                      offset="0xC"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="I2CM Baud Rate">
               <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
               <bitfield name="BAUDLOW" caption="Baud Rate Value Low" mask="0xFF00"/>
               <bitfield name="HSBAUD" caption="High Speed Baud Rate Value" mask="0xFF0000"/>
               <bitfield name="HSBAUDLOW"
                         caption="High Speed Baud Rate Value Low"
                         mask="0xFF000000"/>
            </register>
            <register modes="SPIM"
                      name="BAUD"
                      offset="0xC"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="SPIM Baud Rate">
               <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
            </register>
            <register modes="SPIS"
                      name="BAUD"
                      offset="0xC"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="SPIS Baud Rate">
               <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
            </register>
            <register modes="USART_EXT"
                      name="BAUD"
                      offset="0xC"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USART_EXT Baud Rate">
               <mode name="DEFAULT"/>
               <mode name="FRAC"/>
               <mode name="FRACFP"/>
               <mode name="USARTFP"/>
               <bitfield modes="FRAC FRACFP"
                         name="BAUD"
                         caption="Baud Rate Value"
                         mask="0x1FFF"/>
               <bitfield modes="FRAC FRACFP"
                         name="FP"
                         caption="Fractional Part"
                         mask="0xE000"/>
               <bitfield modes="DEFAULT USARTFP"
                         name="BAUD"
                         caption="Baud Rate Value"
                         mask="0xFFFF"/>
            </register>
            <register modes="USART_INT"
                      name="BAUD"
                      offset="0xC"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USART_INT Baud Rate">
               <mode name="DEFAULT"/>
               <mode name="FRAC"/>
               <mode name="FRACFP"/>
               <mode name="USARTFP"/>
               <bitfield modes="FRAC FRACFP"
                         name="BAUD"
                         caption="Baud Rate Value"
                         mask="0x1FFF"/>
               <bitfield modes="FRAC FRACFP"
                         name="FP"
                         caption="Fractional Part"
                         mask="0xE000"/>
               <bitfield modes="DEFAULT USARTFP"
                         name="BAUD"
                         caption="Baud Rate Value"
                         mask="0xFFFF"/>
            </register>
            <register modes="USART_EXT"
                      name="RXPL"
                      offset="0xE"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="USART_EXT Receive Pulse Length">
               <bitfield name="RXPL" caption="Receive Pulse Length" mask="0xFF"/>
            </register>
            <register modes="USART_INT"
                      name="RXPL"
                      offset="0xE"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="USART_INT Receive Pulse Length">
               <bitfield name="RXPL" caption="Receive Pulse Length" mask="0xFF"/>
            </register>
