ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register modes="I2CM"
                      name="INTENCLR"
                      offset="0x14"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="I2CM Interrupt Enable Clear">
               <bitfield name="MB" caption="Master On Bus Interrupt Disable" mask="0x1"/>
               <bitfield name="SB" caption="Slave On Bus Interrupt Disable" mask="0x2"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80"/>
            </register>
            <register modes="I2CS"
                      name="INTENCLR"
                      offset="0x14"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="I2CS Interrupt Enable Clear">
               <bitfield name="PREC" caption="Stop Received Interrupt Disable" mask="0x1"/>
               <bitfield name="AMATCH" caption="Address Match Interrupt Disable" mask="0x2"/>
               <bitfield name="DRDY" caption="Data Interrupt Disable" mask="0x4"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80"/>
            </register>
            <register modes="SPIM"
                      name="INTENCLR"
                      offset="0x14"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="SPIM Interrupt Enable Clear">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Disable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Disable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Disable" mask="0x4"/>
               <bitfield name="SSL" caption="Slave Select Low Interrupt Disable" mask="0x8"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80"/>
            </register>
            <register modes="SPIS"
                      name="INTENCLR"
                      offset="0x14"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="SPIS Interrupt Enable Clear">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Disable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Disable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Disable" mask="0x4"/>
               <bitfield name="SSL" caption="Slave Select Low Interrupt Disable" mask="0x8"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80"/>
            </register>
            <register modes="USART_EXT"
                      name="INTENCLR"
                      offset="0x14"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="USART_EXT Interrupt Enable Clear">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Disable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Disable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Disable" mask="0x4"/>
               <bitfield name="RXS" caption="Receive Start Interrupt Disable" mask="0x8"/>
               <bitfield name="CTSIC"
                         caption="Clear To Send Input Change Interrupt Disable"
                         mask="0x10"/>
               <bitfield name="RXBRK" caption="Break Received Interrupt Disable" mask="0x20"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80"/>
            </register>
            <register modes="USART_INT"
                      name="INTENCLR"
                      offset="0x14"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="USART_INT Interrupt Enable Clear">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Disable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Disable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Disable" mask="0x4"/>
               <bitfield name="RXS" caption="Receive Start Interrupt Disable" mask="0x8"/>
               <bitfield name="CTSIC"
                         caption="Clear To Send Input Change Interrupt Disable"
                         mask="0x10"/>
               <bitfield name="RXBRK" caption="Break Received Interrupt Disable" mask="0x20"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80"/>
            </register>
            <register modes="I2CM"
                      name="INTENSET"
                      offset="0x16"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="I2CM Interrupt Enable Set">
               <bitfield name="MB" caption="Master On Bus Interrupt Enable" mask="0x1"/>
               <bitfield name="SB" caption="Slave On Bus Interrupt Enable" mask="0x2"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Enable" mask="0x80"/>
            </register>
            <register modes="I2CS"
                      name="INTENSET"
                      offset="0x16"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="I2CS Interrupt Enable Set">
               <bitfield name="PREC" caption="Stop Received Interrupt Enable" mask="0x1"/>
               <bitfield name="AMATCH" caption="Address Match Interrupt Enable" mask="0x2"/>
               <bitfield name="DRDY" caption="Data Interrupt Enable" mask="0x4"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Enable" mask="0x80"/>
            </register>
            <register modes="SPIM"
                      name="INTENSET"
                      offset="0x16"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="SPIM Interrupt Enable Set">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
               <bitfield name="SSL" caption="Slave Select Low Interrupt Enable" mask="0x8"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Enable" mask="0x80"/>
            </register>
            <register modes="SPIS"
                      name="INTENSET"
                      offset="0x16"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="SPIS Interrupt Enable Set">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
               <bitfield name="SSL" caption="Slave Select Low Interrupt Enable" mask="0x8"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Enable" mask="0x80"/>
            </register>
            <register modes="USART_EXT"
                      name="INTENSET"
                      offset="0x16"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="USART_EXT Interrupt Enable Set">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
               <bitfield name="RXS" caption="Receive Start Interrupt Enable" mask="0x8"/>
               <bitfield name="CTSIC"
                         caption="Clear To Send Input Change Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="RXBRK" caption="Break Received Interrupt Enable" mask="0x20"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Enable" mask="0x80"/>
            </register>
            <register modes="USART_INT"
                      name="INTENSET"
                      offset="0x16"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="USART_INT Interrupt Enable Set">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
               <bitfield name="RXS" caption="Receive Start Interrupt Enable" mask="0x8"/>
               <bitfield name="CTSIC"
                         caption="Clear To Send Input Change Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="RXBRK" caption="Break Received Interrupt Enable" mask="0x20"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Enable" mask="0x80"/>
            </register>
