ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register modes="I2CM"
                      name="INTFLAG"
                      offset="0x18"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="I2CM Interrupt Flag Status and Clear">
               <bitfield name="MB" caption="Master On Bus Interrupt" mask="0x1"/>
               <bitfield name="SB" caption="Slave On Bus Interrupt" mask="0x2"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt" mask="0x80"/>
            </register>
            <register modes="I2CS"
                      name="INTFLAG"
                      offset="0x18"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="I2CS Interrupt Flag Status and Clear">
               <bitfield name="PREC" caption="Stop Received Interrupt" mask="0x1"/>
               <bitfield name="AMATCH" caption="Address Match Interrupt" mask="0x2"/>
               <bitfield name="DRDY" caption="Data Interrupt" mask="0x4"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt" mask="0x80"/>
            </register>
            <register modes="SPIM"
                      name="INTFLAG"
                      offset="0x18"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="SPIM Interrupt Flag Status and Clear">
               <bitfield name="DRE" caption="Data Register Empty Interrupt" mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt" mask="0x4"/>
               <bitfield name="SSL" caption="Slave Select Low Interrupt Flag" mask="0x8"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt" mask="0x80"/>
            </register>
            <register modes="SPIS"
                      name="INTFLAG"
                      offset="0x18"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="SPIS Interrupt Flag Status and Clear">
               <bitfield name="DRE" caption="Data Register Empty Interrupt" mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt" mask="0x4"/>
               <bitfield name="SSL" caption="Slave Select Low Interrupt Flag" mask="0x8"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt" mask="0x80"/>
            </register>
            <register modes="USART_EXT"
                      name="INTFLAG"
                      offset="0x18"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="USART_EXT Interrupt Flag Status and Clear">
               <bitfield name="DRE" caption="Data Register Empty Interrupt" mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt" mask="0x4"/>
               <bitfield name="RXS" caption="Receive Start Interrupt" mask="0x8"/>
               <bitfield name="CTSIC"
                         caption="Clear To Send Input Change Interrupt"
                         mask="0x10"/>
               <bitfield name="RXBRK" caption="Break Received Interrupt" mask="0x20"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt" mask="0x80"/>
            </register>
            <register modes="USART_INT"
                      name="INTFLAG"
                      offset="0x18"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="USART_INT Interrupt Flag Status and Clear">
               <bitfield name="DRE" caption="Data Register Empty Interrupt" mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt" mask="0x4"/>
               <bitfield name="RXS" caption="Receive Start Interrupt" mask="0x8"/>
               <bitfield name="CTSIC"
                         caption="Clear To Send Input Change Interrupt"
                         mask="0x10"/>
               <bitfield name="RXBRK" caption="Break Received Interrupt" mask="0x20"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt" mask="0x80"/>
            </register>
            <register modes="I2CM"
                      name="STATUS"
                      offset="0x1A"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="I2CM Status">
               <bitfield name="BUSERR" caption="Bus Error" mask="0x1"/>
               <bitfield name="ARBLOST" caption="Arbitration Lost" mask="0x2"/>
               <bitfield name="RXNACK" caption="Received Not Acknowledge" mask="0x4"/>
               <bitfield name="BUSSTATE"
                         caption="Bus State"
                         mask="0x30"
                         values="SERCOM_I2CM_STATUS__BUSSTATE"/>
               <bitfield name="LOWTOUT" caption="SCL Low Timeout" mask="0x40"/>
               <bitfield name="CLKHOLD" caption="Clock Hold" mask="0x80"/>
               <bitfield name="MEXTTOUT"
                         caption="Master SCL Low Extend Timeout"
                         mask="0x100"/>
               <bitfield name="SEXTTOUT" caption="Slave SCL Low Extend Timeout" mask="0x200"/>
               <bitfield name="LENERR" caption="Length Error" mask="0x400"/>
            </register>
            <register modes="I2CS"
                      name="STATUS"
                      offset="0x1A"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="I2CS Status">
               <bitfield name="BUSERR" caption="Bus Error" mask="0x1"/>
               <bitfield name="COLL" caption="Transmit Collision" mask="0x2"/>
               <bitfield name="RXNACK" caption="Received Not Acknowledge" mask="0x4"/>
               <bitfield name="DIR" caption="Read/Write Direction" mask="0x8"/>
               <bitfield name="SR" caption="Repeated Start" mask="0x10"/>
               <bitfield name="LOWTOUT" caption="SCL Low Timeout" mask="0x40"/>
               <bitfield name="CLKHOLD" caption="Clock Hold" mask="0x80"/>
               <bitfield name="SEXTTOUT" caption="Slave SCL Low Extend Timeout" mask="0x200"/>
               <bitfield name="HS" caption="High Speed" mask="0x400"/>
               <bitfield name="LENERR" caption="Transaction Length Error" mask="0x800"/>
            </register>
            <register modes="SPIM"
                      name="STATUS"
                      offset="0x1A"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="SPIM Status">
               <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
               <bitfield name="LENERR" caption="Transaction Length Error" mask="0x800"/>
            </register>
            <register modes="SPIS"
                      name="STATUS"
                      offset="0x1A"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="SPIS Status">
               <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
               <bitfield name="LENERR" caption="Transaction Length Error" mask="0x800"/>
            </register>
            <register modes="USART_EXT"
                      name="STATUS"
                      offset="0x1A"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USART_EXT Status">
               <bitfield name="PERR" caption="Parity Error" mask="0x1"/>
               <bitfield name="FERR" caption="Frame Error" mask="0x2"/>
               <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
               <bitfield name="CTS" caption="Clear To Send" mask="0x8"/>
               <bitfield name="ISF" caption="Inconsistent Sync Field" mask="0x10"/>
               <bitfield name="COLL" caption="Collision Detected" mask="0x20"/>
               <bitfield name="TXE" caption="Transmitter Empty" mask="0x40"/>
               <bitfield name="ITER"
                         caption="Maximum Number of Repetitions Reached"
                         mask="0x80"/>
            </register>
            <register modes="USART_INT"
                      name="STATUS"
                      offset="0x1A"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USART_INT Status">
               <bitfield name="PERR" caption="Parity Error" mask="0x1"/>
               <bitfield name="FERR" caption="Frame Error" mask="0x2"/>
               <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
               <bitfield name="CTS" caption="Clear To Send" mask="0x8"/>
               <bitfield name="ISF" caption="Inconsistent Sync Field" mask="0x10"/>
               <bitfield name="COLL" caption="Collision Detected" mask="0x20"/>
               <bitfield name="TXE" caption="Transmitter Empty" mask="0x40"/>
               <bitfield name="ITER"
                         caption="Maximum Number of Repetitions Reached"
                         mask="0x80"/>
            </register>
