ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register modes="I2CM"
                      name="SYNCBUSY"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="I2CM Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Busy"
                         mask="0x1"/>
               <bitfield name="ENABLE"
                         caption="SERCOM Enable Synchronization Busy"
                         mask="0x2"/>
               <bitfield name="SYSOP"
                         caption="System Operation Synchronization Busy"
                         mask="0x4"/>
            </register>
            <register modes="I2CS"
                      name="SYNCBUSY"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="I2CS Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Busy"
                         mask="0x1"/>
               <bitfield name="ENABLE"
                         caption="SERCOM Enable Synchronization Busy"
                         mask="0x2"/>
               <bitfield name="LENGTH" caption="Length Synchronization Busy" mask="0x10"/>
            </register>
            <register modes="SPIM"
                      name="SYNCBUSY"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="SPIM Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Busy"
                         mask="0x1"/>
               <bitfield name="ENABLE"
                         caption="SERCOM Enable Synchronization Busy"
                         mask="0x2"/>
               <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
               <bitfield name="LENGTH" caption="LENGTH Synchronization Busy" mask="0x10"/>
            </register>
            <register modes="SPIS"
                      name="SYNCBUSY"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="SPIS Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Busy"
                         mask="0x1"/>
               <bitfield name="ENABLE"
                         caption="SERCOM Enable Synchronization Busy"
                         mask="0x2"/>
               <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
               <bitfield name="LENGTH" caption="LENGTH Synchronization Busy" mask="0x10"/>
            </register>
            <register modes="USART_EXT"
                      name="SYNCBUSY"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="USART_EXT Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Busy"
                         mask="0x1"/>
               <bitfield name="ENABLE"
                         caption="SERCOM Enable Synchronization Busy"
                         mask="0x2"/>
               <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
               <bitfield name="RXERRCNT" caption="RXERRCNT Synchronization Busy" mask="0x8"/>
               <bitfield name="LENGTH" caption="LENGTH Synchronization Busy" mask="0x10"/>
            </register>
            <register modes="USART_INT"
                      name="SYNCBUSY"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="USART_INT Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Busy"
                         mask="0x1"/>
               <bitfield name="ENABLE"
                         caption="SERCOM Enable Synchronization Busy"
                         mask="0x2"/>
               <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
               <bitfield name="RXERRCNT" caption="RXERRCNT Synchronization Busy" mask="0x8"/>
               <bitfield name="LENGTH" caption="LENGTH Synchronization Busy" mask="0x10"/>
            </register>
            <register modes="USART_EXT"
                      name="RXERRCNT"
                      offset="0x20"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="USART_EXT Receive Error Count">
               <bitfield name="RXERRCNT" caption="Receive Error Count" mask="0xFF"/>
            </register>
            <register modes="USART_INT"
                      name="RXERRCNT"
                      offset="0x20"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="USART_INT Receive Error Count">
               <bitfield name="RXERRCNT" caption="Receive Error Count" mask="0xFF"/>
            </register>
            <register modes="I2CS"
                      name="LENGTH"
                      offset="0x22"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="I2CS Length">
               <bitfield name="LEN" caption="Data Length" mask="0xFF"/>
               <bitfield name="LENEN" caption="Data Length Enable" mask="0x100"/>
            </register>
            <register modes="SPIM"
                      name="LENGTH"
                      offset="0x22"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="SPIM Length">
               <bitfield name="LEN" caption="Data Length" mask="0xFF"/>
               <bitfield name="LENEN" caption="Data Length Enable" mask="0x100"/>
            </register>
            <register modes="SPIS"
                      name="LENGTH"
                      offset="0x22"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="SPIS Length">
               <bitfield name="LEN" caption="Data Length" mask="0xFF"/>
               <bitfield name="LENEN" caption="Data Length Enable" mask="0x100"/>
            </register>
            <register modes="USART_EXT"
                      name="LENGTH"
                      offset="0x22"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USART_EXT Length">
               <bitfield name="LEN" caption="Data Length" mask="0xFF"/>
               <bitfield name="LENEN" caption="Data Length Enable" mask="0x300"/>
            </register>
            <register modes="USART_INT"
                      name="LENGTH"
                      offset="0x22"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USART_INT Length">
               <bitfield name="LEN" caption="Data Length" mask="0xFF"/>
               <bitfield name="LENEN" caption="Data Length Enable" mask="0x300"/>
            </register>
