ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="SERCOM_USART_CTRLA__SAMPA">
            <value name="ADJ0"
                   caption="16x Over-sampling = 7-8-9; 8x Over-sampling = 3-4-5"
                   value="0x0"/>
            <value name="ADJ1"
                   caption="16x Over-sampling = 9-10-11; 8x Over-sampling = 4-5-6"
                   value="0x1"/>
            <value name="ADJ2"
                   caption="16x Over-sampling = 11-12-13; 8x Over-sampling = 5-6-7"
                   value="0x2"/>
            <value name="ADJ3"
                   caption="16x Over-sampling = 13-14-15; 8x Over-sampling = 6-7-8"
                   value="0x3"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLB__CHSIZE">
            <value name="8_BIT" caption="8 Bits" value="0x0"/>
            <value name="9_BIT" caption="9 Bits" value="0x1"/>
            <value name="5_BIT" caption="5 Bits" value="0x5"/>
            <value name="6_BIT" caption="6 Bits" value="0x6"/>
            <value name="7_BIT" caption="7 Bits" value="0x7"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLB__PMODE">
            <value name="EVEN" caption="Even Parity" value="0x0"/>
            <value name="ODD" caption="Odd Parity" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLB__SBMODE">
            <value name="1_BIT" caption="One Stop Bit" value="0x0"/>
            <value name="2_BIT" caption="Two Stop Bits" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLB__LINCMD">
            <value name="NONE" caption="Normal USART transmission" value="0x0"/>
            <value name="SOFTWARE_CONTROL_TRANSMIT_CMD"
                   caption="Break field is transmitted when DATA is written"
                   value="0x1"/>
            <value name="AUTO_TRANSMIT_CMD"
                   caption="Break, sync and identifier are automatically transmitted when DATA is written with the identifier"
                   value="0x2"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLC__BRKLEN">
            <value name="13_BIT"
                   caption="Break field transmission is 13 bit times"
                   value="0x0"/>
            <value name="17_BIT"
                   caption="Break field transmission is 17 bit times"
                   value="0x1"/>
            <value name="21_BIT"
                   caption="Break field transmission is 21 bit times"
                   value="0x2"/>
            <value name="26_BIT"
                   caption="Break field transmission is 26 bit times"
                   value="0x3"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLC__DATA32B">
            <value name="DATA_READ_WRITE_CHSIZE"
                   caption="Data reads and writes according CTRLB.CHSIZE"
                   value="0x0"/>
            <value name="DATA_READ_CHSIZE_WRITE_32BIT"
                   caption="Data reads according CTRLB.CHSIZE and writes according 32-bit extension"
                   value="0x1"/>
            <value name="DATA_READ_32BIT_WRITE_CHSIZE"
                   caption="Data reads according 32-bit extension and writes according CTRLB.CHSIZE"
                   value="0x2"/>
            <value name="DATA_READ_WRITE_32BIT"
                   caption="Data reads and writes according 32-bit extension"
                   value="0x3"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLC__HDRDLY">
            <value name="DELAY0"
                   caption="Delay between break and sync transmission is 1 bit time; Delay between sync and ID transmission is 1 bit time"
                   value="0x0"/>
            <value name="DELAY1"
                   caption="Delay between break and sync transmission is 4 bit time; Delay between sync and ID transmission is 4 bit time"
                   value="0x1"/>
            <value name="DELAY2"
                   caption="Delay between break and sync transmission is 8 bit time; Delay between sync and ID transmission is 4 bit time"
                   value="0x2"/>
            <value name="DELAY3"
                   caption="Delay between break and sync transmission is 14 bit time; Delay between sync and ID transmission is 4 bit time"
                   value="0x3"/>
         </value-group>
      </module>
      <module name="SUPC"
              id="U2407"
              version="1.1.0"
              caption="Supply Controller">
         <register-group name="SUPC" caption="Supply Controller">
            <register name="INTENCLR"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTENCLR"
                      initval="0x00000000"
                      caption="Interrupt Enable Clear">
               <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
               <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
               <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
               <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
               <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
            </register>
            <register name="INTENSET"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      atomic-op="set:INTENSET"
                      initval="0x00000000"
                      caption="Interrupt Enable Set">
               <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
               <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
               <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
               <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
               <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
            </register>
            <register name="INTFLAG"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTFLAG"
                      initval="0x00000000"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
               <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
               <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
               <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
               <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
            </register>
            <register name="STATUS"
                      offset="0xC"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Power and Clocks Status">
               <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
               <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
               <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
               <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
               <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
            </register>
            <register name="BOD33"
                      offset="0x10"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="BOD33 Control">
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="ACTION"
                         caption="Action when Threshold Crossed"
                         mask="0xC"
                         values="SUPC_BOD33__ACTION"/>
               <bitfield name="STDBYCFG" caption="Configuration in Standby mode" mask="0x10"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby mode" mask="0x20"/>
               <bitfield name="RUNHIB" caption="Run in Hibernate mode" mask="0x40"/>
               <bitfield name="RUNBKUP" caption="Run in Backup mode" mask="0x80"/>
               <bitfield name="HYST" caption="Hysteresis value" mask="0xF00"/>
               <bitfield name="PSEL"
                         caption="Prescaler Select"
                         mask="0x7000"
                         values="SUPC_BOD33__PSEL"/>
               <bitfield name="LEVEL" caption="Threshold Level for VDD" mask="0xFF0000"/>
               <bitfield name="VBATLEVEL"
                         caption="Threshold Level in battery backup sleep mode for VBAT"
                         mask="0xFF000000"/>
            </register>
