ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="VREG"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      initval="0x00000002"
                      caption="VREG Control">
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="SEL"
                         caption="Voltage Regulator Selection"
                         mask="0x4"
                         values="SUPC_VREG__SEL"/>
               <bitfield name="RUNBKUP" caption="Run in Backup mode" mask="0x80"/>
               <bitfield name="VSEN" caption="Voltage Scaling Enable" mask="0x10000"/>
               <bitfield name="VSPER" caption="Voltage Scaling Period" mask="0x7000000"/>
            </register>
            <register name="VREF"
                      offset="0x1C"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="VREF Control">
               <bitfield name="TSEN" caption="Temperature Sensor Output Enable" mask="0x2"/>
               <bitfield name="VREFOE" caption="Voltage Reference Output Enable" mask="0x4"/>
               <bitfield name="TSSEL" caption="Temperature Sensor Selection" mask="0x8"/>
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="On Demand Contrl" mask="0x80"/>
               <bitfield name="SEL"
                         caption="Voltage Reference Selection"
                         mask="0xF0000"
                         values="SUPC_VREF__SEL"/>
            </register>
            <register name="BBPS"
                      offset="0x20"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Battery Backup Power Switch">
               <bitfield name="CONF"
                         caption="Battery Backup Configuration"
                         mask="0x1"
                         values="SUPC_BBPS__CONF"/>
               <bitfield name="WAKEEN" caption="Wake Enable" mask="0x4"/>
            </register>
            <register name="BKOUT"
                      offset="0x24"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Backup Output Control">
               <bitfield name="ENOUT0" caption="Enable OUT0" mask="0x1"/>
               <bitfield name="ENOUT1" caption="Enable OUT1" mask="0x2"/>
               <bitfield name="CLROUT0" caption="Clear OUT0" mask="0x100"/>
               <bitfield name="CLROUT1" caption="Clear OUT1" mask="0x200"/>
               <bitfield name="SETOUT0" caption="Set OUT0" mask="0x10000"/>
               <bitfield name="SETOUT1" caption="Set OUT1" mask="0x20000"/>
               <bitfield name="RTCTGLOUT0" caption="RTC Toggle OUT0" mask="0x1000000"/>
               <bitfield name="RTCTGLOUT1" caption="RTC Toggle OUT1" mask="0x2000000"/>
            </register>
            <register name="BKIN"
                      offset="0x28"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Backup Input Control">
               <bitfield name="BKIN0" caption="Backup Input 0" mask="0x1"/>
               <bitfield name="BKIN1" caption="Backup Input 1" mask="0x2"/>
            </register>
         </register-group>
         <value-group name="SUPC_BOD33__ACTION">
            <value name="NONE" caption="No action" value="0x0"/>
            <value name="RESET" caption="The BOD33 generates a reset" value="0x1"/>
            <value name="INT" caption="The BOD33 generates an interrupt" value="0x2"/>
            <value name="BKUP"
                   caption="The BOD33 puts the device in backup sleep mode"
                   value="0x3"/>
         </value-group>
         <value-group name="SUPC_BOD33__PSEL">
            <value name="NODIV" caption="Not divided" value="0x0"/>
            <value name="DIV4" caption="Divide clock by 4" value="0x1"/>
            <value name="DIV8" caption="Divide clock by 8" value="0x2"/>
            <value name="DIV16" caption="Divide clock by 16" value="0x3"/>
            <value name="DIV32" caption="Divide clock by 32" value="0x4"/>
            <value name="DIV64" caption="Divide clock by 64" value="0x5"/>
            <value name="DIV128" caption="Divide clock by 128" value="0x6"/>
            <value name="DIV256" caption="Divide clock by 256" value="0x7"/>
         </value-group>
         <value-group name="SUPC_VREG__SEL">
            <value name="LDO" caption="LDO selection" value="0x0"/>
            <value name="BUCK" caption="Buck selection" value="0x1"/>
         </value-group>
         <value-group name="SUPC_VREF__SEL">
            <value name="1V0"
                   caption="1.0V voltage reference typical value"
                   value="0x0"/>
            <value name="1V1"
                   caption="1.1V voltage reference typical value"
                   value="0x1"/>
            <value name="1V2"
                   caption="1.2V voltage reference typical value"
                   value="0x2"/>
            <value name="1V25"
                   caption="1.25V voltage reference typical value"
                   value="0x3"/>
            <value name="2V0"
                   caption="2.0V voltage reference typical value"
                   value="0x4"/>
            <value name="2V2"
                   caption="2.2V voltage reference typical value"
                   value="0x5"/>
            <value name="2V4"
                   caption="2.4V voltage reference typical value"
                   value="0x6"/>
            <value name="2V5"
                   caption="2.5V voltage reference typical value"
                   value="0x7"/>
         </value-group>
         <value-group name="SUPC_BBPS__CONF">
            <value name="BOD33"
                   caption="The power switch is handled by the BOD33"
                   value="0x0"/>
            <value name="FORCED"
                   caption="In Backup Domain, the backup domain is always supplied by battery backup power"
                   value="0x1"/>
         </value-group>
      </module>
      <module name="TC"
              id="U2249"
              version="3.0.0"
              caption="Basic Timer Counter">
         <register-group name="TC" caption="Basic Timer Counter">
            <mode name="COUNT8"
                  qualifier="TC.CTRLA.MODE"
                  value="1"
                  caption="8-bit Counter Mode"/>
            <mode name="COUNT16"
                  qualifier="TC.CTRLA.MODE"
                  value="0"
                  caption="16-bit Counter Mode"/>
            <mode name="COUNT32"
                  qualifier="TC.CTRLA.MODE"
                  value="2"
                  caption="32-bit Counter Mode"/>
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Timer Counter Mode"
                         mask="0xC"
                         values="TC_CTRLA__MODE"/>
               <bitfield name="PRESCSYNC"
                         caption="Prescaler and Counter Synchronization"
                         mask="0x30"
                         values="TC_CTRLA__PRESCSYNC"/>
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="Clock On Demand" mask="0x80"/>
               <bitfield name="PRESCALER"
                         caption="Prescaler"
                         mask="0x700"
                         values="TC_CTRLA__PRESCALER"/>
               <bitfield name="ALOCK" caption="Auto Lock" mask="0x800"/>
               <bitfield name="CAPTEN0" caption="Capture Channel 0 Enable" mask="0x10000"/>
               <bitfield name="CAPTEN1" caption="Capture Channel 1 Enable" mask="0x20000"/>
               <bitfield name="COPEN0" caption="Capture On Pin 0 Enable" mask="0x100000"/>
               <bitfield name="COPEN1" caption="Capture On Pin 1 Enable" mask="0x200000"/>
               <bitfield name="CAPTMODE0"
                         caption="Capture Mode Channel 0"
                         mask="0x3000000"
                         values="TC_CTRLA__CAPTMODE0"/>
               <bitfield name="CAPTMODE1"
                         caption="Capture mode Channel 1"
                         mask="0x18000000"
                         values="TC_CTRLA__CAPTMODE1"/>
            </register>
            <register name="CTRLBCLR"
                      offset="0x4"
                      rw="RW"
                      access="RWSYNC"
                      size="1"
                      atomic-op="clear:CTRLBCLR"
                      initval="0x00"
                      caption="Control B Clear">
               <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
               <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
               <bitfield name="ONESHOT" caption="One-Shot on Counter" mask="0x4"/>
               <bitfield name="CMD"
                         caption="Command"
                         mask="0xE0"
                         values="TC_CTRLBCLR__CMD"/>
            </register>
