ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="PATTBUF"
                      offset="0x64"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Pattern Buffer">
               <bitfield name="PGEB0"
                         caption="Pattern Generator 0 Output Enable Buffer"
                         mask="0x1"/>
               <bitfield name="PGEB1"
                         caption="Pattern Generator 1 Output Enable Buffer"
                         mask="0x2"/>
               <bitfield name="PGEB2"
                         caption="Pattern Generator 2 Output Enable Buffer"
                         mask="0x4"/>
               <bitfield name="PGEB3"
                         caption="Pattern Generator 3 Output Enable Buffer"
                         mask="0x8"/>
               <bitfield name="PGEB4"
                         caption="Pattern Generator 4 Output Enable Buffer"
                         mask="0x10"/>
               <bitfield name="PGEB5"
                         caption="Pattern Generator 5 Output Enable Buffer"
                         mask="0x20"/>
               <bitfield name="PGEB6"
                         caption="Pattern Generator 6 Output Enable Buffer"
                         mask="0x40"/>
               <bitfield name="PGEB7"
                         caption="Pattern Generator 7 Output Enable Buffer"
                         mask="0x80"/>
               <bitfield name="PGVB0"
                         caption="Pattern Generator 0 Output Enable"
                         mask="0x100"/>
               <bitfield name="PGVB1"
                         caption="Pattern Generator 1 Output Enable"
                         mask="0x200"/>
               <bitfield name="PGVB2"
                         caption="Pattern Generator 2 Output Enable"
                         mask="0x400"/>
               <bitfield name="PGVB3"
                         caption="Pattern Generator 3 Output Enable"
                         mask="0x800"/>
               <bitfield name="PGVB4"
                         caption="Pattern Generator 4 Output Enable"
                         mask="0x1000"/>
               <bitfield name="PGVB5"
                         caption="Pattern Generator 5 Output Enable"
                         mask="0x2000"/>
               <bitfield name="PGVB6"
                         caption="Pattern Generator 6 Output Enable"
                         mask="0x4000"/>
               <bitfield name="PGVB7"
                         caption="Pattern Generator 7 Output Enable"
                         mask="0x8000"/>
            </register>
            <register name="PERBUF"
                      offset="0x6C"
                      rw="RW"
                      size="4"
                      initval="0xFFFFFFFF"
                      caption="Period Buffer">
               <mode name="DEFAULT" value="0"/>
               <mode name="DITH4" value="1"/>
               <mode name="DITH5" value="2"/>
               <mode name="DITH6" value="3"/>
               <bitfield modes="DITH4"
                         name="DITHERBUF"
                         caption="Dithering Buffer Cycle Number"
                         mask="0xF"/>
               <bitfield modes="DITH5"
                         name="DITHERBUF"
                         caption="Dithering Buffer Cycle Number"
                         mask="0x1F"/>
               <bitfield modes="DITH6"
                         name="DITHERBUF"
                         caption="Dithering Buffer Cycle Number"
                         mask="0x3F"/>
               <bitfield modes="DITH6"
                         name="PERBUF"
                         caption="Period Buffer Value"
                         mask="0xFFFFC0"/>
               <bitfield modes="DITH5"
                         name="PERBUF"
                         caption="Period Buffer Value"
                         mask="0xFFFFE0"/>
               <bitfield modes="DITH4"
                         name="PERBUF"
                         caption="Period Buffer Value"
                         mask="0xFFFFF0"/>
               <bitfield modes="DEFAULT"
                         name="PERBUF"
                         caption="Period Buffer Value"
                         mask="0xFFFFFF"/>
            </register>
            <register name="CCBUF"
                      offset="0x70"
                      rw="RW"
                      size="4"
                      count="6"
                      initval="0x00000000"
                      caption="Compare and Capture Buffer">
               <mode name="DEFAULT" value="0"/>
               <mode name="DITH4" value="1"/>
               <mode name="DITH5" value="2"/>
               <mode name="DITH6" value="3"/>
               <bitfield modes="DITH4"
                         name="CCBUF"
                         caption="Channel Compare/Capture Buffer Value"
                         mask="0xF"/>
               <bitfield modes="DITH5"
                         name="DITHERBUF"
                         caption="Dithering Buffer Cycle Number"
                         mask="0x1F"/>
               <bitfield modes="DITH6"
                         name="DITHERBUF"
                         caption="Dithering Buffer Cycle Number"
                         mask="0x3F"/>
               <bitfield modes="DITH6"
                         name="CCBUF"
                         caption="Channel Compare/Capture Buffer Value"
                         mask="0xFFFFC0"/>
               <bitfield modes="DITH5"
                         name="CCBUF"
                         caption="Channel Compare/Capture Buffer Value"
                         mask="0xFFFFE0"/>
               <bitfield modes="DITH4"
                         name="DITHERBUF"
                         caption="Dithering Buffer Cycle Number"
                         mask="0xFFFFF0"/>
               <bitfield modes="DEFAULT"
                         name="CCBUF"
                         caption="Channel Compare/Capture Buffer Value"
                         mask="0xFFFFFF"/>
            </register>
         </register-group>
         <value-group name="TCC_CTRLA__PRESCALER">
            <value name="DIV1" caption="No division" value="0"/>
            <value name="DIV2" caption="Divide by 2" value="1"/>
            <value name="DIV4" caption="Divide by 4" value="2"/>
            <value name="DIV8" caption="Divide by 8" value="3"/>
            <value name="DIV16" caption="Divide by 16" value="4"/>
            <value name="DIV64" caption="Divide by 64" value="5"/>
            <value name="DIV256" caption="Divide by 256" value="6"/>
            <value name="DIV1024" caption="Divide by 1024" value="7"/>
         </value-group>
         <value-group name="TCC_CTRLA__PRESCSYNC">
            <value name="GCLK"
                   caption="Reload or reset counter on next GCLK"
                   value="0"/>
            <value name="PRESC"
                   caption="Reload or reset counter on next prescaler clock"
                   value="1"/>
            <value name="RESYNC"
                   caption="Reload or reset counter on next GCLK and reset prescaler counter"
                   value="2"/>
         </value-group>
         <value-group name="TCC_CTRLA__RESOLUTION">
            <value name="NONE" caption="Dithering is disabled" value="0"/>
            <value name="DITH4"
                   caption="Dithering is done every 16 PWM frames"
                   value="1"/>
            <value name="DITH5"
                   caption="Dithering is done every 32 PWM frames"
                   value="2"/>
            <value name="DITH6"
                   caption="Dithering is done every 64 PWM frames"
                   value="3"/>
         </value-group>
