ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="TCC_CTRLBCLR__CMD">
            <value name="NONE" caption="No action" value="0"/>
            <value name="RETRIGGER"
                   caption="Clear start, restart or retrigger"
                   value="1"/>
            <value name="STOP" caption="Force stop" value="2"/>
            <value name="UPDATE"
                   caption="Force update or double buffered registers"
                   value="3"/>
            <value name="READSYNC"
                   caption="Force COUNT read synchronization"
                   value="4"/>
            <value name="DMAOS" caption="One-shot DMA trigger" value="5"/>
         </value-group>
         <value-group name="TCC_CTRLBCLR__IDXCMD">
            <value name="DISABLE"
                   caption="Command disabled: Index toggles between cycles A and B"
                   value="0"/>
            <value name="SET"
                   caption="Set index: cycle B will be forced in the next cycle"
                   value="1"/>
            <value name="CLEAR"
                   caption="Clear index: cycle A will be forced in the next cycle"
                   value="2"/>
            <value name="HOLD"
                   caption="Hold index: the next cycle will be the same as the current cycle"
                   value="3"/>
         </value-group>
         <value-group name="TCC_CTRLBSET__CMD">
            <value name="NONE" caption="No action" value="0"/>
            <value name="RETRIGGER"
                   caption="Clear start, restart or retrigger"
                   value="1"/>
            <value name="STOP" caption="Force stop" value="2"/>
            <value name="UPDATE"
                   caption="Force update or double buffered registers"
                   value="3"/>
            <value name="READSYNC"
                   caption="Force COUNT read synchronization"
                   value="4"/>
            <value name="DMAOS" caption="One-shot DMA trigger" value="5"/>
         </value-group>
         <value-group name="TCC_CTRLBSET__IDXCMD">
            <value name="DISABLE"
                   caption="Command disabled: Index toggles between cycles A and B"
                   value="0"/>
            <value name="SET"
                   caption="Set index: cycle B will be forced in the next cycle"
                   value="1"/>
            <value name="CLEAR"
                   caption="Clear index: cycle A will be forced in the next cycle"
                   value="2"/>
            <value name="HOLD"
                   caption="Hold index: the next cycle will be the same as the current cycle"
                   value="3"/>
         </value-group>
         <value-group name="TCC_FCTRLA__BLANK">
            <value name="START"
                   caption="Blanking applied from start of the ramp"
                   value="0"/>
            <value name="RISE"
                   caption="Blanking applied from rising edge of the output waveform"
                   value="1"/>
            <value name="FALL"
                   caption="Blanking applied from falling edge of the output waveform"
                   value="2"/>
            <value name="BOTH"
                   caption="Blanking applied from each toggle of the output waveform"
                   value="3"/>
         </value-group>
         <value-group name="TCC_FCTRLA__CAPTURE">
            <value name="DISABLE" caption="No capture" value="0"/>
            <value name="CAPT" caption="Capture on fault" value="1"/>
            <value name="CAPTMIN" caption="Minimum capture" value="2"/>
            <value name="CAPTMAX" caption="Maximum capture" value="3"/>
            <value name="LOCMIN" caption="Minimum local detection" value="4"/>
            <value name="LOCMAX" caption="Maximum local detection" value="5"/>
            <value name="DERIV0"
                   caption="Minimum and maximum local detection"
                   value="6"/>
            <value name="CAPTMARK"
                   caption="Capture with ramp index as MSB value"
                   value="7"/>
         </value-group>
         <value-group name="TCC_FCTRLA__CHSEL">
            <value name="CC0" caption="Capture value stored in channel 0" value="0"/>
            <value name="CC1" caption="Capture value stored in channel 1" value="1"/>
            <value name="CC2" caption="Capture value stored in channel 2" value="2"/>
            <value name="CC3" caption="Capture value stored in channel 3" value="3"/>
         </value-group>
         <value-group name="TCC_FCTRLA__HALT">
            <value name="DISABLE" caption="Halt action disabled" value="0"/>
            <value name="HW" caption="Hardware halt action" value="1"/>
            <value name="SW" caption="Software halt action" value="2"/>
            <value name="NR" caption="Non-recoverable fault" value="3"/>
         </value-group>
         <value-group name="TCC_FCTRLA__SRC">
            <value name="DISABLE" caption="Fault input disabled" value="0"/>
            <value name="ENABLE" caption="MCEx (x=0,1) event input" value="1"/>
            <value name="INVERT" caption="Inverted MCEx (x=0,1) event input" value="2"/>
            <value name="ALTFAULT"
                   caption="Alternate fault (A or B) state at the end of the previous period"
                   value="3"/>
         </value-group>
         <value-group name="TCC_FCTRLB__BLANK">
            <value name="START"
                   caption="Blanking applied from start of the ramp"
                   value="0"/>
            <value name="RISE"
                   caption="Blanking applied from rising edge of the output waveform"
                   value="1"/>
            <value name="FALL"
                   caption="Blanking applied from falling edge of the output waveform"
                   value="2"/>
            <value name="BOTH"
                   caption="Blanking applied from each toggle of the output waveform"
                   value="3"/>
         </value-group>
         <value-group name="TCC_FCTRLB__CAPTURE">
            <value name="DISABLE" caption="No capture" value="0"/>
            <value name="CAPT" caption="Capture on fault" value="1"/>
            <value name="CAPTMIN" caption="Minimum capture" value="2"/>
            <value name="CAPTMAX" caption="Maximum capture" value="3"/>
            <value name="LOCMIN" caption="Minimum local detection" value="4"/>
            <value name="LOCMAX" caption="Maximum local detection" value="5"/>
            <value name="DERIV0"
                   caption="Minimum and maximum local detection"
                   value="6"/>
            <value name="CAPTMARK"
                   caption="Capture with ramp index as MSB value"
                   value="7"/>
         </value-group>
         <value-group name="TCC_FCTRLB__CHSEL">
            <value name="CC0" caption="Capture value stored in channel 0" value="0"/>
            <value name="CC1" caption="Capture value stored in channel 1" value="1"/>
            <value name="CC2" caption="Capture value stored in channel 2" value="2"/>
            <value name="CC3" caption="Capture value stored in channel 3" value="3"/>
         </value-group>
         <value-group name="TCC_FCTRLB__HALT">
            <value name="DISABLE" caption="Halt action disabled" value="0"/>
            <value name="HW" caption="Hardware halt action" value="1"/>
            <value name="SW" caption="Software halt action" value="2"/>
            <value name="NR" caption="Non-recoverable fault" value="3"/>
         </value-group>
         <value-group name="TCC_FCTRLB__SRC">
            <value name="DISABLE" caption="Fault input disabled" value="0"/>
            <value name="ENABLE" caption="MCEx (x=0,1) event input" value="1"/>
            <value name="INVERT" caption="Inverted MCEx (x=0,1) event input" value="2"/>
            <value name="ALTFAULT"
                   caption="Alternate fault (A or B) state at the end of the previous period"
                   value="3"/>
         </value-group>
