ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="TCC_EVCTRL__CNTSEL">
            <value name="START"
                   caption="An interrupt/event is generated when a new counter cycle starts"
                   value="0"/>
            <value name="END"
                   caption="An interrupt/event is generated when a counter cycle ends"
                   value="1"/>
            <value name="BETWEEN"
                   caption="An interrupt/event is generated when a counter cycle ends, except for the first and last cycles"
                   value="2"/>
            <value name="BOUNDARY"
                   caption="An interrupt/event is generated when a new counter cycle starts or a counter cycle ends"
                   value="3"/>
         </value-group>
         <value-group name="TCC_EVCTRL__EVACT0">
            <value name="OFF" caption="Event action disabled" value="0"/>
            <value name="RETRIGGER"
                   caption="Start, restart or re-trigger counter on event"
                   value="1"/>
            <value name="COUNTEV" caption="Count on event" value="2"/>
            <value name="START" caption="Start counter on event" value="3"/>
            <value name="INC" caption="Increment counter on event" value="4"/>
            <value name="COUNT"
                   caption="Count on active state of asynchronous event"
                   value="5"/>
            <value name="STAMP" caption="Stamp capture" value="6"/>
            <value name="FAULT" caption="Non-recoverable fault" value="7"/>
         </value-group>
         <value-group name="TCC_EVCTRL__EVACT1">
            <value name="OFF" caption="Event action disabled" value="0"/>
            <value name="RETRIGGER" caption="Re-trigger counter on event" value="1"/>
            <value name="DIR" caption="Direction control" value="2"/>
            <value name="STOP" caption="Stop counter on event" value="3"/>
            <value name="DEC" caption="Decrement counter on event" value="4"/>
            <value name="PPW"
                   caption="Period capture value in CC0 register, pulse width capture value in CC1 register"
                   value="5"/>
            <value name="PWP"
                   caption="Period capture value in CC1 register, pulse width capture value in CC0 register"
                   value="6"/>
            <value name="FAULT" caption="Non-recoverable fault" value="7"/>
         </value-group>
         <value-group name="TCC_WAVE__RAMP">
            <value name="RAMP1" caption="RAMP1 operation" value="0"/>
            <value name="RAMP2A" caption="Alternative RAMP2 operation" value="1"/>
            <value name="RAMP2" caption="RAMP2 operation" value="2"/>
            <value name="RAMP2C" caption="Critical RAMP2 operation" value="3"/>
         </value-group>
         <value-group name="TCC_WAVE__WAVEGEN">
            <value name="NFRQ" caption="Normal frequency" value="0"/>
            <value name="MFRQ" caption="Match frequency" value="1"/>
            <value name="NPWM" caption="Normal PWM" value="2"/>
            <value name="DSCRITICAL" caption="Dual-slope critical" value="4"/>
            <value name="DSBOTTOM"
                   caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO"
                   value="5"/>
            <value name="DSBOTH"
                   caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP"
                   value="6"/>
            <value name="DSTOP"
                   caption="Dual-slope with interrupt/event condition when COUNT reaches TOP"
                   value="7"/>
         </value-group>
      </module>
      <module name="TRNG"
              id="U2242"
              version="1.1.0"
              caption="True Random Generator">
         <register-group name="TRNG" caption="True Random Generator">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Control A">
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
            </register>
            <register name="EVCTRL"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Event Control">
               <bitfield name="DATARDYEO" caption="Data Ready Event Output" mask="0x1"/>
            </register>
            <register name="INTENCLR"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="DATARDY" caption="Data Ready Interrupt Enable" mask="0x1"/>
            </register>
            <register name="INTENSET"
                      offset="0x9"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="DATARDY" caption="Data Ready Interrupt Enable" mask="0x1"/>
            </register>
            <register name="INTFLAG"
                      offset="0xA"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="DATARDY" caption="Data Ready Interrupt Flag" mask="0x1"/>
            </register>
            <register name="DATA"
                      offset="0x20"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Output Data">
               <bitfield name="DATA" caption="Output Data" mask="0xFFFFFFFF"/>
            </register>
         </register-group>
      </module>
      <module name="USB"
              id="U2222"
              version="1.2.0"
              caption="Universal Serial Bus">
         <register-group name="DEVICE_DESC_BANK" size="0x10">
            <mode name="DEVICE"
                  qualifier="USB.CTRLA.MODE"
                  value="0"
                  caption="USB is Device"/>
            <register modes="DEVICE"
                      name="ADDR"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      caption="DEVICE_DESC_BANK Endpoint Bank, Adress of Data Buffer">
               <bitfield name="ADDR" caption="Adress of data buffer" mask="0xFFFFFFFF"/>
            </register>
            <register modes="DEVICE"
                      name="PCKSIZE"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      caption="DEVICE_DESC_BANK Endpoint Bank, Packet Size">
               <bitfield name="BYTE_COUNT" caption="Byte Count" mask="0x3FFF"/>
               <bitfield name="MULTI_PACKET_SIZE"
                         caption="Multi Packet In or Out size"
                         mask="0xFFFC000"/>
               <bitfield name="SIZE" caption="Enpoint size" mask="0x70000000"/>
               <bitfield name="AUTO_ZLP"
                         caption="Automatic Zero Length Packet"
                         mask="0x80000000"/>
            </register>
            <register modes="DEVICE"
                      name="EXTREG"
                      offset="0x8"
                      rw="RW"
                      size="2"
                      caption="DEVICE_DESC_BANK Endpoint Bank, Extended">
               <bitfield name="SUBPID"
                         caption="SUBPID field send with extended token"
                         mask="0xF"/>
               <bitfield name="VARIABLE"
                         caption="Variable field send with extended token"
                         mask="0x7FF0"/>
            </register>
            <register modes="DEVICE"
                      name="STATUS_BK"
                      offset="0xA"
                      rw="RW"
                      size="1"
                      caption="DEVICE_DESC_BANK Enpoint Bank, Status of Bank">
               <bitfield name="CRCERR" caption="CRC Error Status" mask="0x1"/>
               <bitfield name="ERRORFLOW" caption="Error Flow Status" mask="0x2"/>
            </register>
         </register-group>
         <register-group name="HOST_DESC_BANK" size="0x10">
            <mode name="HOST"
                  qualifier="USB.CTRLA.MODE"
                  value="1"
                  caption="USB is Host"/>
            <register modes="HOST"
                      name="ADDR"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      caption="HOST_DESC_BANK Host Bank, Adress of Data Buffer">
               <bitfield name="ADDR" caption="Adress of data buffer" mask="0xFFFFFFFF"/>
            </register>
            <register modes="HOST"
                      name="PCKSIZE"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      caption="HOST_DESC_BANK Host Bank, Packet Size">
               <bitfield name="BYTE_COUNT" caption="Byte Count" mask="0x3FFF"/>
               <bitfield name="MULTI_PACKET_SIZE"
                         caption="Multi Packet In or Out size"
                         mask="0xFFFC000"/>
               <bitfield name="SIZE" caption="Pipe size" mask="0x70000000"/>
               <bitfield name="AUTO_ZLP"
                         caption="Automatic Zero Length Packet"
                         mask="0x80000000"/>
            </register>
            <register modes="HOST"
                      name="EXTREG"
                      offset="0x8"
                      rw="RW"
                      size="2"
                      caption="HOST_DESC_BANK Host Bank, Extended">
               <bitfield name="SUBPID"
                         caption="SUBPID field send with extended token"
                         mask="0xF"/>
               <bitfield name="VARIABLE"
                         caption="Variable field send with extended token"
                         mask="0x7FF0"/>
            </register>
            <register modes="HOST"
                      name="STATUS_BK"
                      offset="0xA"
                      rw="RW"
                      size="1"
                      caption="HOST_DESC_BANK Host Bank, Status of Bank">
               <bitfield name="CRCERR" caption="CRC Error Status" mask="0x1"/>
               <bitfield name="ERRORFLOW" caption="Error Flow Status" mask="0x2"/>
            </register>
            <register modes="HOST"
                      name="CTRL_PIPE"
                      offset="0xC"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="HOST_DESC_BANK Host Bank, Host Control Pipe">
               <bitfield name="PDADDR" caption="Pipe Device Adress" mask="0x7F"/>
               <bitfield name="PEPNUM" caption="Pipe Endpoint Number" mask="0xF00"/>
               <bitfield name="PERMAX" caption="Pipe Error Max Number" mask="0xF000"/>
            </register>
            <register modes="HOST"
                      name="STATUS_PIPE"
                      offset="0xE"
                      rw="RW"
                      size="2"
                      caption="HOST_DESC_BANK Host Bank, Host Status Pipe">
               <bitfield name="DTGLER" caption="Data Toggle Error" mask="0x1"/>
               <bitfield name="DAPIDER" caption="Data PID Error" mask="0x2"/>
               <bitfield name="PIDER" caption="PID Error" mask="0x4"/>
               <bitfield name="TOUTER" caption="Time Out Error" mask="0x8"/>
               <bitfield name="CRC16ER" caption="CRC16 Error" mask="0x10"/>
               <bitfield name="ERCNT" caption="Pipe Error Count" mask="0xE0"/>
            </register>
         </register-group>
         <register-group name="DEVICE_ENDPOINT" size="0x20">
            <mode name="DEVICE"
                  qualifier="USB.CTRLA.MODE"
                  value="0"
                  caption="USB is Device"/>
            <register modes="DEVICE"
                      name="EPCFG"
                      offset="0x0"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="DEVICE_ENDPOINT End Point Configuration">
               <bitfield name="EPTYPE0" caption="End Point Type0" mask="0x7"/>
               <bitfield name="EPTYPE1" caption="End Point Type1" mask="0x70"/>
            </register>
            <register modes="DEVICE"
                      name="EPSTATUSCLR"
                      offset="0x4"
                      rw="W"
                      size="1"
                      atomic-op="clear:EPSTATUS"
                      initval="0x00"
                      caption="DEVICE_ENDPOINT End Point Pipe Status Clear">
               <bitfield name="DTGLOUT" caption="Data Toggle OUT Clear" mask="0x1"/>
               <bitfield name="DTGLIN" caption="Data Toggle IN Clear" mask="0x2"/>
               <bitfield name="CURBK" caption="Current Bank Clear" mask="0x4"/>
               <bitfield name="STALLRQ0" caption="Stall 0 Request Clear" mask="0x10"/>
               <bitfield name="STALLRQ1" caption="Stall 1 Request Clear" mask="0x20"/>
               <bitfield name="BK0RDY" caption="Bank 0 Ready Clear" mask="0x40"/>
               <bitfield name="BK1RDY" caption="Bank 1 Ready Clear" mask="0x80"/>
            </register>
            <register modes="DEVICE"
                      name="EPSTATUSSET"
                      offset="0x5"
                      rw="W"
                      size="1"
                      atomic-op="set:EPSTATUS"
                      initval="0x00"
                      caption="DEVICE_ENDPOINT End Point Pipe Status Set">
               <bitfield name="DTGLOUT" caption="Data Toggle OUT Set" mask="0x1"/>
               <bitfield name="DTGLIN" caption="Data Toggle IN Set" mask="0x2"/>
               <bitfield name="CURBK" caption="Current Bank Set" mask="0x4"/>
               <bitfield name="STALLRQ0" caption="Stall 0 Request Set" mask="0x10"/>
               <bitfield name="STALLRQ1" caption="Stall 1 Request Set" mask="0x20"/>
               <bitfield name="BK0RDY" caption="Bank 0 Ready Set" mask="0x40"/>
               <bitfield name="BK1RDY" caption="Bank 1 Ready Set" mask="0x80"/>
            </register>
            <register modes="DEVICE"
                      name="EPSTATUS"
                      offset="0x6"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="DEVICE_ENDPOINT End Point Pipe Status">
               <bitfield name="DTGLOUT" caption="Data Toggle Out" mask="0x1"/>
               <bitfield name="DTGLIN" caption="Data Toggle In" mask="0x2"/>
               <bitfield name="CURBK" caption="Current Bank" mask="0x4"/>
               <bitfield name="STALLRQ0" caption="Stall 0 Request" mask="0x10"/>
               <bitfield name="STALLRQ1" caption="Stall 1 Request" mask="0x20"/>
               <bitfield name="BK0RDY" caption="Bank 0 ready" mask="0x40"/>
               <bitfield name="BK1RDY" caption="Bank 1 ready" mask="0x80"/>
            </register>
            <register modes="DEVICE"
                      name="EPINTFLAG"
                      offset="0x7"
                      rw="RW"
                      size="1"
                      atomic-op="clear:EPINTFLAG"
                      initval="0x00"
                      caption="DEVICE_ENDPOINT End Point Interrupt Flag">
               <bitfield name="TRCPT0" caption="Transfer Complete 0" mask="0x1"/>
               <bitfield name="TRCPT1" caption="Transfer Complete 1" mask="0x2"/>
               <bitfield name="TRFAIL0" caption="Error Flow 0" mask="0x4"/>
               <bitfield name="TRFAIL1" caption="Error Flow 1" mask="0x8"/>
               <bitfield name="RXSTP" caption="Received Setup" mask="0x10"/>
               <bitfield name="STALL0" caption="Stall 0 In/out" mask="0x20"/>
               <bitfield name="STALL1" caption="Stall 1 In/out" mask="0x40"/>
            </register>
            <register modes="DEVICE"
                      name="EPINTENCLR"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      atomic-op="clear:EPINTENCLR"
                      initval="0x00"
                      caption="DEVICE_ENDPOINT End Point Interrupt Clear Flag">
               <bitfield name="TRCPT0"
                         caption="Transfer Complete 0 Interrupt Disable"
                         mask="0x1"/>
               <bitfield name="TRCPT1"
                         caption="Transfer Complete 1 Interrupt Disable"
                         mask="0x2"/>
               <bitfield name="TRFAIL0" caption="Error Flow 0 Interrupt Disable" mask="0x4"/>
               <bitfield name="TRFAIL1" caption="Error Flow 1 Interrupt Disable" mask="0x8"/>
               <bitfield name="RXSTP" caption="Received Setup Interrupt Disable" mask="0x10"/>
               <bitfield name="STALL0"
                         caption="Stall 0 In/Out Interrupt Disable"
                         mask="0x20"/>
               <bitfield name="STALL1"
                         caption="Stall 1 In/Out Interrupt Disable"
                         mask="0x40"/>
            </register>
            <register modes="DEVICE"
                      name="EPINTENSET"
                      offset="0x9"
                      rw="RW"
                      size="1"
                      atomic-op="set:EPINTENSET"
                      initval="0x00"
                      caption="DEVICE_ENDPOINT End Point Interrupt Set Flag">
               <bitfield name="TRCPT0"
                         caption="Transfer Complete 0 Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="TRCPT1"
                         caption="Transfer Complete 1 Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="TRFAIL0" caption="Error Flow 0 Interrupt Enable" mask="0x4"/>
               <bitfield name="TRFAIL1" caption="Error Flow 1 Interrupt Enable" mask="0x8"/>
               <bitfield name="RXSTP" caption="Received Setup Interrupt Enable" mask="0x10"/>
               <bitfield name="STALL0" caption="Stall 0 In/out Interrupt enable" mask="0x20"/>
               <bitfield name="STALL1" caption="Stall 1 In/out Interrupt enable" mask="0x40"/>
            </register>
         </register-group>
         <register-group name="HOST_PIPE" size="0x20">
            <mode name="HOST"
                  qualifier="USB.CTRLA.MODE"
                  value="1"
                  caption="USB is Host"/>
            <register modes="HOST"
                      name="PCFG"
                      offset="0x0"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="HOST_PIPE End Point Configuration">
               <bitfield name="PTOKEN" caption="Pipe Token" mask="0x3"/>
               <bitfield name="BK" caption="Pipe Bank" mask="0x4"/>
               <bitfield name="PTYPE" caption="Pipe Type" mask="0x38"/>
            </register>
            <register modes="HOST"
                      name="BINTERVAL"
                      offset="0x3"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="HOST_PIPE Bus Access Period of Pipe">
               <bitfield name="BITINTERVAL" caption="Bit Interval" mask="0xFF"/>
            </register>
            <register modes="HOST"
                      name="PSTATUSCLR"
                      offset="0x4"
                      rw="W"
                      size="1"
                      atomic-op="clear:PSTATUS"
                      initval="0x00"
                      caption="HOST_PIPE End Point Pipe Status Clear">
               <bitfield name="DTGL" caption="Data Toggle clear" mask="0x1"/>
               <bitfield name="CURBK" caption="Curren Bank clear" mask="0x4"/>
               <bitfield name="PFREEZE" caption="Pipe Freeze Clear" mask="0x10"/>
               <bitfield name="BK0RDY" caption="Bank 0 Ready Clear" mask="0x40"/>
               <bitfield name="BK1RDY" caption="Bank 1 Ready Clear" mask="0x80"/>
            </register>
            <register modes="HOST"
                      name="PSTATUSSET"
                      offset="0x5"
                      rw="W"
                      size="1"
                      atomic-op="set:PSTATUS"
                      initval="0x00"
                      caption="HOST_PIPE End Point Pipe Status Set">
               <bitfield name="DTGL" caption="Data Toggle Set" mask="0x1"/>
               <bitfield name="CURBK" caption="Current Bank Set" mask="0x4"/>
               <bitfield name="PFREEZE" caption="Pipe Freeze Set" mask="0x10"/>
               <bitfield name="BK0RDY" caption="Bank 0 Ready Set" mask="0x40"/>
               <bitfield name="BK1RDY" caption="Bank 1 Ready Set" mask="0x80"/>
            </register>
            <register modes="HOST"
                      name="PSTATUS"
                      offset="0x6"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="HOST_PIPE End Point Pipe Status">
               <bitfield name="DTGL" caption="Data Toggle" mask="0x1"/>
               <bitfield name="CURBK" caption="Current Bank" mask="0x4"/>
               <bitfield name="PFREEZE" caption="Pipe Freeze" mask="0x10"/>
               <bitfield name="BK0RDY" caption="Bank 0 ready" mask="0x40"/>
               <bitfield name="BK1RDY" caption="Bank 1 ready" mask="0x80"/>
            </register>
            <register modes="HOST"
                      name="PINTFLAG"
                      offset="0x7"
                      rw="RW"
                      size="1"
                      atomic-op="clear:PINTFLAG"
                      initval="0x00"
                      caption="HOST_PIPE Pipe Interrupt Flag">
               <bitfield name="TRCPT0"
                         caption="Transfer Complete 0 Interrupt Flag"
                         mask="0x1"/>
               <bitfield name="TRCPT1"
                         caption="Transfer Complete 1 Interrupt Flag"
                         mask="0x2"/>
               <bitfield name="TRFAIL" caption="Error Flow Interrupt Flag" mask="0x4"/>
               <bitfield name="PERR" caption="Pipe Error Interrupt Flag" mask="0x8"/>
               <bitfield name="TXSTP" caption="Transmit  Setup Interrupt Flag" mask="0x10"/>
               <bitfield name="STALL" caption="Stall Interrupt Flag" mask="0x20"/>
            </register>
