ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register modes="HOST"
                      name="PINTENCLR"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      atomic-op="clear:PINTENCLR"
                      initval="0x00"
                      caption="HOST_PIPE Pipe Interrupt Flag Clear">
               <bitfield name="TRCPT0" caption="Transfer Complete 0 Disable" mask="0x1"/>
               <bitfield name="TRCPT1" caption="Transfer Complete 1 Disable" mask="0x2"/>
               <bitfield name="TRFAIL" caption="Error Flow Interrupt Disable" mask="0x4"/>
               <bitfield name="PERR" caption="Pipe Error Interrupt Disable" mask="0x8"/>
               <bitfield name="TXSTP" caption="Transmit Setup Interrupt Disable" mask="0x10"/>
               <bitfield name="STALL" caption="Stall Inetrrupt Disable" mask="0x20"/>
            </register>
            <register modes="HOST"
                      name="PINTENSET"
                      offset="0x9"
                      rw="RW"
                      size="1"
                      atomic-op="set:PINTENSET"
                      initval="0x00"
                      caption="HOST_PIPE Pipe Interrupt Flag Set">
               <bitfield name="TRCPT0"
                         caption="Transfer Complete 0 Interrupt Enable"
                         mask="0x1"/>
               <bitfield name="TRCPT1"
                         caption="Transfer Complete 1 Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="TRFAIL" caption="Error Flow Interrupt Enable" mask="0x4"/>
               <bitfield name="PERR" caption="Pipe Error Interrupt Enable" mask="0x8"/>
               <bitfield name="TXSTP" caption="Transmit  Setup Interrupt Enable" mask="0x10"/>
               <bitfield name="STALL" caption="Stall Interrupt Enable" mask="0x20"/>
            </register>
         </register-group>
         <register-group name="USB" caption="Universal Serial Bus">
            <mode name="DEVICE"
                  qualifier="USB.CTRLA.MODE"
                  value="0"
                  caption="USB is Device"/>
            <mode name="HOST"
                  qualifier="USB.CTRLA.MODE"
                  value="1"
                  caption="USB is Host"/>
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby Mode" mask="0x4"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0x80"
                         values="USB_CTRLA__MODE"/>
            </register>
            <register name="SYNCBUSY"
                      offset="0x2"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Busy"
                         mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
            </register>
            <register name="QOSCTRL"
                      offset="0x3"
                      rw="RW"
                      size="1"
                      initval="0x0F"
                      caption="USB Quality Of Service">
               <bitfield name="CQOS" caption="Configuration Quality of Service" mask="0x3"/>
               <bitfield name="DQOS" caption="Data Quality of Service" mask="0xC"/>
            </register>
            <register modes="DEVICE"
                      name="CTRLB"
                      offset="0x8"
                      rw="RW"
                      size="2"
                      initval="0x0001"
                      caption="DEVICE Control B">
               <bitfield name="DETACH" caption="Detach" mask="0x1"/>
               <bitfield name="UPRSM" caption="Upstream Resume" mask="0x2"/>
               <bitfield name="SPDCONF"
                         caption="Speed Configuration"
                         mask="0xC"
                         values="USB_DEVICE_CTRLB__SPDCONF"/>
               <bitfield name="NREPLY" caption="No Reply" mask="0x10"/>
               <bitfield name="GNAK" caption="Global NAK" mask="0x200"/>
               <bitfield name="LPMHDSK"
                         caption="Link Power Management Handshake"
                         mask="0xC00"
                         values="USB_DEVICE_CTRLB__LPMHDSK"/>
            </register>
            <register modes="HOST"
                      name="CTRLB"
                      offset="0x8"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="HOST Control B">
               <bitfield name="RESUME" caption="Send USB Resume" mask="0x2"/>
               <bitfield name="SPDCONF"
                         caption="Speed Configuration for Host"
                         mask="0xC"
                         values="USB_HOST_CTRLB__SPDCONF"/>
               <bitfield name="AUTORESUME" caption="Auto Resume Enable" mask="0x10"/>
               <bitfield name="SOFE" caption="Start of Frame Generation Enable" mask="0x100"/>
               <bitfield name="BUSRESET" caption="Send USB Reset" mask="0x200"/>
               <bitfield name="VBUSOK" caption="VBUS is OK" mask="0x400"/>
               <bitfield name="L1RESUME" caption="Send L1 Resume" mask="0x800"/>
            </register>
            <register modes="DEVICE"
                      name="DADD"
                      offset="0xA"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="DEVICE Device Address">
               <bitfield name="DADD" caption="Device Address" mask="0x7F"/>
               <bitfield name="ADDEN" caption="Device Address Enable" mask="0x80"/>
            </register>
            <register modes="HOST"
                      name="HSOFC"
                      offset="0xA"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="HOST Host Start Of Frame Control">
               <bitfield name="FLENC" caption="Frame Length Control" mask="0xF"/>
               <bitfield name="FLENCE" caption="Frame Length Control Enable" mask="0x80"/>
            </register>
            <register modes="DEVICE"
                      name="STATUS"
                      offset="0xC"
                      rw="R"
                      size="1"
                      initval="0x40"
                      caption="DEVICE Status">
               <bitfield name="SPEED"
                         caption="Speed Status"
                         mask="0xC"
                         values="USB_DEVICE_STATUS__SPEED"/>
               <bitfield name="LINESTATE"
                         caption="USB Line State Status"
                         mask="0xC0"
                         values="USB_DEVICE_STATUS__LINESTATE"/>
            </register>
            <register modes="HOST"
                      name="STATUS"
                      offset="0xC"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="HOST Status">
               <bitfield name="SPEED" caption="Speed Status" mask="0xC"/>
               <bitfield name="LINESTATE" caption="USB Line State Status" mask="0xC0"/>
            </register>
            <register name="FSMSTATUS"
                      offset="0xD"
                      rw="R"
                      size="1"
                      initval="0x01"
                      caption="Finite State Machine Status">
               <bitfield name="FSMSTATE"
                         caption="Fine State Machine Status"
                         mask="0x7F"
                         values="USB_FSMSTATUS__FSMSTATE"/>
            </register>
            <register modes="DEVICE"
                      name="FNUM"
                      offset="0x10"
                      rw="R"
                      size="2"
                      initval="0x0000"
                      caption="DEVICE Device Frame Number">
               <bitfield name="FNUM" caption="Frame Number" mask="0x3FF8"/>
               <bitfield name="FNCERR" caption="Frame Number CRC Error" mask="0x8000"/>
            </register>
            <register modes="HOST"
                      name="FNUM"
                      offset="0x10"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="HOST Host Frame Number">
               <bitfield name="FNUM" caption="Frame Number" mask="0x3FF8"/>
            </register>
            <register modes="HOST"
                      name="FLENHIGH"
                      offset="0x12"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="HOST Host Frame Length">
               <bitfield name="FLENHIGH" caption="Frame Length" mask="0xFF"/>
            </register>
            <register modes="DEVICE"
                      name="INTENCLR"
                      offset="0x14"
                      rw="RW"
                      size="2"
                      atomic-op="clear:INTENCLR"
                      initval="0x0000"
                      caption="DEVICE Device Interrupt Enable Clear">
               <bitfield name="SUSPEND" caption="Suspend Interrupt Enable" mask="0x1"/>
               <bitfield name="SOF" caption="Start Of Frame Interrupt Enable" mask="0x4"/>
               <bitfield name="EORST" caption="End of Reset Interrupt Enable" mask="0x8"/>
               <bitfield name="WAKEUP" caption="Wake Up Interrupt Enable" mask="0x10"/>
               <bitfield name="EORSM" caption="End Of Resume Interrupt Enable" mask="0x20"/>
               <bitfield name="UPRSM" caption="Upstream Resume Interrupt Enable" mask="0x40"/>
               <bitfield name="RAMACER" caption="Ram Access Interrupt Enable" mask="0x80"/>
               <bitfield name="LPMNYET"
                         caption="Link Power Management Not Yet Interrupt Enable"
                         mask="0x100"/>
               <bitfield name="LPMSUSP"
                         caption="Link Power Management Suspend Interrupt Enable"
                         mask="0x200"/>
            </register>
            <register modes="HOST"
                      name="INTENCLR"
                      offset="0x14"
                      rw="RW"
                      size="2"
                      atomic-op="clear:INTENCLR"
                      initval="0x0000"
                      caption="HOST Host Interrupt Enable Clear">
               <bitfield name="HSOF"
                         caption="Host Start Of Frame Interrupt Disable"
                         mask="0x4"/>
               <bitfield name="RST" caption="BUS Reset Interrupt Disable" mask="0x8"/>
               <bitfield name="WAKEUP" caption="Wake Up Interrupt Disable" mask="0x10"/>
               <bitfield name="DNRSM"
                         caption="DownStream to Device Interrupt Disable"
                         mask="0x20"/>
               <bitfield name="UPRSM"
                         caption="Upstream Resume from Device Interrupt Disable"
                         mask="0x40"/>
               <bitfield name="RAMACER" caption="Ram Access Interrupt Disable" mask="0x80"/>
               <bitfield name="DCONN"
                         caption="Device Connection Interrupt Disable"
                         mask="0x100"/>
               <bitfield name="DDISC"
                         caption="Device Disconnection Interrupt Disable"
                         mask="0x200"/>
            </register>
            <register modes="DEVICE"
                      name="INTENSET"
                      offset="0x18"
                      rw="RW"
                      size="2"
                      atomic-op="set:INTENSET"
                      initval="0x0000"
                      caption="DEVICE Device Interrupt Enable Set">
               <bitfield name="SUSPEND" caption="Suspend Interrupt Enable" mask="0x1"/>
               <bitfield name="SOF" caption="Start Of Frame Interrupt Enable" mask="0x4"/>
               <bitfield name="EORST" caption="End of Reset Interrupt Enable" mask="0x8"/>
               <bitfield name="WAKEUP" caption="Wake Up Interrupt Enable" mask="0x10"/>
               <bitfield name="EORSM" caption="End Of Resume Interrupt Enable" mask="0x20"/>
               <bitfield name="UPRSM" caption="Upstream Resume Interrupt Enable" mask="0x40"/>
               <bitfield name="RAMACER" caption="Ram Access Interrupt Enable" mask="0x80"/>
               <bitfield name="LPMNYET"
                         caption="Link Power Management Not Yet Interrupt Enable"
                         mask="0x100"/>
               <bitfield name="LPMSUSP"
                         caption="Link Power Management Suspend Interrupt Enable"
                         mask="0x200"/>
            </register>
            <register modes="HOST"
                      name="INTENSET"
                      offset="0x18"
                      rw="RW"
                      size="2"
                      atomic-op="set:INTENSET"
                      initval="0x0000"
                      caption="HOST Host Interrupt Enable Set">
               <bitfield name="HSOF"
                         caption="Host Start Of Frame Interrupt Enable"
                         mask="0x4"/>
               <bitfield name="RST" caption="Bus Reset Interrupt Enable" mask="0x8"/>
               <bitfield name="WAKEUP" caption="Wake Up Interrupt Enable" mask="0x10"/>
               <bitfield name="DNRSM"
                         caption="DownStream to the Device Interrupt Enable"
                         mask="0x20"/>
               <bitfield name="UPRSM"
                         caption="Upstream Resume fromthe device Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="RAMACER" caption="Ram Access Interrupt Enable" mask="0x80"/>
               <bitfield name="DCONN"
                         caption="Link Power Management Interrupt Enable"
                         mask="0x100"/>
               <bitfield name="DDISC"
                         caption="Device Disconnection Interrupt Enable"
                         mask="0x200"/>
            </register>
            <register modes="DEVICE"
                      name="INTFLAG"
                      offset="0x1C"
                      rw="RW"
                      size="2"
                      atomic-op="clear:INTFLAG"
                      initval="0x0000"
                      caption="DEVICE Device Interrupt Flag">
               <bitfield name="SUSPEND" caption="Suspend" mask="0x1"/>
               <bitfield name="SOF" caption="Start Of Frame" mask="0x4"/>
               <bitfield name="EORST" caption="End of Reset" mask="0x8"/>
               <bitfield name="WAKEUP" caption="Wake Up" mask="0x10"/>
               <bitfield name="EORSM" caption="End Of Resume" mask="0x20"/>
               <bitfield name="UPRSM" caption="Upstream Resume" mask="0x40"/>
               <bitfield name="RAMACER" caption="Ram Access" mask="0x80"/>
               <bitfield name="LPMNYET" caption="Link Power Management Not Yet" mask="0x100"/>
               <bitfield name="LPMSUSP" caption="Link Power Management Suspend" mask="0x200"/>
            </register>
            <register modes="HOST"
                      name="INTFLAG"
                      offset="0x1C"
                      rw="RW"
                      size="2"
                      atomic-op="clear:INTFLAG"
                      initval="0x0000"
                      caption="HOST Host Interrupt Flag">
               <bitfield name="HSOF" caption="Host Start Of Frame" mask="0x4"/>
               <bitfield name="RST" caption="Bus Reset" mask="0x8"/>
               <bitfield name="WAKEUP" caption="Wake Up" mask="0x10"/>
               <bitfield name="DNRSM" caption="Downstream" mask="0x20"/>
               <bitfield name="UPRSM" caption="Upstream Resume from the Device" mask="0x40"/>
               <bitfield name="RAMACER" caption="Ram Access" mask="0x80"/>
               <bitfield name="DCONN" caption="Device Connection" mask="0x100"/>
               <bitfield name="DDISC" caption="Device Disconnection" mask="0x200"/>
            </register>
            <register modes="DEVICE"
                      name="EPINTSMRY"
                      offset="0x20"
                      rw="R"
                      size="2"
                      initval="0x0000"
                      caption="DEVICE End Point Interrupt Summary">
               <bitfield name="EPINT0" caption="End Point 0 Interrupt" mask="0x1"/>
               <bitfield name="EPINT1" caption="End Point 1 Interrupt" mask="0x2"/>
               <bitfield name="EPINT2" caption="End Point 2 Interrupt" mask="0x4"/>
               <bitfield name="EPINT3" caption="End Point 3 Interrupt" mask="0x8"/>
               <bitfield name="EPINT4" caption="End Point 4 Interrupt" mask="0x10"/>
               <bitfield name="EPINT5" caption="End Point 5 Interrupt" mask="0x20"/>
               <bitfield name="EPINT6" caption="End Point 6 Interrupt" mask="0x40"/>
               <bitfield name="EPINT7" caption="End Point 7 Interrupt" mask="0x80"/>
            </register>
            <register modes="HOST"
                      name="PINTSMRY"
                      offset="0x20"
                      rw="R"
                      size="2"
                      initval="0x0000"
                      caption="HOST Pipe Interrupt Summary">
               <bitfield name="EPINT0" caption="Pipe 0 Interrupt" mask="0x1"/>
               <bitfield name="EPINT1" caption="Pipe 1 Interrupt" mask="0x2"/>
               <bitfield name="EPINT2" caption="Pipe 2 Interrupt" mask="0x4"/>
               <bitfield name="EPINT3" caption="Pipe 3 Interrupt" mask="0x8"/>
               <bitfield name="EPINT4" caption="Pipe 4 Interrupt" mask="0x10"/>
               <bitfield name="EPINT5" caption="Pipe 5 Interrupt" mask="0x20"/>
               <bitfield name="EPINT6" caption="Pipe 6 Interrupt" mask="0x40"/>
               <bitfield name="EPINT7" caption="Pipe 7 Interrupt" mask="0x80"/>
            </register>
            <register name="DESCADD"
                      offset="0x24"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Descriptor Address">
               <bitfield name="DESCADD" caption="Descriptor Address Value" mask="0xFFFFFFFF"/>
            </register>
            <register name="PADCAL"
                      offset="0x28"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USB PAD Calibration">
               <bitfield name="TRANSP" caption="USB Pad Transp calibration" mask="0x1F"/>
               <bitfield name="TRANSN" caption="USB Pad Transn calibration" mask="0x7C0"/>
               <bitfield name="TRIM" caption="USB Pad Trim calibration" mask="0x7000"/>
            </register>
            <register-group modes="DEVICE"
                            name="DEVICE_ENDPOINT"
                            name-in-module="DEVICE_ENDPOINT"
                            offset="0x100"
                            size="0x20"
                            count="8"/>
            <register-group modes="HOST"
                            name="HOST_PIPE"
                            name-in-module="HOST_PIPE"
                            offset="0x100"
                            size="0x20"
                            count="8"/>
         </register-group>
         <register-group name="USB_DESCRIPTOR" caption="Universal Serial Bus">
            <mode name="DEVICE"
                  qualifier="USB.CTRLA.MODE"
                  value="0"
                  caption="USB is Device"/>
            <mode name="HOST"
                  qualifier="USB.CTRLA.MODE"
                  value="1"
                  caption="USB is Host"/>
            <register-group modes="DEVICE"
                            name="DEVICE_DESC_BANK"
                            name-in-module="DEVICE_DESC_BANK"
                            offset="0x000"
                            size="0x10"
                            count="2"/>
            <register-group modes="HOST"
                            name="HOST_DESC_BANK"
                            name-in-module="HOST_DESC_BANK"
                            offset="0x000"
                            size="0x10"
                            count="2"/>
         </register-group>
         <value-group name="USB_CTRLA__MODE">
            <value name="DEVICE" caption="Device Mode" value="0"/>
            <value name="HOST" caption="Host Mode" value="1"/>
         </value-group>
