ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="USB_DEVICE_CTRLB__LPMHDSK">
            <value name="NO" caption="No handshake. LPM is not supported" value="0"/>
            <value name="ACK" caption="ACK" value="1"/>
            <value name="NYET" caption="NYET" value="2"/>
         </value-group>
         <value-group name="USB_DEVICE_CTRLB__SPDCONF">
            <value name="FS" caption="FS : Full Speed" value="0x0"/>
            <value name="LS" caption="LS : Low Speed" value="0x1"/>
         </value-group>
         <value-group name="USB_HOST_CTRLB__SPDCONF">
            <value name="NORMAL" caption="Low and Full Speed capable" value="0x0"/>
         </value-group>
         <value-group name="USB_DEVICE_STATUS__LINESTATE">
            <value name="SE0RESET" caption="SE0/RESET" value="0x0"/>
            <value name="FSJLSK" caption="FS-J or LS-K State" value="0x1"/>
            <value name="FSKLSJ" caption="FS-K or LS-J State" value="0x2"/>
         </value-group>
         <value-group name="USB_DEVICE_STATUS__SPEED">
            <value name="FS" caption="Full-speed mode" value="0x0"/>
            <value name="LS" caption="Low-speed mode" value="0x1"/>
         </value-group>
         <value-group name="USB_FSMSTATUS__FSMSTATE">
            <value name="OFF"
                   caption="OFF (L3). It corresponds to the powered-off, disconnected, and disabled state"
                   value="0x1"/>
            <value name="ON"
                   caption="ON (L0). It corresponds to the Idle and Active states"
                   value="0x2"/>
            <value name="SUSPEND" caption="SUSPEND (L2)" value="0x4"/>
            <value name="SLEEP" caption="SLEEP (L1)" value="0x8"/>
            <value name="DNRESUME"
                   caption="DNRESUME. Down Stream Resume."
                   value="0x10"/>
            <value name="UPRESUME" caption="UPRESUME. Up Stream Resume." value="0x20"/>
            <value name="RESET" caption="RESET. USB lines Reset." value="0x40"/>
         </value-group>
      </module>
      <module name="WDT" id="U2251" version="1.1.0" caption="Watchdog Timer">
         <register-group name="WDT" caption="Watchdog Timer">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Control">
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="WEN" caption="Watchdog Timer Window Mode Enable" mask="0x4"/>
               <bitfield name="ALWAYSON" caption="Always-On" mask="0x80"/>
            </register>
            <register name="CONFIG"
                      offset="0x1"
                      rw="RW"
                      size="1"
                      initval="0xBB"
                      caption="Configuration">
               <bitfield name="PER"
                         caption="Time-Out Period"
                         mask="0xF"
                         values="WDT_CONFIG__PER"/>
               <bitfield name="WINDOW"
                         caption="Window Mode Time-Out Period"
                         mask="0xF0"
                         values="WDT_CONFIG__WINDOW"/>
            </register>
            <register name="EWCTRL"
                      offset="0x2"
                      rw="RW"
                      size="1"
                      initval="0x0B"
                      caption="Early Warning Interrupt Control">
               <bitfield name="EWOFFSET"
                         caption="Early Warning Interrupt Time Offset"
                         mask="0xF"
                         values="WDT_EWCTRL__EWOFFSET"/>
            </register>
            <register name="INTENCLR"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
            </register>
            <register name="INTENSET"
                      offset="0x5"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
            </register>
            <register name="INTFLAG"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="EW" caption="Early Warning" mask="0x1"/>
            </register>
            <register name="SYNCBUSY"
                      offset="0x8"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Synchronization Busy">
               <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
               <bitfield name="WEN" caption="Window Enable Synchronization Busy" mask="0x4"/>
               <bitfield name="ALWAYSON" caption="Always-On Synchronization Busy" mask="0x8"/>
               <bitfield name="CLEAR" caption="Clear Synchronization Busy" mask="0x10"/>
            </register>
            <register name="CLEAR"
                      offset="0xC"
                      rw="W"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Clear">
               <bitfield name="CLEAR"
                         caption="Watchdog Clear"
                         mask="0xFF"
                         values="WDT_CLEAR__CLEAR"/>
            </register>
         </register-group>
         <value-group name="WDT_CONFIG__PER">
            <value name="CYC8" caption="8 clock cycles" value="0x0"/>
            <value name="CYC16" caption="16 clock cycles" value="0x1"/>
            <value name="CYC32" caption="32 clock cycles" value="0x2"/>
            <value name="CYC64" caption="64 clock cycles" value="0x3"/>
            <value name="CYC128" caption="128 clock cycles" value="0x4"/>
            <value name="CYC256" caption="256 clock cycles" value="0x5"/>
            <value name="CYC512" caption="512 clock cycles" value="0x6"/>
            <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
            <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
            <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
            <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
            <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
         </value-group>
