ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
         <value-group name="WDT_CONFIG__WINDOW">
            <value name="CYC8" caption="8 clock cycles" value="0x0"/>
            <value name="CYC16" caption="16 clock cycles" value="0x1"/>
            <value name="CYC32" caption="32 clock cycles" value="0x2"/>
            <value name="CYC64" caption="64 clock cycles" value="0x3"/>
            <value name="CYC128" caption="128 clock cycles" value="0x4"/>
            <value name="CYC256" caption="256 clock cycles" value="0x5"/>
            <value name="CYC512" caption="512 clock cycles" value="0x6"/>
            <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
            <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
            <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
            <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
            <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
         </value-group>
         <value-group name="WDT_EWCTRL__EWOFFSET">
            <value name="CYC8" caption="8 clock cycles" value="0x0"/>
            <value name="CYC16" caption="16 clock cycles" value="0x1"/>
            <value name="CYC32" caption="32 clock cycles" value="0x2"/>
            <value name="CYC64" caption="64 clock cycles" value="0x3"/>
            <value name="CYC128" caption="128 clock cycles" value="0x4"/>
            <value name="CYC256" caption="256 clock cycles" value="0x5"/>
            <value name="CYC512" caption="512 clock cycles" value="0x6"/>
            <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
            <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
            <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
            <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
         </value-group>
         <value-group name="WDT_CLEAR__CLEAR">
            <value name="KEY" caption="Clear Key" value="0xA5"/>
         </value-group>
      </module>
      <module name="CoreDebug" version="1.0.0" caption="Core Debug Register">
         <register-group name="CoreDebug" caption="Core Debug Register">
            <register name="DHCSR"
                      offset="0x0"
                      size="4"
                      access-size="4"
                      caption="Debug Halting Control and Status Register">
               <bitfield name="C_DEBUGEN" rw="RW" caption="" mask="0x1"/>
               <bitfield name="C_HALT" rw="RW" caption="" mask="0x2"/>
               <bitfield name="C_STEP" rw="RW" caption="" mask="0x4"/>
               <bitfield name="C_MASKINTS" rw="RW" caption="" mask="0x8"/>
               <bitfield name="C_SNAPSTALL" rw="RW" caption="" mask="0x20"/>
               <bitfield name="S_REGRDY" rw="R" caption="" mask="0x10000"/>
               <bitfield name="S_HALT" rw="R" caption="" mask="0x20000"/>
               <bitfield name="S_SLEEP" rw="R" caption="" mask="0x40000"/>
               <bitfield name="S_LOCKUP" rw="R" caption="" mask="0x80000"/>
               <bitfield name="S_RETIRE_ST" rw="R" caption="" mask="0x1000000"/>
               <bitfield name="S_RESET_ST" rw="R" caption="" mask="0x2000000"/>
               <bitfield name="DBGKEY" rw="W" caption="" mask="0xFFFF0000"/>
            </register>
            <register name="DCRSR"
                      offset="0x4"
                      rw="W"
                      size="4"
                      access-size="4"
                      caption="Debug Core Register Selector Register">
               <bitfield name="REGSEL" caption="" mask="0x1F"/>
               <bitfield name="REGWnR" caption="" mask="0x10000"/>
            </register>
            <register name="DCRDR"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Debug Core Register Data Register">
        </register>
            <register name="DEMCR"
                      offset="0xC"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Debug Exception and Monitor Control Register">
               <bitfield name="VC_CORERESET" caption="" mask="0x1"/>
               <bitfield name="VC_MMERR" caption="" mask="0x10"/>
               <bitfield name="VC_NOCPERR" caption="" mask="0x20"/>
               <bitfield name="VC_CHKERR" caption="" mask="0x40"/>
               <bitfield name="VC_STATERR" caption="" mask="0x80"/>
               <bitfield name="VC_BUSERR" caption="" mask="0x100"/>
               <bitfield name="VC_INTERR" caption="" mask="0x200"/>
               <bitfield name="VC_HARDERR" caption="" mask="0x400"/>
               <bitfield name="MON_EN" caption="" mask="0x10000"/>
               <bitfield name="MON_PEND" caption="" mask="0x20000"/>
               <bitfield name="MON_STEP" caption="" mask="0x40000"/>
               <bitfield name="MON_REQ" caption="" mask="0x80000"/>
               <bitfield name="TRCENA" caption="" mask="0x1000000"/>
            </register>
         </register-group>
      </module>
      <module name="DWT"
              version="1.0.0"
              caption="Data Watchpoint and Trace Register">
         <register-group name="DWT" caption="Data Watchpoint and Trace Register">
            <register name="CTRL"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Control Register">
               <bitfield name="CYCCNTENA" caption="" mask="0x1"/>
               <bitfield name="POSTPRESET" caption="" mask="0x1E"/>
               <bitfield name="POSTINIT" caption="" mask="0x1E0"/>
               <bitfield name="CYCTAP" caption="" mask="0x200"/>
               <bitfield name="SYNCTAP" caption="" mask="0xC00"/>
               <bitfield name="PCSAMPLENA" caption="" mask="0x1000"/>
               <bitfield name="EXCTRCENA" caption="" mask="0x10000"/>
               <bitfield name="CPIEVTENA" caption="" mask="0x20000"/>
               <bitfield name="EXCEVTENA" caption="" mask="0x40000"/>
               <bitfield name="SLEEPEVTENA" caption="" mask="0x80000"/>
               <bitfield name="LSUEVTENA" caption="" mask="0x100000"/>
               <bitfield name="FOLDEVTENA" caption="" mask="0x200000"/>
               <bitfield name="CYCEVTENA" caption="" mask="0x400000"/>
               <bitfield name="NOPRFCNT" caption="" mask="0x1000000"/>
               <bitfield name="NOCYCCNT" caption="" mask="0x2000000"/>
               <bitfield name="NOEXTTRIG" caption="" mask="0x4000000"/>
               <bitfield name="NOTRCPKT" caption="" mask="0x8000000"/>
               <bitfield name="NUMCOMP" caption="" mask="0xF0000000"/>
            </register>
            <register name="CYCCNT"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Cycle Count Register">
        </register>
            <register name="CPICNT"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="CPI Count Register">
               <bitfield name="CPICNT" caption="" mask="0xFF"/>
            </register>
            <register name="EXCCNT"
                      offset="0xC"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Exception Overhead Count Register">
               <bitfield name="EXCCNT" caption="" mask="0xFF"/>
            </register>
            <register name="SLEEPCNT"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Sleep Count Register">
               <bitfield name="SLEEPCNT" caption="" mask="0xFF"/>
            </register>
            <register name="LSUCNT"
                      offset="0x14"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="LSU Count Register">
               <bitfield name="LSUCNT" caption="" mask="0xFF"/>
            </register>
            <register name="FOLDCNT"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Folded-instruction Count Register">
               <bitfield name="FOLDCNT" caption="" mask="0xFF"/>
            </register>
