ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="PCSR"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="Program Counter Sample Register">
        </register>
            <register name="COMP0"
                      offset="0x20"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Comparator Register 0">
        </register>
            <register name="MASK0"
                      offset="0x24"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Mask Register 0">
               <bitfield name="MASK" caption="" mask="0x1F"/>
            </register>
            <register name="FUNCTION0"
                      offset="0x28"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Function Register 0">
               <bitfield name="FUNCTION" caption="" mask="0xF"/>
               <bitfield name="EMITRANGE" caption="" mask="0x20"/>
               <bitfield name="CYCMATCH" caption="" mask="0x80"/>
               <bitfield name="DATAVMATCH" caption="" mask="0x100"/>
               <bitfield name="LNK1ENA" caption="" mask="0x200"/>
               <bitfield name="DATAVSIZE" caption="" mask="0xC00"/>
               <bitfield name="DATAVADDR0" caption="" mask="0xF000"/>
               <bitfield name="DATAVADDR1" caption="" mask="0xF0000"/>
               <bitfield name="MATCHED" caption="" mask="0x1000000"/>
            </register>
            <register name="COMP1"
                      offset="0x30"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Comparator Register 1">
        </register>
            <register name="MASK1"
                      offset="0x34"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Mask Register 1">
               <bitfield name="MASK" caption="" mask="0x1F"/>
            </register>
            <register name="FUNCTION1"
                      offset="0x38"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Function Register 1">
               <bitfield name="FUNCTION" caption="" mask="0xF"/>
               <bitfield name="EMITRANGE" caption="" mask="0x20"/>
               <bitfield name="CYCMATCH" caption="" mask="0x80"/>
               <bitfield name="DATAVMATCH" caption="" mask="0x100"/>
               <bitfield name="LNK1ENA" caption="" mask="0x200"/>
               <bitfield name="DATAVSIZE" caption="" mask="0xC00"/>
               <bitfield name="DATAVADDR0" caption="" mask="0xF000"/>
               <bitfield name="DATAVADDR1" caption="" mask="0xF0000"/>
               <bitfield name="MATCHED" caption="" mask="0x1000000"/>
            </register>
            <register name="COMP2"
                      offset="0x40"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Comparator Register 2">
        </register>
            <register name="MASK2"
                      offset="0x44"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Mask Register 2">
               <bitfield name="MASK" caption="" mask="0x1F"/>
            </register>
            <register name="FUNCTION2"
                      offset="0x48"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Function Register 2">
               <bitfield name="FUNCTION" caption="" mask="0xF"/>
               <bitfield name="EMITRANGE" caption="" mask="0x20"/>
               <bitfield name="CYCMATCH" caption="" mask="0x80"/>
               <bitfield name="DATAVMATCH" caption="" mask="0x100"/>
               <bitfield name="LNK1ENA" caption="" mask="0x200"/>
               <bitfield name="DATAVSIZE" caption="" mask="0xC00"/>
               <bitfield name="DATAVADDR0" caption="" mask="0xF000"/>
               <bitfield name="DATAVADDR1" caption="" mask="0xF0000"/>
               <bitfield name="MATCHED" caption="" mask="0x1000000"/>
            </register>
            <register name="COMP3"
                      offset="0x50"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Comparator Register 3">
        </register>
            <register name="MASK3"
                      offset="0x54"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Mask Register 3">
               <bitfield name="MASK" caption="" mask="0x1F"/>
            </register>
            <register name="FUNCTION3"
                      offset="0x58"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Function Register 3">
               <bitfield name="FUNCTION" caption="" mask="0xF"/>
               <bitfield name="EMITRANGE" caption="" mask="0x20"/>
               <bitfield name="CYCMATCH" caption="" mask="0x80"/>
               <bitfield name="DATAVMATCH" caption="" mask="0x100"/>
               <bitfield name="LNK1ENA" caption="" mask="0x200"/>
               <bitfield name="DATAVSIZE" caption="" mask="0xC00"/>
               <bitfield name="DATAVADDR0" caption="" mask="0xF000"/>
               <bitfield name="DATAVADDR1" caption="" mask="0xF0000"/>
               <bitfield name="MATCHED" caption="" mask="0x1000000"/>
            </register>
         </register-group>
      </module>
      <module name="ETM" version="1.0.0" caption="Embedded Trace Macrocell">
         <register-group name="ETM" caption="Embedded Trace Macrocell">
            <register name="CR"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000411"
                      caption="ETM Main Control Register">
               <bitfield name="ETMPD" caption="ETM Power Down" mask="0x1"/>
               <bitfield name="PORTSIZE" caption="Port Size bits 2:0" mask="0x70"/>
               <bitfield name="STALL" caption="Stall Processor" mask="0x80"/>
               <bitfield name="BROUT" caption="Branch Output" mask="0x100"/>
               <bitfield name="DBGRQ" caption="Debug Request Control" mask="0x200"/>
               <bitfield name="PROG" caption="ETM Programming" mask="0x400"/>
               <bitfield name="PORTSEL" caption="ETM Port Select" mask="0x800"/>
               <bitfield name="PORTMODE2" caption="Port Mode bit 2" mask="0x2000"/>
               <bitfield name="PORTMODE" caption="Port Mode bits 1:0" mask="0x30000"/>
               <bitfield name="PORTSIZE3" caption="Port Size bit 3" mask="0x200000"/>
               <bitfield name="TSEN" caption="TimeStamp Enable" mask="0x10000000"/>
            </register>
            <register name="CCR"
                      offset="0x4"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x8C802000"
                      caption="ETM Configuration Code Register">
        </register>
            <register name="TRIGGER"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="ETM Trigger Event Register">
        </register>
            <register name="SR"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="ETM Status Register">
        </register>
            <register name="SCR"
                      offset="0x14"
                      rw="R"
                      size="4"
                      access-size="4"
                      atomic-op="clear:SR"
                      initval="0x00020D09"
                      caption="ETM System Configuration Register">
        </register>
            <register name="TEEVR"
                      offset="0x20"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="ETM TraceEnable Event Register">
        </register>
            <register name="TECR1"
                      offset="0x24"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="ETM TraceEnable Control 1 Register">
        </register>
            <register name="FFLR"
                      offset="0x28"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="ETM FIFO Full Level Register">
        </register>
            <register name="CNTRLDVR1"
                      offset="0x140"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="ETM Free-running Counter Reload Value">
        </register>
            <register name="SYNCFR"
                      offset="0x1E0"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000400"
                      caption="ETM Synchronization Frequency Register">
        </register>
