ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="IDR"
                      offset="0x1E4"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x4114F250"
                      caption="ETM ID Register">
        </register>
            <register name="CCER"
                      offset="0x1E8"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x18541800"
                      caption="ETM Configuration Code Extension Register">
        </register>
            <register name="TESSEICR"
                      offset="0x1F0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="ETM TraceEnable Start/Stop EmbeddedICE Control Register">
        </register>
            <register name="TSEVT"
                      offset="0x1F8"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="ETM TimeStamp Event Register">
        </register>
            <register name="TRACEIDR"
                      offset="0x200"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="ETM CoreSight Trace ID Register">
        </register>
            <register name="IDR2"
                      offset="0x208"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="ETM ID Register 2">
        </register>
            <register name="PDSR"
                      offset="0x314"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000001"
                      caption="ETM Device Power-Down Status Register">
        </register>
            <register name="ITMISCIN"
                      offset="0xEE0"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="ETM Integration Test Miscellaneous Inputs">
        </register>
            <register name="ITTRIGOUT"
                      offset="0xEE8"
                      rw="W"
                      size="4"
                      access-size="4"
                      caption="ETM Integration Test Trigger Out">
        </register>
            <register name="ITATBCTR2"
                      offset="0xEF0"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="ETM Integration Test ATB Control 2">
        </register>
            <register name="ITATBCTR0"
                      offset="0xEF8"
                      rw="W"
                      size="4"
                      access-size="4"
                      caption="ETM Integration Test ATB Control 0">
        </register>
            <register name="ITCTRL"
                      offset="0xF00"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="ETM Integration Mode Control Register">
               <bitfield name="INTEGRATION" caption="" mask="0x1"/>
            </register>
            <register name="CLAIMSET"
                      offset="0xFA0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      atomic-op="set:CLAIMSET"
                      caption="ETM Claim Tag Set Register">
        </register>
            <register name="CLAIMCLR"
                      offset="0xFA4"
                      rw="RW"
                      size="4"
                      access-size="4"
                      atomic-op="clear:CLAIMCLR"
                      caption="ETM Claim Tag Clear Register">
        </register>
            <register name="LAR"
                      offset="0xFB0"
                      rw="W"
                      size="4"
                      access-size="4"
                      caption="ETM Lock Access Register">
        </register>
            <register name="LSR"
                      offset="0xFB4"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="ETM Lock Status Register">
               <bitfield name="Present" caption="" mask="0x1"/>
               <bitfield name="Access" caption="" mask="0x2"/>
               <bitfield name="ByteAcc" caption="" mask="0x4"/>
            </register>
            <register name="AUTHSTATUS"
                      offset="0xFB8"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="ETM Authentication Status Register">
        </register>
            <register name="DEVTYPE"
                      offset="0xFCC"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000013"
                      caption="ETM CoreSight Device Type Register">
        </register>
            <register name="PIDR4"
                      offset="0xFD0"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000004"
                      caption="ETM Peripheral Identification Register #4">
        </register>
            <register name="PIDR5"
                      offset="0xFD4"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="ETM Peripheral Identification Register #5">
        </register>
            <register name="PIDR6"
                      offset="0xFD8"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="ETM Peripheral Identification Register #6">
        </register>
            <register name="PIDR7"
                      offset="0xFDC"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="ETM Peripheral Identification Register #7">
        </register>
            <register name="PIDR0"
                      offset="0xFE0"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000025"
                      caption="ETM Peripheral Identification Register #0">
        </register>
            <register name="PIDR1"
                      offset="0xFE4"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x000000B9"
                      caption="ETM Peripheral Identification Register #1">
        </register>
