ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="PID4"
                      offset="0xFD0"
                      rw="R"
                      size="4"
                      initval="0x00000004"
                      caption="ITM Peripheral Identification Register #4">
        </register>
            <register name="PID5"
                      offset="0xFD4"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="ITM Peripheral Identification Register #5">
        </register>
            <register name="PID6"
                      offset="0xFD8"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="ITM Peripheral Identification Register #6">
        </register>
            <register name="PID7"
                      offset="0xFDC"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="ITM Peripheral Identification Register #7">
        </register>
            <register name="PID0"
                      offset="0xFE0"
                      rw="R"
                      size="4"
                      initval="0x00000001"
                      caption="ITM Peripheral Identification Register #0">
        </register>
            <register name="PID1"
                      offset="0xFE4"
                      rw="R"
                      size="4"
                      initval="0x000000B0"
                      caption="ITM Peripheral Identification Register #1">
        </register>
            <register name="PID2"
                      offset="0xFE8"
                      rw="R"
                      size="4"
                      initval="0x0000003B"
                      caption="ITM Peripheral Identification Register #2">
        </register>
            <register name="PID3"
                      offset="0xFEC"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="ITM Peripheral Identification Register #3">
        </register>
            <register name="CID0"
                      offset="0xFF0"
                      rw="R"
                      size="4"
                      initval="0x0000000D"
                      caption="ITM Component  Identification Register #0">
        </register>
            <register name="CID1"
                      offset="0xFF4"
                      rw="R"
                      size="4"
                      initval="0x000000E0"
                      caption="ITM Component  Identification Register #1">
        </register>
            <register name="CID2"
                      offset="0xFF8"
                      rw="R"
                      size="4"
                      initval="0x00000005"
                      caption="ITM Component  Identification Register #2">
        </register>
            <register name="CID3"
                      offset="0xFFC"
                      rw="R"
                      size="4"
                      initval="0x000000B1"
                      caption="ITM Component  Identification Register #3">
        </register>
         </register-group>
      </module>
      <module name="MPU" version="1.0.0" caption="Memory Protection Unit">
         <register-group name="MPU" caption="Memory Protection Unit">
            <register name="TYPE"
                      offset="0x0"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="MPU Type Register">
               <bitfield name="SEPARATE"
                         caption="Separate instruction and Data Memory MapsRegions"
                         mask="0x1"/>
               <bitfield name="DREGION" caption="Number of Data Regions" mask="0xFF00"/>
               <bitfield name="IREGION"
                         caption="Number of Instruction Regions"
                         mask="0xFF0000"/>
            </register>
            <register name="CTRL"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="MPU Control Register">
               <bitfield name="ENABLE" caption="MPU Enable" mask="0x1"/>
               <bitfield name="HFNMIENA"
                         caption="Enable Hard Fault and NMI handlers"
                         mask="0x2"/>
               <bitfield name="PRIVDEFENA"
                         caption="Enables privileged software access to default memory map"
                         mask="0x4"/>
            </register>
            <register name="RNR"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="MPU Region Number Register">
               <bitfield name="REGION"
                         caption="Region referenced by RBAR and RASR"
                         mask="0xFF"/>
            </register>
            <register name="RBAR"
                      offset="0xC"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="MPU Region Base Address Register">
               <bitfield name="REGION" caption="Region number" mask="0xF"/>
               <bitfield name="VALID" caption="Region number valid" mask="0x10"/>
               <bitfield name="ADDR" caption="Region base address" mask="0xFFFFFFE0"/>
            </register>
            <register name="RASR"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="MPU Region Attribute and Size Register">
               <bitfield name="ENABLE" caption="Region Enable" mask="0x1"/>
               <bitfield name="SIZE" caption="Region Size" mask="0x2"/>
               <bitfield name="SRD" caption="Sub-region disable" mask="0xFF00"/>
               <bitfield name="B" caption="Bufferable bit" mask="0x10000"/>
               <bitfield name="C" caption="Cacheable bit" mask="0x20000"/>
               <bitfield name="S" caption="Shareable bit" mask="0x40000"/>
               <bitfield name="TEX" caption="TEX bit" mask="0x380000"/>
               <bitfield name="AP" caption="Access Permission" mask="0x7000000"/>
               <bitfield name="XN" caption="Execute Never Attribute" mask="0x10000000"/>
            </register>
            <register name="RBAR_A1"
                      offset="0x14"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="MPU Alias 1 Region Base Address Register">
               <bitfield name="REGION" caption="Region number" mask="0xF"/>
               <bitfield name="VALID" caption="Region number valid" mask="0x10"/>
               <bitfield name="ADDR" caption="Region base address" mask="0xFFFFFFE0"/>
            </register>
            <register name="RASR_A1"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="MPU Alias 1 Region Attribute and Size Register">
               <bitfield name="ENABLE" caption="Region Enable" mask="0x1"/>
               <bitfield name="SIZE" caption="Region Size" mask="0x2"/>
               <bitfield name="SRD" caption="Sub-region disable" mask="0xFF00"/>
               <bitfield name="B" caption="Bufferable bit" mask="0x10000"/>
               <bitfield name="C" caption="Cacheable bit" mask="0x20000"/>
               <bitfield name="S" caption="Shareable bit" mask="0x40000"/>
               <bitfield name="TEX" caption="TEX bit" mask="0x380000"/>
               <bitfield name="AP" caption="Access Permission" mask="0x7000000"/>
               <bitfield name="XN" caption="Execute Never Attribute" mask="0x10000000"/>
            </register>
