ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="RBAR_A2"
                      offset="0x1C"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="MPU Alias 2 Region Base Address Register">
               <bitfield name="REGION" caption="Region number" mask="0xF"/>
               <bitfield name="VALID" caption="Region number valid" mask="0x10"/>
               <bitfield name="ADDR" caption="Region base address" mask="0xFFFFFFE0"/>
            </register>
            <register name="RASR_A2"
                      offset="0x20"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="MPU Alias 2 Region Attribute and Size Register">
               <bitfield name="ENABLE" caption="Region Enable" mask="0x1"/>
               <bitfield name="SIZE" caption="Region Size" mask="0x2"/>
               <bitfield name="SRD" caption="Sub-region disable" mask="0xFF00"/>
               <bitfield name="B" caption="Bufferable bit" mask="0x10000"/>
               <bitfield name="C" caption="Cacheable bit" mask="0x20000"/>
               <bitfield name="S" caption="Shareable bit" mask="0x40000"/>
               <bitfield name="TEX" caption="TEX bit" mask="0x380000"/>
               <bitfield name="AP" caption="Access Permission" mask="0x7000000"/>
               <bitfield name="XN" caption="Execute Never Attribute" mask="0x10000000"/>
            </register>
            <register name="RBAR_A3"
                      offset="0x24"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="MPU Alias 3 Region Base Address Register">
               <bitfield name="REGION" caption="Region number" mask="0xF"/>
               <bitfield name="VALID" caption="Region number valid" mask="0x10"/>
               <bitfield name="ADDR" caption="Region base address" mask="0xFFFFFFE0"/>
            </register>
            <register name="RASR_A3"
                      offset="0x28"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="MPU Alias 3 Region Attribute and Size Register">
               <bitfield name="ENABLE" caption="Region Enable" mask="0x1"/>
               <bitfield name="SIZE" caption="Region Size" mask="0x2"/>
               <bitfield name="SRD" caption="Sub-region disable" mask="0xFF00"/>
               <bitfield name="B" caption="Bufferable bit" mask="0x10000"/>
               <bitfield name="C" caption="Cacheable bit" mask="0x20000"/>
               <bitfield name="S" caption="Shareable bit" mask="0x40000"/>
               <bitfield name="TEX" caption="TEX bit" mask="0x380000"/>
               <bitfield name="AP" caption="Access Permission" mask="0x7000000"/>
               <bitfield name="XN" caption="Execute Never Attribute" mask="0x10000000"/>
            </register>
         </register-group>
      </module>
      <module name="NVIC"
              version="1.0.0"
              caption="Nested Vectored Interrupt Controller">
         <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
            <register name="ISER"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      count="5"
                      initval="0"
                      caption="Interrupt Set Enable Register">
               <bitfield name="SETENA" caption="Interrupt set enable bits" mask="0xFFFFFFFF"/>
            </register>
            <register name="ICER"
                      offset="0x80"
                      rw="RW"
                      size="4"
                      access-size="4"
                      count="5"
                      initval="0"
                      caption="Interrupt Clear Enable Register">
               <bitfield name="CLRENA"
                         caption="Interrupt clear-enable bits"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="ISPR"
                      offset="0x100"
                      rw="RW"
                      size="4"
                      access-size="4"
                      count="5"
                      initval="0"
                      caption="Interrupt Set Pending Register">
               <bitfield name="SETPEND"
                         caption="Interrupt set-pending bits"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="ICPR"
                      offset="0x180"
                      rw="RW"
                      size="4"
                      access-size="4"
                      count="5"
                      initval="0"
                      caption="Interrupt Clear Pending Register">
               <bitfield name="CLRPEND"
                         caption="Interrupt clear-pending bits"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="IABR"
                      offset="0x200"
                      rw="RW"
                      size="4"
                      access-size="4"
                      count="5"
                      initval="0"
                      caption="Interrupt Active Bit Register">
               <bitfield name="ACTIVE" caption="Interrupt active bits" mask="0xFFFFFFFF"/>
            </register>
            <register name="IP"
                      offset="0x300"
                      rw="RW"
                      size="1"
                      access-size="1"
                      count="35"
                      initval="0"
                      caption="Interrupt Priority Register n">
               <bitfield name="PRI0" caption="Priority of interrupt n" mask="0x7"/>
            </register>
            <register name="STIR"
                      offset="0xE00"
                      rw="W"
                      size="4"
                      access-size="4"
                      caption="Software Trigger Interrupt Register">
               <bitfield name="INTID" caption="Interrupt ID to trigger" mask="0x1FF"/>
            </register>
         </register-group>
      </module>
