ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="CFSR"
                      offset="0xD28"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Configurable Fault Status Register">
               <bitfield name="IACCVIOL" caption="Instruction access violation" mask="0x1"/>
               <bitfield name="DACCVIOL" caption="Data access violation" mask="0x2"/>
               <bitfield name="MUNSTKERR"
                         caption="MemManage Fault on unstacking for exception return"
                         mask="0x8"/>
               <bitfield name="MSTKERR"
                         caption="MemManage Fault on stacking for exception entry"
                         mask="0x10"/>
               <bitfield name="MLSPERR"
                         caption="MemManager Fault occured during FP lazy state preservation"
                         mask="0x20"/>
               <bitfield name="MMARVALID"
                         caption="MemManage Fault Address Register valid"
                         mask="0x80"/>
               <bitfield name="IBUSERR" caption="Instruction bus error" mask="0x100"/>
               <bitfield name="PRECISERR" caption="Precise data bus error" mask="0x200"/>
               <bitfield name="IMPRECISERR" caption="Imprecise data bus error" mask="0x400"/>
               <bitfield name="UNSTKERR"
                         caption="BusFault on unstacking for exception return"
                         mask="0x800"/>
               <bitfield name="STKERR"
                         caption="BusFault on stacking for exception entry"
                         mask="0x1000"/>
               <bitfield name="LSPERR"
                         caption="BusFault occured during FP lazy state preservation"
                         mask="0x2000"/>
               <bitfield name="BFARVALID"
                         caption="BusFault Address Register valid"
                         mask="0x8000"/>
               <bitfield name="UNDEFINSTR"
                         caption="Undefined instruction UsageFault"
                         mask="0x10000"/>
               <bitfield name="INVSTATE" caption="Invalid state UsageFault" mask="0x20000"/>
               <bitfield name="INVPC" caption="Invalid PC load UsageFault" mask="0x40000"/>
               <bitfield name="NOCP" caption="No coprocessor UsageFault" mask="0x80000"/>
               <bitfield name="UNALIGNED"
                         caption="Unaligned access UsageFault"
                         mask="0x1000000"/>
               <bitfield name="DIVBYZERO"
                         caption="Divide by zero UsageFault"
                         mask="0x2000000"/>
            </register>
            <register name="HFSR"
                      offset="0xD2C"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="HardFault Status Register">
               <bitfield name="VECTTBL"
                         caption="BusFault on a Vector Table read during exception processing"
                         mask="0x2"/>
               <bitfield name="FORCED" caption="Forced Hard Fault" mask="0x40000000"/>
               <bitfield name="DEBUGEVT" caption="Debug: always write 0" mask="0x80000000"/>
            </register>
            <register name="DFSR"
                      offset="0xD30"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Debug Fault Status Register">
               <bitfield name="HALTED" caption="" mask="0x1"/>
               <bitfield name="BKPT" caption="" mask="0x2"/>
               <bitfield name="DWTTRAP" caption="" mask="0x4"/>
               <bitfield name="VCATCH" caption="" mask="0x8"/>
               <bitfield name="EXTERNAL" caption="" mask="0x10"/>
            </register>
            <register name="MMFAR"
                      offset="0xD34"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="MemManage Fault Address Register">
               <bitfield name="ADDRESS"
                         caption="Address that generated the MemManage fault"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="BFAR"
                      offset="0xD38"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="BusFault Address Register">
               <bitfield name="ADDRESS"
                         caption="Address that generated the BusFault"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="AFSR"
                      offset="0xD3C"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Auxiliary Fault Status Register">
               <bitfield name="IMPDEF" caption="AUXFAULT input signals" mask="0xFFFFFFFF"/>
            </register>
            <register name="PFR"
                      offset="0xD40"
                      rw="RW"
                      size="4"
                      access-size="4"
                      count="2"
                      caption="Processor Feature Register">
        </register>
            <register name="DFR"
                      offset="0xD48"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="Debug Feature Register">
        </register>
            <register name="ADR"
                      offset="0xD4C"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="Auxiliary Feature Register">
        </register>
            <register name="MMFR"
                      offset="0xD50"
                      rw="R"
                      size="4"
                      access-size="4"
                      count="4"
                      caption="Memory Model Feature Register">
        </register>
            <register name="ISAR"
                      offset="0xD60"
                      rw="R"
                      size="4"
                      access-size="4"
                      count="5"
                      caption="Instruction Set Attributes Register">
        </register>
