ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="CPACR"
                      offset="0xD88"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Coprocessor Access Control Register">
               <bitfield name="CP10"
                         caption="Access privileges for coprocessor 10"
                         mask="0x300000"
                         values="SystemControl_CPACR__CP10"/>
               <bitfield name="CP11"
                         caption="Access privileges for coprocessor 11"
                         mask="0xC00000"
                         values="SystemControl_CPACR__CP11"/>
            </register>
         </register-group>
         <value-group name="SystemControl_ICSR__NMIPENDSET">
            <value name="VALUE_0"
                   caption="Write: no effect; read: NMI exception is not pending"
                   value="0"/>
            <value name="VALUE_1"
                   caption="Write: changes NMI exception state to pending; read: NMI exception is pending"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_ICSR__PENDSTCLR">
            <value name="VALUE_0" caption="No effect" value="0"/>
            <value name="VALUE_1"
                   caption="Removes the pending state from the SysTick exception"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_ICSR__PENDSTSET">
            <value name="VALUE_0"
                   caption="Write: no effect; read: SysTick exception is not pending"
                   value="0"/>
            <value name="VALUE_1"
                   caption="Write: changes SysTick exception state to pending; read: SysTick exception is pending"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_ICSR__PENDSVCLR">
            <value name="VALUE_0" caption="No effect" value="0"/>
            <value name="VALUE_1"
                   caption="Removes the pending state from the PendSV exception"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_ICSR__PENDSVSET">
            <value name="VALUE_0"
                   caption="Write: no effect; read: PendSV exception is not pending"
                   value="0"/>
            <value name="VALUE_1"
                   caption="Write: changes PendSV exception state to pending; read: PendSV exception is pending"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_AIRCR__ENDIANNESS">
            <value name="VALUE_0" caption="Little-endian" value="0"/>
            <value name="VALUE_1" caption="Big-endian" value="1"/>
         </value-group>
         <value-group name="SystemControl_AIRCR__SYSRESETREQ">
            <value name="VALUE_0" caption="No system reset request" value="0"/>
            <value name="VALUE_1"
                   caption="Asserts a signal to the outer system that requests a reset"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_SCR__SEVONPEND">
            <value name="VALUE_0"
                   caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded"
                   value="0"/>
            <value name="VALUE_1"
                   caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_SCR__SLEEPDEEP">
            <value name="VALUE_0" caption="Sleep" value="0"/>
            <value name="VALUE_1" caption="Deep sleep" value="1"/>
         </value-group>
         <value-group name="SystemControl_SCR__SLEEPONEXIT">
            <value name="VALUE_0"
                   caption="Do not sleep when returning to Thread mode"
                   value="0"/>
            <value name="VALUE_1"
                   caption="Enter sleep, or deep sleep, on return from an ISR"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_CCR__STKALIGN">
            <value name="VALUE_0" caption="4-byte aligned" value="0"/>
            <value name="VALUE_1" caption="8-byte aligned" value="1"/>
         </value-group>
         <value-group name="SystemControl_CCR__UNALIGN_TRP">
            <value name="VALUE_0"
                   caption="Do not trap unaligned halfword and word accesses"
                   value="0"/>
            <value name="VALUE_1"
                   caption="Trap unaligned halfword and word accesses"
                   value="1"/>
         </value-group>
         <value-group name="SystemControl_CPACR__CP10">
            <value name="DENIED" caption="Access denied" value="0x0"/>
            <value name="PRIV" caption="Privileged access only" value="0x1"/>
            <value name="FULL" caption="Full access" value="0x3"/>
         </value-group>
         <value-group name="SystemControl_CPACR__CP11">
            <value name="DENIED" caption="Access denied" value="0x0"/>
            <value name="PRIV" caption="Privileged access only" value="0x1"/>
            <value name="FULL" caption="Full access" value="0x3"/>
         </value-group>
      </module>
      <module name="TPIU" version="1.0.0" caption="Trace Port Interface Unit">
         <register-group name="TPIU" caption="Trace Port Interface Register">
            <register name="SSPSR"
                      offset="0x0"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="Supported Parallel Port Size Register">
        </register>
            <register name="CSPSR"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Current Parallel Port Size Register">
        </register>
            <register name="ACPR"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Asynchronous Clock Prescaler Register">
               <bitfield name="PRESCALER" caption="" mask="0x1FFF"/>
            </register>
