ZigEmbeddedGroup/microzig/bsp/microchip/atsam/src/chips/ATSAMD51J19A.atdf
            <register name="SPPR"
                      offset="0xF0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Selected Pin Protocol Register">
               <bitfield name="TXMODE" caption="" mask="0x3"/>
            </register>
            <register name="FFSR"
                      offset="0x300"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="Formatter and Flush Status Register">
               <bitfield name="FlInProg" caption="" mask="0x1"/>
               <bitfield name="FtStopped" caption="" mask="0x2"/>
               <bitfield name="TCPresent" caption="" mask="0x4"/>
               <bitfield name="FtNonStop" caption="" mask="0x8"/>
            </register>
            <register name="FFCR"
                      offset="0x304"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Formatter and Flush Control Register">
               <bitfield name="EnFCont" caption="" mask="0x2"/>
               <bitfield name="TrigIn" caption="" mask="0x100"/>
            </register>
            <register name="FSCR"
                      offset="0x308"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="Formatter Synchronization Counter Register">
        </register>
            <register name="TRIGGER"
                      offset="0xEE8"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="TRIGGER">
               <bitfield name="TRIGGER" caption="" mask="0x1"/>
            </register>
            <register name="FIFO0"
                      offset="0xEEC"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="Integration ETM Data">
               <bitfield name="ETM0" caption="" mask="0xFF"/>
               <bitfield name="ETM1" caption="" mask="0xFF00"/>
               <bitfield name="ETM2" caption="" mask="0xFF0000"/>
               <bitfield name="ETM_bytecount" caption="" mask="0x3000000"/>
               <bitfield name="ETM_ATVALID" caption="" mask="0x4000000"/>
               <bitfield name="ITM_bytecount" caption="" mask="0x18000000"/>
               <bitfield name="ITM_ATVALID" caption="" mask="0x20000000"/>
            </register>
            <register name="ITATBCTR2"
                      offset="0xEF0"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="ITATBCTR2">
               <bitfield name="ATREADY" caption="" mask="0x1"/>
            </register>
            <register name="ITATBCTR0"
                      offset="0xEF8"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="ITATBCTR0">
               <bitfield name="ATREADY" caption="" mask="0x1"/>
            </register>
            <register name="FIFO1"
                      offset="0xEFC"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="Integration ITM Data">
               <bitfield name="ITM0" caption="" mask="0xFF"/>
               <bitfield name="ITM1" caption="" mask="0xFF00"/>
               <bitfield name="ITM2" caption="" mask="0xFF0000"/>
               <bitfield name="ETM_bytecount" caption="" mask="0x3000000"/>
               <bitfield name="ETM_ATVALID" caption="" mask="0x4000000"/>
               <bitfield name="ITM_bytecount" caption="" mask="0x18000000"/>
               <bitfield name="ITM_ATVALID" caption="" mask="0x20000000"/>
            </register>
            <register name="ITCTRL"
                      offset="0xF00"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="Integration Mode Control">
               <bitfield name="Mode" caption="" mask="0x1"/>
            </register>
            <register name="CLAIMSET"
                      offset="0xFA0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      atomic-op="set:CLAIMSET"
                      caption="Claim tag set">
        </register>
            <register name="CLAIMCLR"
                      offset="0xFA4"
                      rw="RW"
                      size="4"
                      access-size="4"
                      atomic-op="clear:CLAIMCLR"
                      caption="Claim tag clear">
        </register>
            <register name="DEVID"
                      offset="0xFC8"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="TPIU_DEVID">
               <bitfield name="NrTraceInput" caption="" mask="0x1"/>
               <bitfield name="AsynClkIn" caption="" mask="0x20"/>
               <bitfield name="MinBufSz" caption="" mask="0x1C0"/>
               <bitfield name="PTINVALID" caption="" mask="0x200"/>
               <bitfield name="MANCVALID" caption="" mask="0x400"/>
               <bitfield name="NRZVALID" caption="" mask="0x800"/>
            </register>
            <register name="DEVTYPE"
                      offset="0xFCC"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="TPIU_DEVTYPE">
               <bitfield name="SubType" caption="" mask="0xF"/>
               <bitfield name="MajorType" caption="" mask="0xF0"/>
            </register>
         </register-group>
      </module>
   </modules>
   <pinouts>
      <pinout name="SAMD51JU" caption="SAMD51JU">
         <pin position="A1" pad="PA25"/>
         <pin position="A2" pad="PB22"/>
         <pin position="A3" pad="PB23"/>
         <pin position="A4" pad="VDDCORE"/>
         <pin position="A5" pad="VSW"/>
         <pin position="A6" pad="PB30"/>
         <pin position="A7" pad="PB00"/>
         <pin position="A8" pad="PB02"/>
         <pin position="B1" pad="PA24"/>
         <pin position="B2" pad="GNDIO"/>
         <pin position="B3" pad="PA27"/>
         <pin position="B4" pad="RESET_N"/>
         <pin position="B5" pad="VDDIO"/>
         <pin position="B6" pad="PB31"/>
         <pin position="B7" pad="PB01"/>
         <pin position="B8" pad="PA00"/>
         <pin position="C1" pad="PA22"/>
         <pin position="C2" pad="PA23"/>
         <pin position="C3" pad="VDDIO"/>
         <pin position="C4" pad="GNDIO"/>
         <pin position="C5" pad="PA30"/>
         <pin position="C6" pad="PB03"/>
         <pin position="C7" pad="PA02"/>
         <pin position="C8" pad="PA01"/>
         <pin position="D1" pad="PB17"/>
         <pin position="D2" pad="PA20"/>
         <pin position="D3" pad="PA21"/>
         <pin position="D4" pad="PB16"/>
         <pin position="D5" pad="PA31"/>
         <pin position="D6" pad="PA03"/>
         <pin position="D7" pad="PB04"/>
         <pin position="D8" pad="PB05"/>
         <pin position="E1" pad="PA18"/>
         <pin position="E2" pad="PA19"/>
         <pin position="E3" pad="VDDIO"/>
         <pin position="E4" pad="VDDIOB"/>
         <pin position="E5" pad="GNDANA"/>
         <pin position="E6" pad="PB07"/>
         <pin position="E7" pad="PB06"/>
         <pin position="E8" pad="VDDANA"/>
         <pin position="F1" pad="PA17"/>
         <pin position="F2" pad="PA12"/>
         <pin position="F3" pad="GNDIO"/>
         <pin position="F4" pad="GNDIO"/>
         <pin position="F5" pad="PB08"/>
         <pin position="F6" pad="PA05"/>
         <pin position="F7" pad="PA04"/>
         <pin position="F8" pad="PB09"/>
         <pin position="G1" pad="PA16"/>
         <pin position="G2" pad="PA13"/>
         <pin position="G3" pad="PB14"/>
         <pin position="G4" pad="PB11"/>
         <pin position="G5" pad="PA11"/>
         <pin position="G6" pad="PA09"/>
         <pin position="G7" pad="PA06"/>
         <pin position="G8" pad="PA07"/>
         <pin position="H1" pad="PA14"/>
         <pin position="H2" pad="PA15"/>
         <pin position="H3" pad="PB15"/>
         <pin position="H4" pad="PB13"/>
         <pin position="H5" pad="PB12"/>
         <pin position="H6" pad="PB10"/>
         <pin position="H7" pad="PA10"/>
         <pin position="H8" pad="PA08"/>
      </pinout>
      <pinout name="SAMD51J" caption="SAMD51J">
         <pin position="1" pad="PA00"/>
         <pin position="2" pad="PA01"/>
         <pin position="3" pad="PA02"/>
         <pin position="4" pad="PA03"/>
         <pin position="5" pad="PB04"/>
         <pin position="6" pad="PB05"/>
         <pin position="7" pad="GNDANA"/>
         <pin position="8" pad="VDDANA"/>
         <pin position="9" pad="PB06"/>
         <pin position="10" pad="PB07"/>
         <pin position="11" pad="PB08"/>
         <pin position="12" pad="PB09"/>
         <pin position="13" pad="PA04"/>
         <pin position="14" pad="PA05"/>
         <pin position="15" pad="PA06"/>
         <pin position="16" pad="PA07"/>
         <pin position="17" pad="PA08"/>
         <pin position="18" pad="PA09"/>
         <pin position="19" pad="PA10"/>
         <pin position="20" pad="PA11"/>
         <pin position="21" pad="VDDIOB"/>
         <pin position="22" pad="GND"/>
         <pin position="23" pad="PB10"/>
         <pin position="24" pad="PB11"/>
         <pin position="25" pad="PB12"/>
         <pin position="26" pad="PB13"/>
         <pin position="27" pad="PB14"/>
         <pin position="28" pad="PB15"/>
         <pin position="29" pad="PA12"/>
         <pin position="30" pad="PA13"/>
         <pin position="31" pad="PA14"/>
         <pin position="32" pad="PA15"/>
         <pin position="33" pad="GND"/>
         <pin position="34" pad="VDDIO"/>
         <pin position="35" pad="PA16"/>
         <pin position="36" pad="PA17"/>
         <pin position="37" pad="PA18"/>
         <pin position="38" pad="PA19"/>
         <pin position="39" pad="PB16"/>
         <pin position="40" pad="PB17"/>
         <pin position="41" pad="PA20"/>
         <pin position="42" pad="PA21"/>
         <pin position="43" pad="PA22"/>
         <pin position="44" pad="PA23"/>
         <pin position="45" pad="PA24"/>
         <pin position="46" pad="PA25"/>
         <pin position="47" pad="GND"/>
         <pin position="48" pad="VDDIO"/>
         <pin position="49" pad="PB22"/>
         <pin position="50" pad="PB23"/>
         <pin position="51" pad="PA27"/>
         <pin position="52" pad="RESET_N"/>
         <pin position="53" pad="VDDCORE"/>
         <pin position="54" pad="GND"/>
         <pin position="55" pad="VSW"/>
         <pin position="56" pad="VDDIO"/>
         <pin position="57" pad="PA30"/>
         <pin position="58" pad="PA31"/>
         <pin position="59" pad="PB30"/>
         <pin position="60" pad="PB31"/>
         <pin position="61" pad="PB00"/>
         <pin position="62" pad="PB01"/>
         <pin position="63" pad="PB02"/>
         <pin position="64" pad="PB03"/>
      </pinout>
   </pinouts>
</avr-tools-device-file>
